windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
///*****************************************
//  Copyright (C) 2009-2014
//  ITE Tech. Inc. All Rights Reserved
//  Proprietary and Confidential
///*****************************************
//   @file   <Utility.c>
//   @author wuxiaoyong
//   @date   2012/11/09
//   @fileversion: IT6623_Sample_1.04
//******************************************/
#include <string.h>
#include "main.h"
#include "stm32f10x.h"
#include "uart.h"
#include "dvCPLD.h"

#include "si_drv_nvram_sram.h"
#include "sk_application.h"
#include "si_cra.h"
#include "si_regs_pp953x.h"
#include "si_drv_device.h"
#include "si_tx_component.h"
#include "si_drv_tpi_system.h"
#include "si_tx_hdcp.h"
#include "dvPC9539.h"
#include <stdarg.h>
#include "dvNVRAM.h"
#include "dvADN4604.h"
#include "BSP_I2C.h"
//#include "si_drv_adapter_internal.h"
#include "si_app_adapter_rx.h"
#include "si_drv_adapter_rx.h"
#include "dvNVRAM.h"
#include "util.h"
#include "appSystemMgrAPI.h"
#include "appUserInterface.h"
#include "si_cec_enums.h"
#include "si_debugger_hdmigear.h"
#include "si_logger.h"
#include "GitHash.h"
#include "Si_timer.h"
#include "Sk_avr_repeater.h"
#include "appPowerMgrAPI.h"
#include "Si_edid_tx_component.h"
#include "LedReceiveEvent.h"
#include "SwitchVideoReceiveEvent.h"
#include "KeyTasks.h"

//===================================

#define  SWITCH_CMD_COTINUE    // 切花指令可以1切多
vu8      USART_data_flag = 0; //0  正常指令     1 EDID串口更新指令    2内置EDID串口更新指令
vu16     USART_EDIDdata_count = 0;   // 串口接收EDID 数据数量
uint8_t  EDID_updata_port = 0; // 升级EDIDD的端口
uint8_t  USART_EDIDdata[EDID_TABLE_LEN];
/////////////////////////////////////////////////////////////////////////
uint8_t  USART1_RX_BUFF[USART1_RX_BUFF_MAX]; //串口接收数据区

// 指向当前要接收数据的buffer ( 尾指针)
vu8      *USART1_rxpoint;  //在中断里有比较的动作，所以这里用volatile型变量
//vu8      rxdelay_USART1 = 100; // 串口接收数据后计时器
WORD     g_wUSART1_TIMER;
// TRUE: 有数据收到
BOOL     g_bUSART1_DataReceived; // vu8 uart_data_in_start = 0; //有数据在接收
BOOL     g_bUSART1_DataComplete; // TRUE: the RX message is complete vu8 uart_data_in_end = 0; //数据接收完成
//uint8_t IR_carrier_mode = 0;
char     USART1_tx_buff[USART1_TX_BUFF_MAX];

uint8_t OutHDCP_Flag[MAX_OUT]={0};
uint16_t OutHDCP_TimeDelay[MAX_OUT]={0};

static clock_time_t EdidUpataStart = 0;
static BOOL m_bCommdDemo = FALSE; // kyq 20150929
static BOOL bDemoEn = FALSE;
extern uint8_t g_Init_EdidFlashEdidTable[];

extern char LCD1_IDLE_TEXT[17];
extern char LCD2_IDLE_TEXT[17];

#if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
extern BYTE KeyInput[8];
#endif
BOOL  System_UnLock_flag;
BYTE  u8IChannellock[MAX_OUT];
BYTE u8RemoteBaudRate = 0;

struct Demo_struct
{
    uint8_t InChanel;
    uint8_t OutChanel;
}Demo_buff;

#if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
void SetUartDelayReceiveForPoweronFunction(unsigned int u16Time)
{
    SiiPlatformTimerSet(etPWON_DELAY,mS_TO_TICKS(u16Time),0xFF);
}

unsigned char GetUartReceiveStar(void)
{
    if(SiiPlatformTimerGet(etPWON_DELAY)!=0)
    {
        return 0; // time not enougth
    }
    return 1;
}
#endif

///////////////////////////////////////////////////////////////////////////////////////////////////////////
void UART1_SendByte(u16 Data)
{
    while (!(USART1->SR & USART_FLAG_TXE));
    USART1->DR = (Data & (uint16_t)0x01FF);
    while (!(USART1->SR & USART_FLAG_TC));
}

void UART1_SendBytes(const unsigned char  *Data, u8 num)
{
    u8 i = 0;
    for (i = 0; i < num; i++)	  UART1_SendByte(*(Data + i));
}

extern void USART1_Configuration(void);
bool_t UserUARTinitialize(void)
{
     UART1_Init();
     USART1_Configuration();
    return 1;
}

void USART1_IRQHandler(void)
{
    BYTE cData;
    //if(uart_data_in_end == 0)
    //{
    //rxdelay_USART1 = 40;
    
    //g_wUSART1_TIMER = mS_TO_TICKS(100);  // 100ms
    g_wUSART1_TIMER = mS_TO_TICKS(50);  // 100ms
    g_bUSART1_DataReceived = TRUE;  //uart_data_in_start = 1;
    if (USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)
    {
        cData = USART1->DR;
        //UART1_SendByte(cData);
        if (USART_data_flag == 0)
        {
            if (USART1_rxpoint < (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                *USART1_rxpoint++ = cData;

            if (USART1_rxpoint >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
            {
                USART1_rxpoint = USART1_RX_BUFF;
                IWDG_ReloadCounter(); //喂狗
            }
        }
        else
        {
            //  1 EDID串口更新指令
            if (USART_EDIDdata_count < EDID_TABLE_LEN) ////[kyq add: 20150901 20:12:34]
            {
                USART_EDIDdata[USART_EDIDdata_count] = cData;
                USART_EDIDdata_count++;
            }
        }
    }
    //else  UART_temp = USART1->DR;  //串口清中断是当你读走数据后硬件自动完成清中断

    if (USART_GetITStatus(USART1, USART_IT_ORE) != RESET)
    {
        USART_ClearFlag(USART1, USART_IT_ORE);
        cData = USART1->DR;  //串口清中断是当你读走数据后硬件自动完成清中断
    }

}






/**********************************************************************************************************
* 函数介绍： 在str1中查找str2，如果找到，则返回str1中str2最后一个字母的下一个地址，否则返回NULL
* 输入参数：			
* 输出参数：
* 返回值  ：
**********************************************************************************************************/
// 这个函数只能和串口接收的数据比较
//
#if(MACHINETYPE==PRD_VHD4)
// 只比较开头部分
unsigned char* StrCmp(unsigned char *str1, unsigned char *str2, unsigned char *USART1_rxprocesspoint) //USART1_rxprocesspoint 是尾指令
{
    WORD strlength1,strlength2, i;
    strlength1 = strlen((char *)str1);
    strlength2 = strlen((char *)str2);

    for (i = 0 ; (i< strlength2)&&(str1 < USART1_rxprocesspoint) ; i++)
    {
        if (*str1 == *str2)
        {
              str1++;
              str2++;
        }
        else
            break;
    }
    if (i==strlength2)
    {
      return str1;
    }
    return NULL;
}
#else
unsigned char* StrCmp(unsigned char *str1, unsigned char *str2, unsigned char *USART1_rxprocesspoint) //USART1_rxprocesspoint 是尾指令
{
    WORD strlength, i;

    strlength = strlen((char *)str2);
    while (str1 != USART1_rxprocesspoint)
    {
        if (*str1 == *str2)
        {
            for (i = 0; i < strlength; i++)
            {
                if (*str1 == *str2)
                {
                    str1++;
                    if (str1 >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                        str1 = USART1_RX_BUFF;
                    str2++;
                }
                else
                    return NULL;
            }
            return str1;
        }
        else
        {
            str1++;
            if (str1 >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
            {
                str1 = USART1_RX_BUFF;
                break; // Error
            }
        }
    }
    return NULL;
}
#endif
//         begin
// stR1: P  P  P   W   O   N  .
// str2:      P  W  O     N.
BOOL  StrCmp2(unsigned char *str1, unsigned char *str2, unsigned char *USART1_rxEnd) //USART1_rxprocesspoint 是尾指令
{
    unsigned char *str1_begin = str1;
    //unsigned char *str2_begin  = str2;
    while (str1_begin < USART1_rxEnd)
    {
        if (StrCmp(str1, str2, USART1_rxEnd) == NULL)
        {
            str1_begin++;
            str1 = str1_begin;
            //str2 = str2_begin;
        }
        else
        {
            return TRUE;
        }

