windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
    }
    return FALSE;
}


/*
** HEX和ASCII之间的转换 wf8421 20160815
*/
unsigned char HexAndAsciiChange(unsigned char cvalue,unsigned char cmode)  // cmode : 1 Hex to Ascii    0: Ascii to Hex
{
    unsigned char reValue=0;
    
    if(cmode == 1)
    {
        if((cvalue&0x0F)>=0&&(cvalue&0x0F)<=9)
        {
            reValue=cvalue+'0';
        }
        else if((cvalue&0x0F)>=0x0A&&(cvalue&0x0F)<=0x0F)
        {
            reValue=cvalue-0x0A+'A';
        }
        else
        {
            reValue=cvalue;
            //printf("Change error: %x\n",cvalue);
        }
    }
    else
    {
        if(((cvalue)>='0'&&(cvalue)<='9'))
        {
            reValue=cvalue-'0';
        }
        else if((cvalue)>='A'&&(cvalue)<='F')
        {
            reValue=cvalue+0x0A-'A';
        }
        else if((cvalue)>='a'&&(cvalue)<='f')
        {
            reValue=cvalue+0x0A-'a';
        }
        else
        {
            reValue=cvalue;
            //printf("Change error: %x\n",cvalue);
        }
    }
    
    return reValue;
}

//从第128字节开始存放视频切换信息   F0 ~ F9  每块 16字节 共160字节
//从第288字节开始存放视频切换信息   F0 ~ F9  每块 116字节 共160字节



unsigned char EDID_GetDataBlockAddr(unsigned char *pTarget, unsigned char Tag, unsigned char Start)
{
    unsigned int i = 0;
    if (pTarget[126] >= 0x01)
    {
        for (i = Start; i < (pTarget[130] + 128); ++i)
        {
            if ((pTarget[i] & 0xE0) == Tag)  // find tag code
            {
                return i;
            }
            else
            {
                i += (pTarget[i] & 0x1F);
            }
        }
        if (i >= (pTarget[130] + 128))  // Error, can not find
        {
            return 0;
        }
    }
    return 0;
}

// 更新输入口的EDID
void do_with_EDID_UP(void)
{
    unsigned char j = 0, crc = 0/*, ediden = 0*/;
    unsigned int i = 0;

    if ((USART_EDIDdata_count == 128) || (USART_EDIDdata_count == 256))
    {
        for (i = 0; i < USART_EDIDdata_count; i++) crc += USART_EDIDdata[i];
        if (crc == 0)
        {

            if ((EDID_updata_port > 0) && (EDID_updata_port < edsEDID_INTERN1))
            {

                if (TRUE) 
                {
                    appSystemInputPortEdidDataSet(EDID_updata_port - 1, (eEDIDSELECT)(edsEDID_IN1 + EDID_updata_port - 1), USART_EDIDdata);
                    IWDG_ReloadCounter(); //喂狗
                }
                UART1_SendBytes("EDID Upgrade OK!\r\n", strlen("EDID Upgrade OK!\r\n"));
            }
            else if (EDID_updata_port == edsEDID_INTERN1)
            {
                for (j = 0; j < MAX_IN; j++)
                {
                    appSystemInputPortEdidDataSet(j, (eEDIDSELECT)(edsEDID_IN1 + j), USART_EDIDdata);
                    IWDG_ReloadCounter(); //喂狗
                }
                UART1_SendBytes("EDID Upgrade OK!\r\n", strlen("EDID Upgrade OK!\r\n"));
            }
            else
                UART1_SendBytes("EDID Upgrade Fail!\r\n", strlen("EDID Upgrade Fail!\r\n"));
        }
        else
            UART1_SendBytes("EDID Upgrade Fail!\r\n", strlen("EDID Upgrade Fail!\r\n"));
    }
    else
        UART1_SendBytes("EDID Upgrade Fail!\r\n", strlen("EDID Upgrade Fail!\r\n"));
}

//对内置EDID 更新
void do_with_int_EDID_UP(void)
{
    unsigned char crc = 0;
    unsigned int i = 0;
    unsigned char g_tempData[EDID_TABLE_LEN]={0};
    if ((USART_EDIDdata_count == 128) || (USART_EDIDdata_count == 256))
    {
        for (i = 0; i < USART_EDIDdata_count; i++) crc += USART_EDIDdata[i];
        if (crc == 0)
        {
            if (EDID_updata_port <= (edsEDID_EXTERN1-edsEDID_INTERN1))
            {
                //write_int_EDID(EDID_updata_port, USART_EDIDdata);
				dvNVRAMUserEdidWrite(edsEDID_INTERN1 + EDID_updata_port - 1, USART_EDIDdata);
				UART1_SendBytes("IntEDID Upgrade OK!\r\n", strlen("IntEDID Upgrade OK!\r\n"));
			    //读取目前对应的默认EDID数据  
				dvNVRAMUserEdidRead(edsEDID_INTERN1 + EDID_updata_port - 1,g_tempData);
			    //此函数在有些机型最多发送128位，为了兼容256bytes 分2次发送
				UART1_SendBytes(g_tempData,EDID_TABLE_LEN>>1);  		
				UART1_SendBytes(g_tempData+(EDID_TABLE_LEN>>1),EDID_TABLE_LEN>>1);
            }
            else
                UART1_SendBytes("IntEDID Upgrade Fail!\r\n", strlen("IntEDID Upgrade Fail!\r\n"));
        }
        else
            UART1_SendBytes("IntEDID Upgrade Fail!\r\n", strlen("IntEDID Upgrade Fail!\r\n"));
    }
    else
        UART1_SendBytes("IntEDID Upgrade Fail!\r\n", strlen("IntEDID Upgrade Fail!\r\n"));
}


unsigned char get_ip_add(unsigned char *pp, unsigned char *data)
{
    unsigned char i = 0;
    unsigned char IP_add_temp[4] = { 0, 0, 0, 0 };
    pp += 1;
    while ((*pp != '.') && (*pp != 0xfe))
    {
        IP_add_temp[0] = IP_add_temp[0] * 10 + (*pp - 0x30);
        pp++;
        i++;
        if(i>=3)
            break;
    }
    //if (IP_add_temp[0] > 255)
    //    return 0;
    i = 0;
    pp++;
    while ((*pp != '.') && (*pp != 0xfe))
    {
        IP_add_temp[1] = IP_add_temp[1] * 10 + (*pp - 0x30);
        pp++;
        i++;
        if(i>=3)
            break;
    }
    //if (IP_add_temp[1] > 255)
    //    return 0;
    i = 0;
    pp++;
    while ((*pp != '.') && (*pp != 0xfe))
    {
        IP_add_temp[2] = IP_add_temp[2] * 10 + (*pp - 0x30);
        pp++;
        i++;
        if(i>=3)
            break;
    }
    //if (IP_add_temp[2] > 255)
    //    return 0;
    i = 0;
    pp++;
    while ((*pp != '.') && (*pp != 0xfe))
    {
        IP_add_temp[3] = IP_add_temp[3] * 10 + (*pp - 0x30);
        pp++;
        i++;
        if(i>=3||(*pp == 0x00))
            break;
    }
    //if (IP_add_temp[3] > 255)
    //    return 0;

    for (i = 0; i < 4; i++) data[i] = IP_add_temp[i];
    return 1;
}



//------------------Begain Process the uart struction([X1]V[X2])-------------------------
#ifndef SWITCH_CMD_COTINUE
void ProessVedioSwitch(BYTE cInPort, BYTE cOutPort, SWITCH_e eFlag)
{
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	if(eSWITCH_OFF == eFlag)
	{
	        cOutPort = cOutPort - '0' - 1;
	        cCount += SiiSprintf((char*)&acMessage2[cCount], "%2d Closed.", cOutPort + 1);
	        appUIUartMessageSet(NULL, acMessage2, TRUE);
	        appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulClose);
	        appUIStateChange(uiUART_SWITCH_VIDEO);
	        appSystemSwitcherSet(cInPort, 1, cOutPort);
	}
	else if(eSWITCH_ON == eFlag)
	{
	        cOutPort = cOutPort - '0' - 1;
            //cCount += SiiSprintf(&acMessage2[cCount], "AV: 01->%2d", cOutPort + 1);
            cCount += SiiSprintf((char*)&acMessage2[cCount], "AV: %02d->%2d", cInPort + 1, cOutPort + 1);
            appUIUartMessageSet(NULL, acMessage2, TRUE);
            appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
            appUIStateChange(uiUART_SWITCH_VIDEO);	
            appSystemSwitcherSet(cInPort, 1, cOutPort);
	}
}
#else
void ProessVedioSwitch(BYTE cInPort, unsigned int i, PBYTE acOutPortList)
{        Event_t   bEvent;
      //  appUartSwitchInfoSet(cInPort, i,pOutPortList,TRUE);
      //  appSystemSwitcherPortSet(cInPort, i, pOutPortList);  // 0V
      		//Event_t   bEvent;
		bEvent.Head.opcode=eLEDChannelSwitch;
		bEvent.Head.DestAddr=mqLED;
		bEvent.args[0]=cInPort-1;
	       bEvent.args[1]=i;
		memcpy(&bEvent.args[2],acOutPortList,i);
		bEvent.Head.argCount=i+2;
	       utilExecOlnyMsgSend(mqLED,
                            bEvent);
               /****************/	
            //***********************************************
              bEvent.Head.opcode=eSwitchxTox;
		bEvent.Head.DestAddr=mqSWITCH;
		bEvent.args[0]=cInPort-1;
	       bEvent.args[1]=i;
		memcpy(&bEvent.args[2],acOutPortList,i);
		bEvent.Head.argCount=i+2;
	       utilExecOlnyMsgSend(mqSWITCH,
                            bEvent);
          //***************************************************
}
#endif
//-----------------End Process the uart struction([X1]V[X2])---------------------------


//-----------------Begain Process the uart struction([X1]B[X2])------------------------
#ifndef SWITCH_CMD_COTINUE
void ProessVedioIRSwitch(BYTE cInPort, BYTE cOutPort, SWITCH_e eFlag)
{
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	if(eSWITCH_OFF == eFlag)
	{
	        cOutPort = cOutPort - '0' - 1;
	        cCount += SiiSprintf((char*)&acMessage2[cCount], "%2d Closed.", cOutPort + 1);
	        appUIUartMessageSet(NULL, acMessage2, TRUE);
	        appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulClose);
	        appUIStateChange(uiUART_SWITCH_VIDEO);
	        appSystemSwitcherSet(cInPort, 1, cOutPort);
	        appSystemIRSwitcherSet(cInPort, 1, cOutPort);
	}
	else if(eSWITCH_ON == eFlag)
	{
	        cOutPort = cOutPort - '0' - 1;
            //cCount += SiiSprintf(&acMessage2[cCount], "AV: 01->%2d", cOutPort + 1);
            cCount += SiiSprintf((char*)&acMessage2[cCount], "AV: %02d->%2d", cInPort + 1, cOutPort + 1);
            appUIUartMessageSet(NULL, acMessage2, TRUE);
            appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
            appUIStateChange(uiUART_SWITCH_VIDEO);
            appSystemSwitcherSet(cInPort, 1, cOutPort);
            appSystemIRSwitcherSet(cInPort, 1, cOutPort);
	}
}
#else
void ProessVedioIRSwitch(BYTE cInPort, unsigned int i, PBYTE acOutPortList)
{    
            Event_t   bEvent;
     
                //  appUartSwitchInfoSet(cInPort-1, i, acOutPortList,TRUE);
             //   appSystemSwitcherPortSet(cInPort-1, i, acOutPortList); // 3B
                            /****************/
		//Event_t   bEvent;
		bEvent.Head.opcode=eLEDChannelSwitch;
		bEvent.Head.DestAddr=mqLED;
		bEvent.args[0]=cInPort-1;
	       bEvent.args[1]=i;
		memcpy(&bEvent.args[2],acOutPortList,i);
		bEvent.Head.argCount=i+2;
	       utilExecOlnyMsgSend(mqLED,
                            bEvent);
               /****************/	
            //***********************************************
              bEvent.Head.opcode=eSwitchxTox;
		bEvent.Head.DestAddr=mqSWITCH;
		bEvent.args[0]=cInPort-1;
	       bEvent.args[1]=i;
		memcpy(&bEvent.args[2],acOutPortList,i);
		bEvent.Head.argCount=i+2;
	       utilExecOlnyMsgSend(mqSWITCH,
                            bEvent);
          //***************************************************
               appSystemIRSwitcherPortSet(cInPort-1, i, acOutPortList);
}

void HexProessVedioIRSwitch(BYTE cInPort, unsigned int i, PBYTE acOutPortList)
{    
            Event_t   bEvent;
     
                //  appUartSwitchInfoSet(cInPort-1, i, acOutPortList,TRUE);
             //   appSystemSwitcherPortSet(cInPort-1, i, acOutPortList); // 3B
                            /****************/
		//Event_t   bEvent;
		bEvent.Head.opcode=eLEDChannelSwitch;
		bEvent.Head.DestAddr=mqLED;
		bEvent.args[0]=cInPort-1;
	       bEvent.args[1]=i;
		memcpy(&bEvent.args[2],acOutPortList,i);
		bEvent.Head.argCount=i+2;
	       utilExecOlnyMsgSend(mqLED,
                            bEvent);
               /****************/	
            //***********************************************
              bEvent.Head.opcode=eSwitchxTox;
		bEvent.Head.DestAddr=mqSWITCH;
		bEvent.args[0]=(cInPort-1)|0x80;
	       bEvent.args[1]=i;
		memcpy(&bEvent.args[2],acOutPortList,i);
		bEvent.Head.argCount=i+2;
	       utilExecOlnyMsgSend(mqSWITCH,
                            bEvent);
          //***************************************************
               appSystemIRSwitcherPortSet(cInPort-1, i, acOutPortList);
}
#endif
//----------------End Process the uart struction([X1]B[X2])----------------------------


