windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
//----------------Begain Process the uart struction([X1]R[X2])-------------------------
#ifndef SWITCH_CMD_COTINUE
void ProessIRSwitch(BYTE cInPort, BYTE cOutPort, SWITCH_e eFlag)
{
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	if(eSWITCH_OFF == eFlag)
	{
	        cOutPort = cOutPort - '0' - 1;
            cCount += SiiSprintf((char*)&acMessage2[cCount], "%2d Closed.", cOutPort + 1);
            appUIUartMessageSet(NULL, acMessage2, TRUE);
            appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulClose);
            appUIStateChange(uiUART_SWITCH_VIDEO);
            appSystemIRSwitcherSet(cInPort, 1, cOutPort);
	}
	else if(eSWITCH_ON == eFlag)
	{
	        cOutPort = cOutPort - '0' - 1;
            //cCount += SiiSprintf(&acMessage2[cCount], "IR: 01->%2d", cOutPort + 1);
            cCount += SiiSprintf((char*)&acMessage2[cCount], "IR: %02d->%2d", cInPort + 1, cOutPort + 1);
            appUIUartMessageSet(NULL, acMessage2, TRUE);
            appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
            appUIStateChange(uiUART_SWITCH_VIDEO);
            appSystemIRSwitcherSet(cInPort, 1, cOutPort);
	}
}
#else
void ProessIRSwitch(BYTE cInPort, unsigned int i, PBYTE pOutPortList)
{
        appUartSwitchInfoSet(cInPort, i, pOutPortList,FALSE);
        appSystemIRSwitcherPortSet(cInPort, i, pOutPortList);
}
#endif
//---------------End Process the uart struction([X1]R[X2])-----------------------------


//---------------Begain Process the uart struction(/+[Y]/[X]:******.)-----------------------------------------
//---------------This API only send data to remote when the state of the product is POWON or POWOFF-----------
#ifdef PRD_POWER_ONOFF_MESSAGE
void ProcessSendData2Remote(BYTE cRemote, BYTE cBraud, unsigned char* puart_data_temp, unsigned int count, BYTE cbPowrON)
{
	unsigned int i = 0;
	PSYSTEM_SETTING_DATA   psSystemSettingData;
    psSystemSettingData = utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
    if (cbPowrON)
    {

        psSystemSettingData->acPowerOnMsgBaudRate[cRemote] = cBraud;
        psSystemSettingData->acPowerOnMsgLength[cRemote] = count;
        for (i = 0; i < count; i++)
        {
            psSystemSettingData->acPowerOnMsg[cRemote][i] = puart_data_temp[i];
        }
        psSystemSettingData->acPowerOnMsg[cRemote][i] = '\0';

    }
    else
    {
        psSystemSettingData->acPowerOffMsgBaudRate[cRemote] = cBraud;
        psSystemSettingData->acPowerOffMsgLength[cRemote] = count;
        for (i = 0; i < count; i++)
        {
            psSystemSettingData->acPowerOffMsg[cRemote][i] = puart_data_temp[i];
        }
        psSystemSettingData->acPowerOffMsg[cRemote][i] = '\0';
    }
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);

    UART1_SendData2PC(puart_data_temp, count);
}

#endif
//---------------End Process the uart struction(/+[Y]/[X]:******.)----------------------------------------------


//---------------End Process the uart struction(/+[Y]/[X]:******.)---------------------------------------------- 

#if 1
//---------------Begain Process the uart struction(All#.)--------------------------- 
void ProcessAllThrough(void) 
{ 
//   BYTE cCount = 0; 
   //BYTE acMessage2[LCD_MAX_CHAR] = { 0 }; 
   //memset(acMessage2, 0, LCD_MAX_CHAR); 
   Event_t   bEvent; 
    
   bEvent.Head.opcode=eSwitchAllThrough; 
   bEvent.Head.DestAddr=mqSWITCH; 
   bEvent.Head.argCount=0; 
   utilExecOlnyMsgSend(mqSWITCH,bEvent); 

   bEvent.Head.opcode=eLEDAllThrough; 
   bEvent.Head.DestAddr=mqLED; 
   bEvent.Head.argCount=0; 
   utilExecOlnyMsgSend(mqLED,bEvent); 
                               
  // cCount += SiiSprintf(&acMessage2[cCount],"%s", "All Through."); 
 //  appUIUartMessageSet(NULL, acMessage2, TRUE); 
 //  appUartSwitchLedStateChange(InPut, OutPut, ulAllThrough); 
 //  appUIStateChange(uiUART_SWITCH_VIDEO); 
 
    #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
    {
        BYTE tempLed[8]={0,1,2,3,4,5,6,7};
        KeyLedSetAll(tempLed);
    }
    #endif
}

#else
//---------------Begain Process the uart struction(All#.)---------------------------
void ProcessAllThrough(unsigned char InPut, unsigned char OutPut)
{
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	Event_t   bEvent;
	
	bEvent.Head.opcode=eSwitchAllThrough;
	bEvent.Head.DestAddr=mqSWITCH;
	bEvent.Head.argCount=0;
	utilExecOlnyMsgSend(mqSWITCH,bEvent);

	bEvent.Head.opcode=eLEDAllThrough;
	bEvent.Head.DestAddr=mqLED;
	bEvent.Head.argCount=0;
	utilExecOlnyMsgSend(mqLED,bEvent);
                            	
    cCount += SiiSprintf((char*)&acMessage2[cCount],"%s", "All Through.");
    appUIUartMessageSet(NULL, acMessage2, TRUE);
    appUartSwitchLedStateChange(InPut, OutPut, ulAllThrough);
    appUIStateChange(uiUART_SWITCH_VIDEO);
    #if (MACHINETYPE == MUH4K862)
    {
        BYTE tempLed[8]={0,1,2,3,4,5,6,7};
        KeyLedSetAll(tempLed);
    }
	#endif
}
#endif
//---------------End Process the uart struction(All#.)------------------------------


//---------------Begain Process the uart struction(All$.)---------------------------
void ProcessAllClose()
{
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);

    appSystemSwitcherOutportCloseAll(); // video and IR
    cCount += SiiSprintf((char*)&acMessage2[cCount], "%s","All Closed.");
    appUIUartMessageSet(NULL, acMessage2, TRUE);
    appUartSwitchLedStateChange(1, 1, ulAllClose);
    #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
    KeyLedSetAllClose();
    #endif
    appUIStateChange(uiUART_SWITCH_VIDEO);
}
//---------------End Process the uart struction(All$.)------------------------------


//---------------Begain Process the uart struction(All@.)---------------------------
void ProcessAllOpen(BOOL Re_Message)
{
	appSystemSwitcherOutportRecoverAll();// Video and IR
    if (Re_Message == ON)
    {
        #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
        KeyLedStatuesInitialize();
        #endif
        appUIUartMessageSet(NULL, "All Open.", TRUE);
        appUartSwitchLedStateChange(1, 1, ulAllOpen);
        appUIStateChange(uiUART_SWITCH_VIDEO);
    }
    else
    {
        appUIUartMessageSet(NULL, "Switch Ok!", TRUE);
        appUartSwitchLedStateChange(1, 1, ulAllOpen);
        appUIStateChange(uiUART_SWITCH_VIDEO);
    }
    delay_nms(10);
}
//---------------End Process the uart struction(All@.)------------------------------


//---------------Begain Process the uart struction([X]All.)-------------------------
void ProcessOne2All(unsigned char InPut)
{         Event_t   bEvent;
          /*********************************/
		bEvent.Head.opcode=eSwitchxAll;
		bEvent.Head.DestAddr=mqSWITCH;
		bEvent.args[0]=InPut-1;
		bEvent.Head.argCount=1;
	       utilExecOlnyMsgSend(mqSWITCH,
                            bEvent);
               /****************/	
	            /*********************************/
		bEvent.Head.opcode=eLEDSwitchxAll;
		bEvent.Head.DestAddr=mqLED;
		bEvent.args[0]=InPut-1;
		bEvent.Head.argCount=1;
	       utilExecOlnyMsgSend(mqLED,
                            bEvent);
               /****************/	
	//	appSystemSwitcherSet(InPut - 1, MAX_OUT, 0, 1, 2, 3,4,5,6,7); // xAll.
#ifdef PRD_IR_OUT
		appSystemIRSwitcherSet(InPut - 1, MAX_OUT, 0, 1, 2, 3,4,5,6,7);
#endif

