windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
		//cCount += SiiSprintf((char*)&acMessage2[cCount], "%2d To All.", InPut);
	//	appUIUartMessageSet(NULL, acMessage2, TRUE);
		//appUartSwitchLedStateChange(InPut, InPut, ulToAll);
	//	appUIStateChange(uiUART_SWITCH_VIDEO);
}
//---------------End Process the uart struction([X]All.)----------------------------

//---------------End Process the uart struction([X]All.)---------------------------- 

#if 1
//---------------Begain Process the uart struction([X]#.)--------------------------- 
void ProcessOne2One(unsigned char InPut, unsigned char OutPut) 
{
    Event_t   bEvent; 
    //BYTE cCount = 0; 
    BYTE acMessage2[LCD_MAX_CHAR] = { 0 }; 
    memset(acMessage2, 0, LCD_MAX_CHAR); 
    
#ifdef PRD_IR_OUT 
    appSystemIRSwitcherSet(InPut - 1, 1, OutPut - 1); 
#endif 
         //Event_t   bEvent; 
    bEvent.Head.opcode=eLEDChannelSwitch; 
    bEvent.Head.DestAddr=mqLED; 
    bEvent.args[0]=InPut-1; 
    bEvent.args[1]=1; 
    memset(&bEvent.args[2],OutPut - 1,1);   
    bEvent.Head.argCount=2+1; 
    utilExecOlnyMsgSend(mqLED, bEvent); 
    /****************/    
    //*********************************************** 
    bEvent.Head.opcode=eSwitchxThrough; 
    bEvent.Head.DestAddr=mqSWITCH; 
    bEvent.args[0]=InPut-1; 
    bEvent.Head.argCount=1; 
    utilExecOlnyMsgSend(mqSWITCH, bEvent); 
    //*************************************************** 
    //  appSystemSwitcherSet(InPut - 1, 1, OutPut - 1); 
    //  cCount += SiiSprintf(&acMessage2[cCount], "%2d Through.", InPut); 
    //  appUIUartMessageSet(NULL, acMessage2, TRUE); 
    //  appUartSwitchLedStateChange(InPut, InPut, ulThrough); 
    //   appUIStateChange(uiUART_SWITCH_VIDEO); 
#if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
    KeyLedSetOne(OutPut-1,InPut-1);
#endif
}

#else
//---------------Begain Process the uart struction([X]#.)---------------------------
void ProcessOne2One(unsigned char InPut, unsigned char OutPut)
{
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);

    appSystemSwitcherSet(InPut - 1, 1, OutPut - 1);
    cCount += SiiSprintf((char*)&acMessage2[cCount], "%2d Through.", InPut);
    appUIUartMessageSet(NULL, acMessage2, TRUE);
    appUartSwitchLedStateChange(InPut, InPut, ulThrough);
    appUIStateChange(uiUART_SWITCH_VIDEO);
    #if (MACHINETYPE == MUH4K862)
    KeyLedSetOne(OutPut-1,InPut-1);
    #endif
}
#endif
//---------------End Process the uart struction([X]#.)------------------------------

//---------------Begain Process the uart struction([X]$.)---------------------------
void ProcessOneClose(unsigned char OutPut)
{
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	POUTPUTPORT_MANAGER_DATA	psOutputPortMgrData;
	
    psOutputPortMgrData  = (POUTPUTPORT_MANAGER_DATA)utilDataMgrWriteLockData(nnOUTPUTPORT_MANAGER_DATA);
    if ((psOutputPortMgrData->acInPortSelect[OutPut - 1]) < MAX_IN)
        psOutputPortMgrData->acCloseInPortSelect[OutPut - 1] = psOutputPortMgrData->acInPortSelect[OutPut - 1];
#ifdef PRD_IR_OUT
    if ((psOutputPortMgrData->acIRInPortSelect[OutPut - 1]) < MAX_IN)
        psOutputPortMgrData->acIRCloseInPortSelect[OutPut - 1] = psOutputPortMgrData->acIRInPortSelect[OutPut - 1];
#endif

#if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
    KeyLedSetOne(OutPut-1,0xFF);
    KeyLedCloseSetOne(OutPut-1,psOutputPortMgrData->acCloseInPortSelect[OutPut - 1]);
    Set_CloseOutputFlag(OutPut-1,true);
#endif
    utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,
                      TRUE);
    appSystemSwitcherSet(MAX_IN, 1, OutPut - 1);
#ifdef PRD_IR_OUT
    appSystemIRSwitcherSet(MAX_IN, 1, OutPut - 1);
#endif

    cCount += SiiSprintf((char*)&acMessage2[cCount], "%2d Closed.", OutPut);
    appUIUartMessageSet(NULL, acMessage2, TRUE);
    appUartSwitchLedStateChange(OutPut, OutPut, ulClose);
    appUIStateChange(uiUART_SWITCH_VIDEO);	
}
//---------------End Process the uart struction([X]$.)------------------------------


//---------------Begain Process the uart struction([X]@.)---------------------------
void ProcessOneOpen(unsigned char OutPut, BOOL Re_Message)
{
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;

	psOutputPortMgrData  = (POUTPUTPORT_MANAGER_DATA)utilDataMgrWriteLockData(nnOUTPUTPORT_MANAGER_DATA);
    
    
	if ((psOutputPortMgrData->acInPortSelect[OutPut - 1]) >= MAX_IN)
	{
	    psOutputPortMgrData->acInPortSelect[OutPut - 1] = psOutputPortMgrData->acCloseInPortSelect[OutPut - 1];
        #ifdef PRD_IR_OUT
	    psOutputPortMgrData->acIRInPortSelect[OutPut - 1] = psOutputPortMgrData->acIRCloseInPortSelect[OutPut - 1];
        #endif
	    utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,TRUE);	                      
	    appSystemSwitcherSet2(psOutputPortMgrData->acInPortSelect[OutPut - 1], 1, OutPut - 1);
        
        #ifdef PRD_IR_OUT
        appSystemIRSwitcherSet(psOutputPortMgrData->acIRInPortSelect[OutPut - 1],1,OutPut - 1);
        #endif
        #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
        KeyLedSetOne(OutPut-1,psOutputPortMgrData->acInPortSelect[OutPut - 1]);
        Set_CloseOutputFlag(OutPut-1,false);
        #endif
	}
	else
	    utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,TRUE);
    
	if (Re_Message == ON)
	{
	    cCount += SiiSprintf((char*)&acMessage2[cCount], "%02d Open.", OutPut);
	    appUIUartMessageSet(NULL, acMessage2, TRUE);
	    appUartSwitchLedStateChange(OutPut, OutPut, ulOpen);
	    appUIStateChange(uiUART_SWITCH_VIDEO);
	}
	else
	{
	    cCount += SiiSprintf((char*)&acMessage2[cCount], "Switch Ok!");
	    appUIUartMessageSet(NULL, acMessage2, TRUE);
	    appUartSwitchLedStateChange(OutPut, OutPut, ulOpen);
	    appUIStateChange(uiUART_SWITCH_VIDEO);
	}
    delay_nms(10);
}
//---------------End Process the uart struction([X]@.)------------------------------


//---------------Begain Process the uart struction(Save[Y].)------------------------
void ProcessSaveCurrentStatus(unsigned char InPut)
{
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	
