windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
    cCount += SiiSprintf((char*)&acMessage2[cCount], "Save To F%d", InPut);
    appUIUartMessageSet(NULL, acMessage2, TRUE);
    appUIStateChange(uiUART_MESSAGE);
    appSystemSwitcherScenceSave(InPut);
}
//---------------End Process the uart struction(Save[Y].)---------------------------


//---------------Begain Process the uart struction(Recall[Y].)----------------------
void ProcessRecallStatus(unsigned char InPut)
{
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	
    cCount += SiiSprintf((char*)&acMessage2[cCount], "Recall From F%d", InPut);
    appUIUartMessageSet(NULL, acMessage2, TRUE);
    appUIStateChange(uiUART_MESSAGE);

    appSystemSwitcherScenceCall(InPut);
}
//---------------End Process the uart struction(Recall[Y].)-------------------------


//--------------Begain Process the uart struction(Clear[Y].)------------------------
void ProcessClearStatus(unsigned char InPut)
{
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);

    cCount += SiiSprintf((char*)&acMessage2[cCount], "Clear F%d", InPut);
    appUIUartMessageSet(NULL, acMessage2, TRUE);
    appUIStateChange(uiUART_MESSAGE);

    appSystemSwitcherScenceDel(InPut);
}
//-------------End Process the uart struction(Clear[Y].)----------------------------


//-------------Begain Process the uart struction(I-Lock[x].)-------------------------
uint8_t ProcessLockOneChannel(unsigned char InPut)
{
	BYTE cInPort = 0;
	unsigned int i;
	PSYSTEM_SETTING_DATA   psSystemSettingData;
    POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;

	psOutputPortMgrData  = (POUTPUTPORT_MANAGER_DATA)utilDataMgrReadLockData(nnOUTPUTPORT_MANAGER_DATA);
	psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA); 
	if ((InPut >0) && (InPut <= MAX_IN ))             // 查看一个通道状态
    {
		psSystemSettingData->acIChannellock[InPut - 1]=0x00;//刷新该锁定的通道
		for(i=0;i<MAX_OUT;i++)
    	{
    		cInPort = psOutputPortMgrData->acInPortSelect[i];//判断每个输出口当前接入的信号，如果是被锁定的则记录
			if(cInPort!=InPut-1)
			{		
		 		psSystemSettingData->acIChannellock[InPut - 1] = psSystemSettingData->acIChannellock[InPut - 1]|BIT(i);	//0x0 xxxx	
                u8IChannellock[InPut - 1]=psSystemSettingData->acIChannellock[InPut - 1];
			}
    	}

		utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,  TRUE);
		utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,  FALSE);             
		sprintf(USART1_tx_buff,"Channel %d Lock!\r\n",InPut);
		UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
    	return (CH_CORRECT);
    }
    else
    {   utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,FALSE);
		return (CH_ERROR);
    }
}
//-------------End Process the uart struction(I-Lock[x].)----------------------------


//-------------Begain Process the uart struction(I-Unlock[x].)--------------------------
uint8_t ProcessUnlockOneChannel(unsigned char InPut)
{
	PSYSTEM_SETTING_DATA   psSystemSettingData;
	psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
    if ((InPut > 0) && (InPut <=MAX_IN ))            
    {           
		psSystemSettingData->acIChannellock[InPut - 1] =0x00; //0x0 xxxx	               
        u8IChannellock[InPut - 1]=psSystemSettingData->acIChannellock[InPut - 1];
    	utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,TRUE);
	 	sprintf(USART1_tx_buff,"Channel %d Unlock!\r\n",InPut);
        UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
        return (CH_CORRECT);
    }
    else
    {
		utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,FALSE);
		return (CH_ERROR);
    }
}
//-------------End Process the uart struction(I-Unlock[x]..)----------------------------


//-------------Begain Process the uart struction(A-Lock.)--------------------------
void ProcessLockAllChannel()
{
	BYTE cInPort = 0;
	unsigned int i = 0, j = 0;
	PSYSTEM_SETTING_DATA   psSystemSettingData;
    POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;

	psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
	psOutputPortMgrData  = (POUTPUTPORT_MANAGER_DATA)utilDataMgrReadLockData(nnOUTPUTPORT_MANAGER_DATA);
	for(i=0;i<MAX_IN;i++)
    {
	 	psSystemSettingData->acIChannellock[i]=0x00;
		cInPort=i;
		for(j=0;j<MAX_OUT;j++)
	    {             		
	    	if(cInPort != psOutputPortMgrData->acInPortSelect[j])//判断每个输出口当前接入的信号，如果是被锁定的则记录	
			{
                psSystemSettingData->acIChannellock[i] = psSystemSettingData->acIChannellock[i]|(BIT(j));
                u8IChannellock[i]=psSystemSettingData->acIChannellock[i];
	    	}
	    }
    
    }
    sprintf(USART1_tx_buff,"All Channel Lock!\r\n");
    UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
    utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,  false);   
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,TRUE);
}
//-------------End Process the uart struction(A-Lock.)----------------------------


//-------------Begain Process the uart struction(A-UnLock.)--------------------------
void ProcessUnlockAllChannel()
{
	 unsigned int i = 0;
	 PSYSTEM_SETTING_DATA   psSystemSettingData;
	 
	 psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
	 for(i=0;i<MAX_IN;i++)
	 {
		psSystemSettingData->acIChannellock[i]=0x00;
        u8IChannellock[i]=psSystemSettingData->acIChannellock[i];
	 }
	 sprintf(USART1_tx_buff,"All Channel Unlock!\r\n");
	 UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
	 utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,TRUE);
}
//-------------End Process the uart struction(A-UnLock.)----------------------------


//-------------Begain Process the uart struction(Lock-Sta.)--------------------------
void ProCheckAllLockStatus()
{
	 unsigned int i = 0, j = 0;
	 PSYSTEM_SETTING_DATA   psSystemSettingData;
     
     psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
	 for(j=0;j<MAX_OUT;j++)
	 {
		for(i=0;i<MAX_IN;i++)
		{
			if( (psSystemSettingData->acIChannellock[i]&BIT(j)))	
			{	
				sprintf(USART1_tx_buff,"Channel %d->%d Lock!\r\n",i+1,j+1);
        		UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
			}
			else
			{
				sprintf(USART1_tx_buff,"Channel %d->%d Unlock!\r\n",i+1,j+1);
        		UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
			}
		}
		
