windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
	}
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,false);
}
//-------------End Process the uart struction(Lock-Sta.)----------------------------


//-------------Begain Process the uart struction(Demo.)--------------------------
void ProSettingDemoStatus()
{
	 Event_t   bEvent;
	 BYTE cCount = 0;
	 BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	 memset(acMessage2, 0, LCD_MAX_CHAR);

     if (bDemoEn)
         cCount += SiiSprintf((char*)&acMessage2[cCount], "Normal Mode");
     else
         cCount += SiiSprintf((char*)&acMessage2[cCount], "Demo Mode");
        
     UART1_SendData2PC(acMessage2, cCount);
     appUIUartMessageSet(NULL, acMessage2, FALSE);//[kyq add: 20150924 15:49:38]
     appUIStateChange(uiUART_MESSAGE);

	 bEvent.Head.opcode=eSwitchDemoMode;
	 bEvent.Head.DestAddr=mqSWITCH;
	 bEvent.args[0]=!bDemoEn;
	 bEvent.Head.argCount=1;
     utilExecOlnyMsgSend(mqSWITCH, bEvent);
                        	
     bDemoEn=!bDemoEn;
     m_bCommdDemo = TRUE; // kyq 20150929
}
//-------------End Process the uart struction(Demo.)----------------------------


//-------------Begain Process the uart struction(/%[Y]/[X]:[Z].)--------------------------
void ProChannelHdcp(BOOL bIsInport, BOOL bAllPort, BYTE cPort, BYTE cEnalbe)
{
	unsigned int i = 0;
	POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;
    PINPUTPORT_MANAGER_DATA       psInputPortMgrData;
    
    if (bIsInport == 1) //处理输入HDCP问题
    {
        psInputPortMgrData = (PINPUTPORT_MANAGER_DATA)utilDataMgrWriteLockData(nnINPUTPORT_MAMAGER_DATA);
        //k = 0;
        if (bAllPort == 0)
        {
            //  对于输入表示不兼容HDCP设备）
            //  输入不支持带HDCP
            psInputPortMgrData->abInputHDCP_EN[cPort - 1] = cEnalbe;
        }
        else // 针对所有通道
        {
            for (i = 0; i < MAX_IN; i++)
            {
                psInputPortMgrData->abInputHDCP_EN[i] = cEnalbe;
            }
        }
        utilDataMgrUnlock(nnINPUTPORT_MAMAGER_DATA, TRUE);
    }
    else if (bIsInport == 0)  //  输出端HDCP 设置
    {
        psOutputPortMgrData = utilDataMgrWriteLockData(nnOUTPUTPORT_MANAGER_DATA);
        if (bAllPort == 0)
        {
            psOutputPortMgrData->abHDCP_EN[cPort - 1] = cEnalbe;
            psOutputPortMgrData->abHDCP_AUTO[cPort - 1] = FALSE;

        }
        else
        {
            for (i = 0; i < MAX_OUT; i++)
            {
                psOutputPortMgrData->abHDCP_EN[i] = cEnalbe;
                psOutputPortMgrData->abHDCP_AUTO[i] = FALSE;
            }
        }
        utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA, TRUE);
    } 
}
//-------------End Process the uart struction(/%[Y]/[X]:[Z].)----------------------------


//-------------Begain Process the uart struction(EDIDMInit.)--------------------------
void ProFactoryDefaultEDID(void)
{
	unsigned int i = 0;
    BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	
    cCount += SiiSprintf((char*)&acMessage2[cCount],"%s", "EDIDMInit.");
    appUIUartMessageSet(NULL, acMessage2, TRUE);
    appUIStateChange(uiUART_MESSAGE);

    for (i = 0; i < MAX_IN; i++)      //Intialize 9679 EDID
        appSystemInputPortEdidSet(i, edsEDID_Default);
}
//-------------End Process the uart struction(EDIDMInit.)-----------------------------


//-------------Begain Process the uart struction(EDIDG[x].)--------------------------
uint8_t ProGetOutportEDIDData(unsigned char HPnum1)
{
	unsigned int j = 0;
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	BYTE cSii9533Instance;
	BYTE acEDID_data[256];
	
    if ((HPnum1 > 0) && (HPnum1 <= MAX_OUT))
    {

        cSii9533Instance = utilOutputPortToInstance(HPnum1 - 1);
        if (SiiTxStatusGet(cSii9533Instance).isHotPlugDetected) //[kyq add: 20150728 15:38:23]
        {
            SiiTxEdidGetEdidData(cSii9533Instance, acEDID_data); //[kyq ADD: 20150728 15:30:37]
                                                  
            for (j = 0; j < EDID_TABLE_LEN; j++) UART1_SendByte(acEDID_data[j]);
            UART1_SendByte(0x0D);
            UART1_SendByte(0x0A);
        }
        else
        {
            cCount += SiiSprintf((char*)&acMessage2[cCount],"%s", "NO device !");
            appUIUartMessageSet(NULL, acMessage2, TRUE);
            appUIStateChange(uiUART_MESSAGE);
        }
        return (CH_CORRECT);
    }
    else
    {
        return (CH_ERROR);
    }
}
//-------------End Process the uart struction(EDIDG[x].)-----------------------------


//-------------Begain Process the uart struction(GetIntEDID[x].)--------------------------
void ProGetEmbeddingEDIDData(unsigned char HPnum1)
{
	unsigned int j = 0;
	BYTE acEDID_data[256];

    for (j = 0; j < EDID_TABLE_LEN; j++)
    {
        acEDID_data[j] = 0;
    }
    dvNVRAMUserEdidRead(HPnum1, acEDID_data);
    for (j = 0; j < EDID_TABLE_LEN; j++) UART1_SendByte(acEDID_data[j]);

    UART1_SendByte(0x0D);
    UART1_SendByte(0x0A);
}
//-------------End Process the uart struction(GetIntEDID[x].)-----------------------------


//-------------Begain Process the uart struction(GetInPortEDID[x].)--------------------------
void ProGetInportEDIDData(unsigned char HPnum1)
{
	unsigned int j = 0;
	BYTE acEDID_data[256];

    for (j = 0; j < EDID_TABLE_LEN; j++)
    {
        acEDID_data[j] = 0;
    }

    dvNVRAMUserEdidRead(edsEDID_IN1+HPnum1 - 1, acEDID_data);
    for (j = 0; j < EDID_TABLE_LEN; j++) UART1_SendByte(acEDID_data[j]);
}
//-------------End Process the uart struction(GetInPortEDID[x].)-----------------------------


//-------------Begain Process the uart struction(EDIDM[X]B[Y].)--------------------------
void ProCopyEDIDDataOutport2Inport(unsigned char HPnum1, unsigned char HPnum2)
{
	unsigned int i = 0;
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);

    if (HPnum2 == MAX_IN+1)
    {
        for (i = 0; i < MAX_IN; i++)
        {
            appSystemInputPortEdidSet(i, (eEDIDSELECT)(edsEDID_EXTERN1 + HPnum1 - 1));

