windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
        }
    }
    else
    {
        appSystemInputPortEdidSet(HPnum2 - 1, (eEDIDSELECT)(edsEDID_EXTERN1 + HPnum1 - 1));
    }
    
    //处理反馈信息
    if (HPnum2 < (MAX_IN + 1))
    {
        cCount += SiiSprintf((char*)&acMessage2[cCount], "EDIDM%dB%d", HPnum1, HPnum2);
        appUIUartMessageSet(NULL, acMessage2, TRUE);
        appUIStateChange(uiUART_MESSAGE);
    }
    else
    {
        cCount += SiiSprintf((char*)&acMessage2[cCount], "EDIDM%dBALL", HPnum1);
        appUIUartMessageSet(NULL, acMessage2, TRUE);
        appUIStateChange(uiUART_MESSAGE);
    }
}
//-------------End Process the uart struction(EDIDM[X]B[Y].)-----------------------------


//-------------Begain Process the uart struction(EDIDH[x]B[y].)--------------------------
uint8_t ProCopyEDIDDataOutport2Inport_AudioPCM(unsigned char HPnum1, unsigned char HPnum2)
{
	unsigned char crc = 0;
	BYTE cInstance = 0;	
	unsigned int j = 0, IndexC = 0, EndT = 0, conut = 0, m = 0, n = 0, x = 0, k = 0;
	BYTE acEDID_data[256];
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	
	cInstance = utilOutputPortToInstance(HPnum1 - 1);
	if (SiiTxStatusGet(cInstance).isHotPlugDetected) //[kyq add: 20150728 15:38:23]
	{
	    //将对应的输出通道的EDID数据读取出来
	    //EDID_get_slect_en(HPnum1, 0);
	    //get_EDID(HPnum1, g_tempData);
	    SiiTxEdidGetEdidData(cInstance, acEDID_data); //[kyq ADD: 20150728 15:31:00]
	                                                  //EDID_get_slect_en(HPnum1, 1);

	    if (acEDID_data[126] == 1) //HDMI
	    {
	        for (j = 0; j < EDID_TABLE_LEN; j++)  crc += acEDID_data[j];
	    }
	    else
	    {
	        for (j = 0; j < 128; j++)  crc += acEDID_data[j];
	        for (j = 128; j < EDID_TABLE_LEN; j++)  acEDID_data[j] = 0xff;
	    }
	    if (crc == 0)
	    {
	        if ((acEDID_data[0] == 0) && (acEDID_data[1] == 0xff) && (acEDID_data[7] == 0));
	        else
	        {
	            return (CM_ERROR);
	        }
	    }
	    else
	    {
	        return (CM_ERROR);
	    }
	}
	else
	    return (CM_ERROR);
	//处理强制PCM部分
	if ((acEDID_data[0] == 0x00) && (acEDID_data[1] == 0xff) && (acEDID_data[7] == 0x00))
    {
        if (acEDID_data[126] == 0x01) //HDMI的EDID数据
        {
            IndexC = EDID_GetDataBlockAddr(acEDID_data, 0x40, 132);
            EndT = (acEDID_data[IndexC] & 0x1F);
            IndexC = EDID_GetDataBlockAddr(acEDID_data, 0x20, IndexC + EndT + 1);
            if (IndexC > 132) //找到音频设置
            {
                EndT = (acEDID_data[IndexC] & 0x1F);
                if ((acEDID_data[IndexC] == 0x23) && ((acEDID_data[IndexC + 1] & 0x78) == 0x08)); //只支持PCM的时候
                else
                {
                    if (EndT > 3)
                        acEDID_data[130] -= (EndT - 3); //视频描述的偏移地址需要变动
                    acEDID_data[IndexC] =  0x23;
                    acEDID_data[IndexC + 1] =  0x09;
                    acEDID_data[IndexC + 2] =  0x07;
                    acEDID_data[IndexC + 3] =  0x07;

                    m = IndexC + EndT + 1; //起始下标
                    x = 0;
                    for (n = m; n < 255; n++)
                    {
                        k = acEDID_data[n];
                        acEDID_data[IndexC + 4 + x] = k;
                        x++;
                    }

                    for (n = (IndexC + 4 + x); n < 255; n++)
                    {
                        acEDID_data[n] = 0;
                    }

                    for (conut = 128; conut < 255; conut++)  crc += acEDID_data[conut];
                    acEDID_data[255] = ~(crc - 1);
                }
            }
            else //没有找到音频配置数据
            {
                for (conut = 128; conut < 256; conut++)  acEDID_data[conut] = g_Init_EdidFlashEdidTable[conut];  //将默认的EDID数据的后128字节拷贝过去
            }
        }
        else //DVI的EDID频数据
        {
            for (conut = 128; conut < 256; conut++)    acEDID_data[conut] = 0xff;
        }

        // 跟原来已经设置的EDID 数据比较
        /*
        Read_EDID(INPUT_EDID_add + 256 * (HPnum2 - 1), g_edidFlashEdidTable);  //读取目前对应的输入通道的EDID数据
        for (j = 0; j < EDID_TABLE_LEN - 1; j++) //比较目前的EDID和指定显示器的EDID数据
        {
            if (g_tempData[j] == g_edidFlashEdidTable[j])
            {ediden = 0;}
            else
            {
                ediden = 1;
                break;
            }
        }
        */

        if (TRUE) // if (ediden)
        {

            //dvSiiDrvAdaptRxHpdSet(HPnum2 - 1, SII_DRV_ADAPT_INP_CTRL__DISABLE);
            //dvSiiDrvAdaptRxEdidSramWrite(HPnum2 - 1, 0, g_edidFlashEdidTable, EDID_TABLE_LEN);
            //IWDG_ReloadCounter(); //喂狗
            //dvSiiDrvAdaptRxHpdSet(HPnum2 - 1, SII_DRV_ADAPT_INP_CTRL__ENABLE);
            appSystemInputPortEdidDataSet(HPnum2 - 1, (eEDIDSELECT)(edsEDID_IN1 + HPnum1 - 1), acEDID_data);
            //write_EDID(HPnum2, g_tempData);

        }
    }
    //处理反馈信息
    //sprintf(USART1_tx_buff, "EDIDH%02dB%02d      ", HPnum1, HPnum2);
    //strcpy(key_D2, USART1_tx_buff);
    //LCD_LineRefresh(key_D2, LINE2);
    //UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
    //UART1_SendBytes("\r\n", 2);
    cCount += SiiSprintf((char*)&acMessage2[cCount], "EDIDH%dB%d", HPnum1, HPnum2);
    appUIUartMessageSet(NULL, acMessage2, TRUE);
    appUIStateChange(uiUART_MESSAGE);
    return (CH_CORRECT);
}
//-------------End Process the uart struction(EDIDH[x]B[y].)-----------------------------


//-------------Begain Process the uart struction(EDIDPCM[x].)----------------------------
void ProModifyEDIDDataInport_AudioPCM(unsigned char HPnum2)
{
	unsigned int IndexC = 0, EndT = 0, conut = 0, m = 0, n = 0, x = 0, k = 0;
    unsigned char crc = 0, ediden = 0;
	BYTE acEdid[256];
	
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);

    //读出当前的EDID信息
    dvNVRAMUserEdidRead(edsEDID_IN1 + HPnum2 - 1, acEdid); // Read_EDID(INPUT_EDID_add + 256 * (HPnum2 - 1), g_tempData);
                                                           //处理PCM部分
    if ((acEdid[0] == 0x00) && (acEdid[1] == 0xff) && (acEdid[7] == 0x00))
    {
            if (acEdid[126] == 0x01) //HDMI的EDID数据
            {
                IndexC = EDID_GetDataBlockAddr(acEdid, 0x40, 132);
                EndT = (acEdid[IndexC] & 0x1F);
                IndexC = EDID_GetDataBlockAddr(acEdid, 0x20, IndexC + EndT + 1);
                if (IndexC > 132) //找到音频设置
                {
                    EndT = (acEdid[IndexC] & 0x1F); //源EDID中音频描述总字节数
                    if ((acEdid[IndexC] == 0x23) && ((acEdid[IndexC + 1] & 0x78) == 0x08))
                    {
                        ediden = 0;
                    }
                    else
                    {
                        if (EndT > 3)
                            acEdid[130] -= (EndT - 3); //视频描述的偏移地址需要变动
                        acEdid[IndexC] =  0x23;
                        acEdid[IndexC + 1] =  0x09;
                        acEdid[IndexC + 2] =  0x07;
                        acEdid[IndexC + 3] =  0x07;

                        m = IndexC + EndT + 1; //起始下标
                        x = 0;
                        for (n = m; n < 255; n++)
                        {
                            k = acEdid[n];
                            acEdid[IndexC + 4 + x] = k;
                            x++;
                        }

                        for (n = (IndexC + 4 + x); n < 255; n++)
                        {
                            acEdid[n] = 0;
                        }

                        for (conut = 128; conut < 255; conut++)  crc += acEdid[conut];
                        acEdid[255] = ~(crc - 1);

