windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
                        ediden = 1;
                    }
                }
                else //没有找到音频配置数据
                {
                    ediden = 0;
                }
            }
            else //DVI的EDID频数据
            {
                for (conut = 128; conut < 256; conut++)    acEdid[conut] = 0xff;
            }

            if (ediden)
            {

                appSystemInputPortEdidDataSet(HPnum2 - 1, (eEDIDSELECT)(edsEDID_IN1 + HPnum2 - 1), acEdid);
                //dvSiiDrvAdaptRxHpdSet(HPnum2 - 1, SII_DRV_ADAPT_INP_CTRL__DISABLE);
                //dvSiiDrvAdaptRxEdidSramWrite(HPnum2 - 1, 0, g_edidFlashEdidTable, EDID_TABLE_LEN);
                //IWDG_ReloadCounter(); //喂狗
                //dvSiiDrvAdaptRxHpdSet(HPnum2 - 1, SII_DRV_ADAPT_INP_CTRL__ENABLE);
#if 0
                //device_slect_9187(HPnum2);
                SiiRegWrite(Build_cInstance, 0x0010, 0x00); //将热插拔拉低
                delay_nms(10);
                SiiDrvNvramSramWrite(Build_cInstance, SRAM_P2, g_tempData, 0, EDID_TABLE_LEN); //更新EDID数据
                IWDG_ReloadCounter(); //喂狗
                SiiRegWrite(Build_cInstance, 0x0010, 0x55); //将热插拔拉高，这样的话再次拉高那么信号源就会重新读取EDID数据
                                                            //disconnect_9187()
#endif
                //write_EDID(HPnum2, g_tempData);
            }
     }
    //处理反馈信息

    //sprintf(USART1_tx_buff, "EDIDPCM%02d     ", HPnum2);
    //strcpy(key_D2, USART1_tx_buff);
    // LCD_LineRefresh(key_D2, LINE2);
    //UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
    //UART1_SendBytes("\r\n", 2);
    cCount += SiiSprintf((char*)&acMessage2[cCount], "EDIDPCM%d", HPnum2);
    appUIUartMessageSet(NULL, acMessage2, TRUE);
    appUIStateChange(uiUART_MESSAGE);
}
//-------------End Process the uart struction(EDIDPCM[x].)-----------------------------


//-------------Begain Process the uart struction(%080[x].)----------------------------
void ProConfigHDCPMode(unsigned char HPnum1)
{
	unsigned int i = 0;
	POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;
	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);
	
    //psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
    psOutputPortMgrData = utilDataMgrWriteLockData(nnOUTPUTPORT_MANAGER_DATA);
    if (HPnum1 == '0') //手动
    {
        //HDCP_AUTO_FLAG = 0;
        //AUTO_change_FLAG = 0;
        for (i = 0; i < MAX_OUT; i++)
        {
            psOutputPortMgrData->abHDCP_AUTO[i] = false;
        }

        //UART1_SendBytes("%0800\r\n", 7);
        cCount += SiiSprintf((char*)&acMessage2[cCount], "%s","%0800");
        appUIUartMessageSet(NULL, acMessage2, TRUE);
        appUIStateChange(uiUART_MESSAGE);
        //while (!(USART1->SR & USART_FLAG_TC));
        //strcpy(D2, "%0800");
    }
    else  if (HPnum1 == '1') //自动
    {
        //if (psOutputPortMgrData->bHDCP_AUTO == false)
        {
            //HDCP_AUTO_FLAG = 1;
            //NewCommandInFlag = NewCommandInFlag | 0x01;
            //AUTO_change_FLAG = 1;
            for (i = 0; i < MAX_OUT; i++)
            {
                psOutputPortMgrData->abHDCP_AUTO[i] = true;
            }

            //UART1_SendBytes("%0801\r\n", 7);
            
            cCount += SiiSprintf((char*)&acMessage2[cCount], "%s","%0801");
            appUIUartMessageSet(NULL, acMessage2, TRUE);
            appUIStateChange(uiUART_MESSAGE);
            //for (i = 0; i < MAX_OUT; i++) OutSwitch_Flag[i] = 1;
            //OutSwitch_TimeDelay = 200;
        }
        //while (!(USART1->SR & USART_FLAG_TC));
        //strcpy(D2, "%0801");
    }
    utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,
                      TRUE);
}
//-------------End Process the uart struction(%080[x].)-----------------------------


//-------------Begain Process the uart struction(%090[x].)----------------------------
void ProConfigIRCarrierMode(unsigned char HPnum1)
{
	PSYSTEM_SETTING_DATA   psSystemSettingData;

	BYTE cCount = 0;
	BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
	memset(acMessage2, 0, LCD_MAX_CHAR);

	psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

    if (HPnum1 == '0')      //红外载波跟随
    {
        // IR_carrier_mode = 0;
        psSystemSettingData->cIR_Carrier_Mode = 0;
        //send_data_to_FPGA(0xDE);
        //if (check_ack())
        //    send_data_to_FPGA(0xDE);
        dvCPLDIRCarrierSet(FALSE);
        //UART1_SendBytes("Carrier native\r\n", 16);
        //sprintf(USART1_tx_buff, "Carrier native\r\n");
        // strcpy(D2, "Carrier native");
        cCount += SiiSprintf((char*)&acMessage2[cCount], "%s","Carrier native");
        appUIUartMessageSet(NULL, acMessage2, TRUE);
        appUIStateChange(uiUART_MESSAGE);

    }
    else  if (HPnum1 == '1')        //红外载波强制
    {
        //IR_carrier_mode = 1;
        psSystemSettingData->cIR_Carrier_Mode = 1;
        dvCPLDIRCarrierSet(TRUE);
        //send_data_to_FPGA(0xDF);
        //if (check_ack())
        //    send_data_to_FPGA(0xDF);
        //sprintf(USART1_tx_buff, "Force carrier\r\n");
        //UART1_SendBytes("Force carrier\r\n", 15);
        //  strcpy(D2, "Force carrier");
        cCount += SiiSprintf((char*)&acMessage2[cCount],"%s", "Force carrier");
        appUIUartMessageSet(NULL, acMessage2, TRUE);
        appUIStateChange(uiUART_MESSAGE);

    }
    //UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
                      TRUE);
}
//-------------End Process the uart struction(%090[x].)-----------------------------


//-------------Begain Process the uart struction(DigitAudioON[x].)----------------------------
uint8_t ProDigitAudioON(unsigned char HPnum1)
{
	BYTE cSii9533Instance;
	unsigned int j = 0;
    if ((HPnum1 < (MAX_OUT + 1)) && (HPnum1 > 0))        //开启声音
    {
        cSii9533Instance = utilOutputPortToInstance(HPnum1 - 1);
        #if 0
        if ((HPnum1 == 1) || (HPnum1 == 2))
        {
            //device_slect_9187(HPnum1+5);

            //SiiDrvRxAudioMixPassThroughConfig(cSii9533Instance, true, true);
            dvSii9533TXAudioMixPassThroughConfig(cSii9533Instance, true, true);
            //device_slect_9187(HPnum1+6);
            dvSii9533TXAudioMixPassThroughConfig(cSii9533Instance + 1, true, true);
        }
        else
        #endif
        {
            //device_slect_9187(HPnum1+6);
            dvSii9533TXAudioMixPassThroughConfig(cSii9533Instance, true, true);
        }
        //digit_audio[HPnum1 - 1] = 1;
        sprintf(USART1_tx_buff, "DigitAudio ON with Output %d\r\n", HPnum1);
        UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
        //i2c_EE_write_one_byte(Digit_audio_addr + (HPnum1 - 1), digit_audio[HPnum1 - 1]);
        return (CH_CORRECT);
    }
    else if (HPnum1 == (MAX_OUT + 1))
    {
        for (j = 0; j < MAX_OUT; j++)
        {
            //digit_audio[j] = 1;
            HPnum1 = j + 1;
            #if 0
            if ((HPnum1 == 1) || (HPnum1 == 2))
            {
                //device_slect_9187(HPnum1+5);
                dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), true, true);
                //device_slect_9187(HPnum1+6);
                dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1) + 1, true, true);
            }
            else
            #endif
            {
                //device_slect_9187(HPnum1+6);
                dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), true, true);
            }
            //i2c_EE_write_one_byte(Digit_audio_addr + j, digit_audio[j]);
        }
        sprintf(USART1_tx_buff, "DigitAudio ON with ALL Outputs\r\n");
        UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
        return (CH_CORRECT);
    }
    else
        return (CM_ERROR);
}
//-------------End Process the uart struction(DigitAudioON[x].)-----------------------------


