windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
//-------------Begain Process the uart struction(DigitAudioOFF[x].)----------------------------
uint8_t ProDigitAudioOFF(unsigned char HPnum1)
{
	unsigned int j = 0;
	if ((HPnum1 < (MAX_OUT + 1)) && (HPnum1 > 0))	   //关闭声音
	{
        #if 0
		if ((HPnum1 == 1) || (HPnum1 == 2))
		{
			//device_slect_9187(HPnum1+5);
			dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), false, true);
			//device_slect_9187(HPnum1+6);
			dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1) + 1, false, true);
		}
		/*
		else if (HPnum1 == 2)
		{
			//device_slect_9187(HPnum1+3);
			SiiDrvRxAudioMixPassThroughConfig(Build_cInstance, false, true);
			//device_slect_9187(HPnum1+6);
			SiiDrvRxAudioMixPassThroughConfig(Build_cInstance, false, true);
		}
		*/
		else 
        #endif
		{
			//device_slect_9187(HPnum1+6);
			dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), false, true);
		}
		//digit_audio[HPnum1 - 1] = 0;

		sprintf(USART1_tx_buff, "DigitAudio OFF with Output %d\r\n", HPnum1);
		UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
		//i2c_EE_write_one_byte(Digit_audio_addr + (HPnum1 - 1), digit_audio[HPnum1 - 1]);
		return (CH_CORRECT);
	}
	else if (HPnum1 == (MAX_OUT + 1))
	{
		for (j = 0; j < MAX_OUT; j++)
		{
			//digit_audio[j] = 0;
			HPnum1 = 1 + j;
            #if 0
			if ((HPnum1 == 1) || (HPnum1 == 2))
			{
				//device_slect_9187(HPnum1+5);
				dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), false, true);
				//device_slect_9187(HPnum1+6);
				dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1) + 1, false, true);
			}
			/*
			else if (HPnum1 == 2)
			{
				//device_slect_9187(HPnum1+3);
				SiiDrvRxAudioMixPassThroughConfig(Build_cInstance, false, true);
				//device_slect_9187(HPnum1+6);
				SiiDrvRxAudioMixPassThroughConfig(Build_cInstance, false, true);
			} 
			*/
			else
            #endif
			{
				//device_slect_9187(HPnum1+6);
				dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), false, true);
			}
			// i2c_EE_write_one_byte(Digit_audio_addr + j, digit_audio[j]);
		}
		sprintf(USART1_tx_buff, "DigitAudio OFF with ALL Outputs\r\n");
		UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
		return (CH_CORRECT);
	}
	else
		return (CM_ERROR);	
}
//-------------End Process the uart struction(DigitAudioOFF[x].)-----------------------------


//-------------Begain Process the uart struction(%997[x].)----------------------------
void  ProQueryAudioVedioStatus(unsigned char cNum)
{
    switch (cNum)
    {
        case '1' :          // %9971
            appUIStateChange(uiUART_INCONNECT_INFO);
            break;
        case '2' :
            appUIStateChange(uiUART_OUTCONNECT_INFO); // uiSYSTEM_OUTCONNECT_INFO
            break;
        case '3' :
            appUIStateChange(uiUART_IN_HDCP_INFO);
            break;
        case '4' :
            appUIStateChange(uiUART_OUT_HDCP_INFO);
            break;
        case '5' :
            appUIStateChange(uiUART_SWITCH_INFO);
            break;
        case '6' :
            appUIStateChange(uiUART_OUT_RESOLUTION_INFO);
            break;
        case '7' : //查询输出通道的数字声音状态
            appUIStateChange(uiUART_OUT_HDMIAUDIO_INFO);
            break;
        case '8' : //查询输入端的HDCP兼容状态
            appUIStateChange(uiUART_IN_HDCPENABLE_INFO);
            break;
        #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
        case '9' : //查询输入端的LINK兼容状态
            appUIStateChange(uiUART_OUT_LINK_INFO);
            break;
        #endif
        default :
            break;
    }
}
//-------------End Process the uart struction(%997[x].)-----------------------------
void  ProQueryVedioSwitchHexStatus(unsigned char cOutput)
{  BYTE acMessage2[USART1_TX_BUFF_MAX] = {0xA5,0x5B,0x02,0x01, 0x02 ,0x00 ,0x01, 0x00 ,0x00 ,0x00 ,0x00 ,0x00};
       POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;
   
    psOutputPortMgrData  = (POUTPUTPORT_MANAGER_DATA)utilDataMgrWriteLockData(nnOUTPUTPORT_MANAGER_DATA);
         acMessage2[4]=cOutput+1;   
         acMessage2[6]=psOutputPortMgrData->acInPortSelect[cOutput]+1;   
      utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,
                      FALSE);
       UART1_SendHexData2PC(acMessage2, 12); //except checksum
}

//-------------Begain Process the uart struction(%996[x].)----------------------------
void ProQuerySystermStatus(unsigned char HPnum1)
{
	PSYSTEM_SETTING_DATA   psSystemSettingData;

	switch(HPnum1)
	{
		case '1' :
			appUIStateChange(uiSYSTEM_LOCK_INFO);
			break;
		case '2' :
			sprintf(USART1_tx_buff, "PWON \r\n");
			UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));

			break;
		case '3' :
			// NO LCD Disaplay
			psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrReadLockData(nnSYSTEM_SETTING_DATA);
			if (psSystemSettingData->cIR_Carrier_Mode == 0)
			{
				sprintf(USART1_tx_buff, "Carrier native\r\n");
				UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
			}
			else if (psSystemSettingData->cIR_Carrier_Mode == 1)
			{
				sprintf(USART1_tx_buff, "Force carrier\r\n");
				UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
			}
			utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
							  FALSE);
			break;

		case '4' :
			appUIStateChange(uiUART_IP_INFO);
			break;
		default :
			break;

		}

}
//-------------End Process the uart struction(%996[x].)-----------------------------


#ifdef PRD_POWER_ONOFF_MESSAGE
//-------------Begain Process the uart struction(%995[x].)----------------------------
uint8_t ProQueryPortPWONSendData(unsigned char HPnum1)
{
	PSYSTEM_SETTING_DATA   psSystemSettingData;	
	
	psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrReadLockData(nnSYSTEM_SETTING_DATA);

	if (psSystemSettingData->acPowerOnMsgLength[HPnum1 - 1] == 0)
	    sprintf(USART1_tx_buff, "Port %d: NO Data\r\n", HPnum1);
	else
	    sprintf(USART1_tx_buff, "Port %d: %s when PWON\r\n", HPnum1, psSystemSettingData->acPowerOnMsg[HPnum1 - 1]);

	utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
	              FALSE);
	UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
	return (CH_CORRECT);

