windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
}
//-------------End Process the uart struction(%995[x].)-----------------------------

uint8_t ProQueryPortPWOFFSendData(unsigned char HPnum1)
{
	PSYSTEM_SETTING_DATA   psSystemSettingData;	
	
                psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrReadLockData(nnSYSTEM_SETTING_DATA);
      
                    if (psSystemSettingData->acPowerOffMsgLength[HPnum1 -1] == 0)
                        sprintf(USART1_tx_buff, "Port %d: NO Data\r\n", HPnum1);
                    else
                        sprintf(USART1_tx_buff, "Port %d: %s when PWOFF\r\n", HPnum1 , psSystemSettingData->acPowerOffMsg[HPnum1 - 1]);
  
                utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
                                  FALSE);
                UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                return (CH_CORRECT);

}
#endif


//-------------Begain Process the uart struction(%0911.)----------------------------
void ProRecallFactoryDefault()
{
	unsigned int i = 0, j = 0;
    utilDataMgrReset(nveRESETALL);
	appUIIRKeyEnableSet(TRUE);
    for (i = 0; i < MAX_IN; i++)
    {
        appSystemInputPortEdidSet(i, (eEDIDSELECT)(edsEDID_IN1 + i));
    }
    for (j = 0; j < MAX_OUT; j++)
    {
        //digit_audio[j] = 1;
        dvCpldRemoteBraundSet(j + 1);

        if ((j == 0) || (j == 1))
        {
            //device_slect_9187(HPnum1+5);
            dvSii9533TXAudioMixPassThroughConfigStart(utilOutputPortToInstance(j));
            //device_slect_9187(HPnum1+6);
            dvSii9533TXAudioMixPassThroughConfigStart(utilOutputPortToInstance(j) + 1);
        }
        else
        {
            //device_slect_9187(HPnum1+6);
            dvSii9533TXAudioMixPassThroughConfigStart(utilOutputPortToInstance(j));
        }
        //i2c_EE_write_one_byte(Digit_audio_addr + j, digit_audio[j]);
    }
    dvCPLDIRCarrierSet(FALSE); //[kyq ADD: 20151010 11:42:15]
    appSystemSwitcherSetStart();
#ifdef PRD_IR_OUT
    appSystemIRSwitcherSetStart();
#endif
	#if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
    KeyLedStatuesInitialize();
	//Set_Tm1623ValueChangeFlag(true);
	#endif
    
#ifdef ENABLE_DB9_BAUDRATE_SWITCH
    {
        PSYSTEM_SETTING_DATA   psSystemSettingData;
        psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
        //psSystemSettingData->PcUartBaudrateSelect = 3;
        SetDB9Baudrate(psSystemSettingData->PcUartBaudrateSelect);
        utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
    }
#endif
    InitRemoteCtrlMcu();

}
//-------------End Process the uart struction(%0911.)-----------------------------


uint8_t ProCECCommand(uint8_t cPort, uint8_t opCode, uint8_t i, uint8_t ArgCnt, uint8_t* pArg)
{
	BYTE   cInstance;
	BYTE   cLocal;

    cLocal = cPort & BIT4;
    cPort = cPort & 0x0f;
    if (i < 2 || cPort > MAX_OUT || cPort == 0)
        return CH_ERROR;

    cInstance = utilOutputPortToInstance(cPort - 1);
    if ((cPort == 1 | cPort == 2) && cLocal)
    {
        cInstance++;
    }

    Init_StructInstance(cInstance);
    SiiCecSendUserControlCmd(cInstance, opCode, (SiiCecLogicalAddresses_t)0, pArg, ArgCnt);	
    //UART1_SendBytes("CEC OK\r\n",sizeof("CEC OK\r\n"));
    return CH_CORRECT;
}

uint8_t ProCECCommand2(uint8_t cPort, uint8_t cecaddr,uint8_t opCode, uint8_t i, uint8_t ArgCnt, uint8_t* pArg)
{
	BYTE   cInstance;
	//BYTE   cLocal;

    //cLocal = cPort & BIT4;
    cPort = cPort & 0x0f;
    if (i < 2 || cPort > MAX_OUT || cPort == 0)
        return CH_ERROR;

    cInstance = utilOutputPortToInstance(cPort - 1);
    #if 0
    if ((cPort == 1 | cPort == 2) && cLocal)
    {
        cInstance++;
    }
    #endif

    //Init_StructInstance(cInstance);
    SiiCecSendUserControlCmd2(cInstance, opCode,cecaddr, pArg, ArgCnt);	
    //UART1_SendBytes("CEC OK\r\n",sizeof("CEC OK\r\n"));
    return CH_CORRECT;
}


//-------------Begain Process the uart struction(0xfa********0xfe)----------------------------
//----------------------Modify the product name-----------------------------------------------
void ProModifyProductName(unsigned char *pp)
{
	unsigned int i = 0;
    PSYSTEM_SETTING_DATA   psSystemSettingData;
    psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);


    pp++;
    for (i = 0; i < 16; i++)
    {
        if (*(pp + i) != 0xfe)
            psSystemSettingData->acProduct_Name[i] = *(pp + i);
        else
            break;
    }
	psSystemSettingData->acProduct_Name[16] = 0;// kyq 20151201
    if (i == 16)
    {
        psSystemSettingData->acProduct_Name[i] = 0;

        UART1_SendBytes("sys_name is ", strlen("sys_name is "));
        sprintf(USART1_tx_buff, "%s \r\n", psSystemSettingData->acProduct_Name);
        UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
    }
    else
        UART1_SendBytes("sys_name setting fail!", strlen("sys_name setting fail!"));
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);

}
//-------------End Process the uart struction(0xfa********0xfe)-----------------------------


//-------------Begain Process the uart struction(0xfb********0xfe)----------------------------
//----------------------Modify the product type-----------------------------------------------
void ProModifyProductType(unsigned char *pp)
{
	unsigned int i = 0;
	PSYSTEM_SETTING_DATA   psSystemSettingData;
	psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

	pp++;
	for (i = 0; i < 16; i++)
	{
		if (*(pp + i) != 0xfe)
			psSystemSettingData->acProduct_Type[i] = *(pp + i);
		else
			break;
	}
	psSystemSettingData->acProduct_Type[16] = 0; // kyq 20151201
	if (i == 16)
	{
		psSystemSettingData->acProduct_Type[i] = 0;
		// for(j=0;j<i;j++)  i2c_EE_write_one_byte(sys_type_add+j,sys_type[j]);

		UART1_SendBytes("sys_type is ", strlen("sys_type is "));
		sprintf(USART1_tx_buff, "%s \r\n", psSystemSettingData->acProduct_Type);
		UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
	}
	else
		UART1_SendBytes("sys_type setting fail!", strlen("sys_type setting fail!"));

	utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
}
//-------------End Process the uart struction(0xfb********0xfe)-----------------------------


