windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
//-------------Begain Process the uart struction(0xfc********0xfe)----------------------------
//----------------------Modify the default EDID name-----------------------------------------------
void ProModifyDefaultEDIDName(unsigned char *pp)
{
	unsigned int i = 0;
	unsigned char crc = 0;
	uint16_t sys_ID = 0x07ff;

    PSYSTEM_SETTING_DATA   psSystemSettingData;
    psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

    pp++;
    for (i = 0; i < 3; i++)
    {
        if (*(pp + i) != 0xfe)
            psSystemSettingData->acDefaultEdidProductName[i] = *(pp + i); //   [i] = *(pp+i) ;
        else
            break;
    }
    if (i == 3)
    {
        psSystemSettingData->acDefaultEdidProductName[i] = 0; // EDID_name[i] = 0;

        if (psSystemSettingData->acDefaultEdidProductName[2] >= 'A')
        {
            sys_ID &= 0xffe0; //清掉低5位
            sys_ID |= psSystemSettingData->acDefaultEdidProductName[2] - 0x40;
        }
        if (psSystemSettingData->acDefaultEdidProductName[1] >= 'A')
        {
            sys_ID &= 0xfc1f; //清掉中5位
            sys_ID |= ((psSystemSettingData->acDefaultEdidProductName[1] - 0x40) << 5);
        }
        if (psSystemSettingData->acDefaultEdidProductName[0] >= 'A')
        {
            sys_ID &= 0x03ff; //清掉高5位
            sys_ID |= ((psSystemSettingData->acDefaultEdidProductName[0] - 0x40) << 10);
        }

        g_Init_EdidFlashEdidTable[8] = sys_ID >> 8;
        g_Init_EdidFlashEdidTable[9] = sys_ID;
        for (i = 0; i < 127; i++)  crc += g_Init_EdidFlashEdidTable[i];
        g_Init_EdidFlashEdidTable[127] = ~(crc - 1);

        UART1_SendBytes("EDID_name is ", strlen("EDID_name is "));
        sprintf(USART1_tx_buff, "%s \r\n", psSystemSettingData->acDefaultEdidProductName);
        UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
        //[kyq Begin: 20150820 20:03:17]

        dvNVRAMUserEdidWrite(edsEDID_Default, g_Init_EdidFlashEdidTable);
        //[kyq End: 20150820 20:03:20]
    }
    else
        UART1_SendBytes("EDID_name setting fail!", strlen("EDID_name setting fail!"));
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
}
//-------------End Process the uart struction(0xfc********0xfe)-----------------------------


//-------------Begain Process the uart struction(0xf1********0xfe)----------------------------
//----------------------Modify the LCD1 display-----------------------------------------------
void ProModifyLCD1Display(unsigned char *pp)
{
	unsigned int i = 0, j = 0;
    PSYSTEM_SETTING_DATA   psSystemSettingData;
    psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

    pp++;
    for (i = 0; i < 16; i++)
    {
        if (*(pp + i) != 0xfe)
            LCD1_IDLE_TEXT[i] = *(pp + i);
        else
            break;
    }
	LCD1_IDLE_TEXT[16] = 0;
    if (i == 16)
    {

        memcpy(psSystemSettingData->acLCDLine1DefaultTXT, LCD1_IDLE_TEXT, 16);
        appUIStateChange(uiSPLASH);

        {
            UART1_SendBytes("LCD 1: ", strlen("LCD 1: "));
            for (j = 0; j < 16; j++)
            {
                UART1_SendByte(LCD1_IDLE_TEXT[j]);
            }
            UART1_SendBytes("\r\n", 2);
        }
    }
    else
    {
        UART1_SendBytes("Error!\r\n", strlen("Error!\r\n"));
    }
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
}
//-------------End Process the uart struction(0xf1********0xfe)-----------------------------


//-------------Begain Process the uart struction(0xf2********0xfe)----------------------------
//----------------------Modify the LCD2 display-----------------------------------------------
void ProModifyLCD2Display(unsigned char *pp)
{
	unsigned int i = 0, j = 0;
    PSYSTEM_SETTING_DATA   psSystemSettingData;
    psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

    pp++;
    for (i = 0; i < 16; i++)
    {
        if (*(pp + i) != 0xfe)
            LCD2_IDLE_TEXT[i] = *(pp + i);
        else
            break;
    }
    LCD2_IDLE_TEXT[16] = 0;
    if (i == 16)
    {

        memcpy(psSystemSettingData->acLCDLine2DefaultTXT, LCD2_IDLE_TEXT, 16);
        appUIStateChange(uiSPLASH);

        {

            UART1_SendBytes("LCD 2: ", strlen("LCD 2: "));
            for (j = 0; j < 16; j++)
            {
                UART1_SendByte(LCD2_IDLE_TEXT[j]);
            }
            UART1_SendBytes("\r\n", 2);
        }
    }
    else
    {
        UART1_SendBytes("Error!\r\n", strlen("Error!\r\n"));
    }
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
}
//-------------End Process the uart struction(0xf2********0xfe)-----------------------------


//-------------Begain Process the uart struction(0xf3********0xfe)----------------------------
//----------------------Modify the IP address-----------------------------------------------
void ProModifyIPAddress(unsigned char *pp)
{
	unsigned int i = 0;
    BYTE IP_add[4];
    PSYSTEM_SETTING_DATA   psSystemSettingData;
    psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

    if (get_ip_add(pp, IP_add))
    {
        //ip_set_ok = 1;
        for (i = 0; i < 4; i++) //i2c_EE_write_one_byte(sys_IP_add + i, IP_add[i]);
        {
            psSystemSettingData->acIP_Address[i] = IP_add[i];
        }
        appUIStateChange(uiUART_IP_INFO);

    }
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
}

#ifdef ENABLE_DB9_BAUDRATE_SWITCH
void Function_SetPcUartBaudrate(unsigned char tbaudrate)
{
    PSYSTEM_SETTING_DATA   psSystemSettingData;

    switch(tbaudrate)
    {
        case 1:
            UART1_SendBytes("Set Local RS232 bardrate is 2400!\r\n", strlen("Set Local RS232 bardrate is 2400!\r\n"));
            break;
        case 2:
            UART1_SendBytes("Set Local RS232 bardrate is 4800!\r\n", strlen("Set Local RS232 bardrate is 4800!\r\n"));
            break;
        case 3:
            UART1_SendBytes("Set Local RS232 bardrate is 9600!\r\n", strlen("Set Local RS232 bardrate is 9600!\r\n"));
            break;
        case 4:
            UART1_SendBytes("Set Local RS232 bardrate is 19200!\r\n", strlen("Set Local RS232 bardrate is 19200!\r\n"));
            break;
        case 5:
            UART1_SendBytes("Set Local RS232 bardrate is 38400!\r\n", strlen("Set Local RS232 bardrate is 38400!\r\n"));
            break;
        case 6:
            UART1_SendBytes("Set Local RS232 bardrate is 57600!\r\n", strlen("Set Local RS232 bardrate is 57600!\r\n"));
            break;
        case 7:
            UART1_SendBytes("Set Local RS232 bardrate is 115200!\r\n", strlen("Set Local RS232 bardrate is 115200!\r\n"));
            break;
        default:
            UART1_SendBytes("Baudrate set error!\r\n", strlen("Baudrate set error!\r\n"));
            break;
    }
    delay_nms(100);
    psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
    psSystemSettingData->PcUartBaudrateSelect = tbaudrate;
    SetDB9Baudrate(tbaudrate);
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
}

