windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
void Function_QueryBaudrate(void)
{
    PSYSTEM_SETTING_DATA   psSystemSettingData;
    psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
    
    switch(psSystemSettingData->PcUartBaudrateSelect)
    {
        case 1:
            UART1_SendBytes("Set Local RS232 bardrate is 2400!\r\n", strlen("Set Local RS232 bardrate is 2400!\r\n"));
            break;
        case 2:
            UART1_SendBytes("Set Local RS232 bardrate is 4800!\r\n", strlen("Set Local RS232 bardrate is 4800!\r\n"));
            break;
        case 3:
            UART1_SendBytes("Set Local RS232 bardrate is 9600!\r\n", strlen("Set Local RS232 bardrate is 9600!\r\n"));
            break;
        case 4:
            UART1_SendBytes("Set Local RS232 bardrate is 19200!\r\n", strlen("Set Local RS232 bardrate is 19200!\r\n"));
            break;
        case 5:
            UART1_SendBytes("Set Local RS232 bardrate is 38400!\r\n", strlen("Set Local RS232 bardrate is 38400!\r\n"));
            break;
        case 6:
            UART1_SendBytes("Set Local RS232 bardrate is 57600!\r\n", strlen("Set Local RS232 bardrate is 57600!\r\n"));
            break;
        case 7:
            UART1_SendBytes("Set Local RS232 bardrate is 115200!\r\n", strlen("Set Local RS232 bardrate is 115200!\r\n"));
            break;
        default:
            UART1_SendBytes("Baudrate set error!\r\n", strlen("Baudrate set error!\r\n"));
            break;
    }
    
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, FALSE);
}
#endif

void Function_SetRemoteCtrlMcu(BOOL bEn)
{
    PSYSTEM_SETTING_DATA   psSystemSettingData;
    psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
    if(bEn == TRUE)
    {
        psSystemSettingData->acRemoteCtrlMcuFlag = TRUE;
        UART1_SendBytes("Remote control Mcu: Enable!\r\n", strlen("Remote control Mcu: Enable!\r\n"));
        dvCpld_RemoteCtrlMcuMode(psSystemSettingData->acRemoteCtrlMcuFlag); 
    }
    else
    {
        psSystemSettingData->acRemoteCtrlMcuFlag = FALSE;
        UART1_SendBytes("Remote control Mcu: Disable!\r\n", strlen("Remote control Mcu: Disable!\r\n"));
        dvCpld_RemoteCtrlMcuMode(psSystemSettingData->acRemoteCtrlMcuFlag); 
    }
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
}

void Function_QueryRemoteCtrlMcuStatus(void)
{
    PSYSTEM_SETTING_DATA   psSystemSettingData;
    psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
    if(psSystemSettingData->acRemoteCtrlMcuFlag == TRUE)
    {
        UART1_SendBytes("Remote control Mcu: Enable!\r\n", strlen("Remote control Mcu: Enable!\r\n"));
    }
    else
    {
        UART1_SendBytes("Remote control Mcu: Disable!\r\n", strlen("Remote control Mcu: Disable!\r\n"));
    }
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, FALSE);
}

void Function_QueryRemoteBaudrateStatus(BYTE u8Remote)
{
    PSYSTEM_SETTING_DATA   psSystemSettingData;
    
    BYTE cCount = 0;
	BYTE acMessage2[50] = { 0 };
	memset(acMessage2, 0, 50);
	
    psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
    
    #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE == MHUB4K431))
    u8Remote = u8Remote;
    cCount += SiiSprintf((char*)&acMessage2[cCount],"Remote port baudrate is ");
    switch(u8RemoteBaudRate)
    #else
    cCount += SiiSprintf((char*)&acMessage2[cCount],"Remote port %d baudrate is ", u8Remote);
    switch(psSystemSettingData->acRemoteBaudRate[u8Remote-1])
    #endif
    {
        case 1:
            cCount += SiiSprintf((char*)&acMessage2[cCount],"%s!\r\n", "2400");
            break;
        case 2:
            cCount += SiiSprintf((char*)&acMessage2[cCount],"%s!\r\n", "4800");
            break;
        case 0:
        case 3:
            cCount += SiiSprintf((char*)&acMessage2[cCount],"%s!\r\n", "9600");
            break;
        case 4:
            cCount += SiiSprintf((char*)&acMessage2[cCount],"%s!\r\n", "19200");
            break;
        case 5:
            cCount += SiiSprintf((char*)&acMessage2[cCount],"%s!\r\n", "38400");
            break;
        case 6:
            cCount += SiiSprintf((char*)&acMessage2[cCount],"%s!\r\n", "57600");
            break;
        case 7:
            cCount += SiiSprintf((char*)&acMessage2[cCount],"%s!\r\n", "115200");
            break;
        default:
            cCount = 0;
            break;
    }
    
    UART1_SendBytes(acMessage2, cCount);
    
    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, FALSE);
}

//-------------End Process the uart struction(0xf3********0xfe)-----------------------------
#if ((MACHINETYPE == MUH4K862)||(MACHINETYPE == MHUB4K431))
BYTE cmdlist[][13]=
{
    {0xa5,0x5b,0x02,0x03,0x01,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0xf9},// Input 1,to,Output,1
    {0xa5,0x5b,0x02,0x03,0x01,0x00,0x02,0x00,0x00,0x00,0x00,0x00,0xf8},// Input,1,to,Output,2
    {0xa5,0x5b,0x02,0x03,0x01,0x00,0x03,0x00,0x00,0x00,0x00,0x00,0xf7},// Input,1,to,Output,3
    {0xa5,0x5b,0x02,0x03,0x01,0x00,0x04,0x00,0x00,0x00,0x00,0x00,0xf6},// Input,1,to,Output,4
    #if (MAX_IN>4)
    {0xa5,0x5b,0x02,0x03,0x01,0x00,0x05,0x00,0x00,0x00,0x00,0x00,0xf5},// Input,1,to,Output,5
    {0xa5,0x5b,0x02,0x03,0x01,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0xf4},// Input,1,to,Output,6
    {0xa5,0x5b,0x02,0x03,0x01,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0xf3},// Input,1,to,Output,7
    {0xa5,0x5b,0x02,0x03,0x01,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0xf2},// Input,1,to,Output,8
    #endif
    
    {0xa5,0x5b,0x02,0x03,0x02,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0xf8},// Input,2,to,Output,1
    {0xa5,0x5b,0x02,0x03,0x02,0x00,0x02,0x00,0x00,0x00,0x00,0x00,0xf7},// Input,2,to,Output,2
    {0xa5,0x5b,0x02,0x03,0x02,0x00,0x03,0x00,0x00,0x00,0x00,0x00,0xf6},// Input,2,to,Output,3
    {0xa5,0x5b,0x02,0x03,0x02,0x00,0x04,0x00,0x00,0x00,0x00,0x00,0xf5},// Input,2,to,Output,4
    #if (MAX_IN>4)
    {0xa5,0x5b,0x02,0x03,0x02,0x00,0x05,0x00,0x00,0x00,0x00,0x00,0xf4},// Input,2,to,Output,5
    {0xa5,0x5b,0x02,0x03,0x02,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0xf3},// Input,2,to,Output,6
    {0xa5,0x5b,0x02,0x03,0x02,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0xf2},// Input,2,to,Output,7
    {0xa5,0x5b,0x02,0x03,0x02,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0xf1},// Input,2,to,Output,8
    #endif
    
    {0xa5,0x5b,0x02,0x03,0x03,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0xf7},// Input,3,to,Output,1
    {0xa5,0x5b,0x02,0x03,0x03,0x00,0x02,0x00,0x00,0x00,0x00,0x00,0xf6},// Input,3,to,Output,2
    {0xa5,0x5b,0x02,0x03,0x03,0x00,0x03,0x00,0x00,0x00,0x00,0x00,0xf5},// Input,3,to,Output,3
    {0xa5,0x5b,0x02,0x03,0x03,0x00,0x04,0x00,0x00,0x00,0x00,0x00,0xf4},// Input,3,to,Output,4
    #if (MAX_IN>4)
    {0xa5,0x5b,0x02,0x03,0x03,0x00,0x05,0x00,0x00,0x00,0x00,0x00,0xf3},// Input,3,to,Output,5
    {0xa5,0x5b,0x02,0x03,0x03,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0xf2},// Input,3,to,Output,6
    {0xa5,0x5b,0x02,0x03,0x03,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0xf1},// Input,3,to,Output,7
    {0xa5,0x5b,0x02,0x03,0x03,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0xf0},// Input,3,to,Output,8
    #endif
    
    {0xa5,0x5b,0x02,0x03,0x04,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0xf6},// Input,4,to,Output,1
    {0xa5,0x5b,0x02,0x03,0x04,0x00,0x02,0x00,0x00,0x00,0x00,0x00,0xf5},// Input,4,to,Output,2
    {0xa5,0x5b,0x02,0x03,0x04,0x00,0x03,0x00,0x00,0x00,0x00,0x00,0xf4},// Input,4,to,Output,3
    {0xa5,0x5b,0x02,0x03,0x04,0x00,0x04,0x00,0x00,0x00,0x00,0x00,0xf3},// Input,4,to,Output,4
    #if (MAX_IN>4)
    {0xa5,0x5b,0x02,0x03,0x04,0x00,0x05,0x00,0x00,0x00,0x00,0x00,0xf2},// Input,4,to,Output,5
    {0xa5,0x5b,0x02,0x03,0x04,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0xf1},// Input,4,to,Output,6
    {0xa5,0x5b,0x02,0x03,0x04,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0xf0},// Input,4,to,Output,7
    {0xa5,0x5b,0x02,0x03,0x04,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0xef},// Input,4,to,Output,8
    #endif
    
    #if (MAX_IN>4)
    {0xa5,0x5b,0x02,0x03,0x05,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0xf5},// Input,5,to,Output,1
    {0xa5,0x5b,0x02,0x03,0x05,0x00,0x02,0x00,0x00,0x00,0x00,0x00,0xf4},// Input,5,to,Output,2
    {0xa5,0x5b,0x02,0x03,0x05,0x00,0x03,0x00,0x00,0x00,0x00,0x00,0xf3},// Input,5,to,Output,3
    {0xa5,0x5b,0x02,0x03,0x05,0x00,0x04,0x00,0x00,0x00,0x00,0x00,0xf2},// Input,5,to,Output,4
    {0xa5,0x5b,0x02,0x03,0x05,0x00,0x05,0x00,0x00,0x00,0x00,0x00,0xf1},// Input,5,to,Output,5
    {0xa5,0x5b,0x02,0x03,0x05,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0xf0},// Input,5,to,Output,6
    {0xa5,0x5b,0x02,0x03,0x05,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0xef},// Input,5,to,Output,7
    {0xa5,0x5b,0x02,0x03,0x05,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0xee},// Input,5,to,Output,8
    
