windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
    {0xa5,0x5b,0x02,0x03,0x06,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0xf4},// Input,6,to,Output,1
    {0xa5,0x5b,0x02,0x03,0x06,0x00,0x02,0x00,0x00,0x00,0x00,0x00,0xf3},// Input,6,to,Output,2
    {0xa5,0x5b,0x02,0x03,0x06,0x00,0x03,0x00,0x00,0x00,0x00,0x00,0xf2},// Input,6,to,Output,3
    {0xa5,0x5b,0x02,0x03,0x06,0x00,0x04,0x00,0x00,0x00,0x00,0x00,0xf1},// Input,6,to,Output,4
    {0xa5,0x5b,0x02,0x03,0x06,0x00,0x05,0x00,0x00,0x00,0x00,0x00,0xf0},// Input,6,to,Output,5
    {0xa5,0x5b,0x02,0x03,0x06,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0xef},// Input,6,to,Output,6
    {0xa5,0x5b,0x02,0x03,0x06,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0xee},// Input,6,to,Output,7
    {0xa5,0x5b,0x02,0x03,0x06,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0xed},// Input,6,to,Output,8
    
    {0xa5,0x5b,0x02,0x03,0x07,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0xf3},// Input,7,to,Output,1
    {0xa5,0x5b,0x02,0x03,0x07,0x00,0x02,0x00,0x00,0x00,0x00,0x00,0xf2},// Input,7,to,Output,2
    {0xa5,0x5b,0x02,0x03,0x07,0x00,0x03,0x00,0x00,0x00,0x00,0x00,0xf1},// Input,7,to,Output,3
    {0xa5,0x5b,0x02,0x03,0x07,0x00,0x04,0x00,0x00,0x00,0x00,0x00,0xf0},// Input,7,to,Output,4
    {0xa5,0x5b,0x02,0x03,0x07,0x00,0x05,0x00,0x00,0x00,0x00,0x00,0xef},// Input,7,to,Output,5
    {0xa5,0x5b,0x02,0x03,0x07,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0xee},// Input,7,to,Output,6
    {0xa5,0x5b,0x02,0x03,0x07,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0xed},// Input,7,to,Output,7
    {0xa5,0x5b,0x02,0x03,0x07,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0xec},// Input,7,to,Output,8
    
    {0xa5,0x5b,0x02,0x03,0x08,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0xf2},// Input,8,to,Output,1
    {0xa5,0x5b,0x02,0x03,0x08,0x00,0x02,0x00,0x00,0x00,0x00,0x00,0xf1},// Input,8,to,Output,2
    {0xa5,0x5b,0x02,0x03,0x08,0x00,0x03,0x00,0x00,0x00,0x00,0x00,0xf0},// Input,8,to,Output,3
    {0xa5,0x5b,0x02,0x03,0x08,0x00,0x04,0x00,0x00,0x00,0x00,0x00,0xef},// Input,8,to,Output,4
    {0xa5,0x5b,0x02,0x03,0x08,0x00,0x05,0x00,0x00,0x00,0x00,0x00,0xee},// Input,8,to,Output,5
    {0xa5,0x5b,0x02,0x03,0x08,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0xed},// Input,8,to,Output,6
    {0xa5,0x5b,0x02,0x03,0x08,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0xec},// Input,8,to,Output,7
    {0xa5,0x5b,0x02,0x03,0x08,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0xeb},// Input,8,to,Output,8
    #endif
    
    //{0xa5,0x5b,0x06,0x01,0xf0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x09},// Beep,,Off
    //{0xa5,0x5b,0x06,0x01,0x0f,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xea},// Beep,,On
    {0xa5,0x5b,0x08,0x0b,0xf0,0x00,0xf0,0x00,0x00,0x00,0x00,0x00,0x0d},// Power,Off
    {0xa5,0x5b,0x08,0x0b,0x0f,0x00,0x0f,0x00,0x00,0x00,0x00,0x00,0xcf},// Power,On
};

int Get_Cmdlist_Len(void)
{
    return (sizeof(cmdlist)/sizeof(cmdlist[0]));
}
#endif
#if 1

//参数为头指针，尾指针
// RXdata: 当前指针的 数据
// USART1_rxprocesspoint: 当前指针
// USART1_rxtailpoint: 开头指针
//USART1_rxtailpoint
//   |       rxdata
//   |         |USART1_rxprocesspoint
//   |         |              |
//  []   []   []             []          []     [][][][][][][][][][][][][][][][]
//
uint8_t do_with_type(unsigned char RXdata, 
                     unsigned char *USART1_rxtailpoint, 
                     unsigned char *USART1_rxprocesspoint)
{
    unsigned char *temppoint, *tempptr, *pp;
    unsigned char cmddata = 0, HPnum1 = 0, HPnum2 = 0; //in_flag = 0
	unsigned char InPut = 0, OutPut = 0;
	//unsigned char crc = 0, InOutflag = 0,Signaltype = 0;
	//unsigned int x = 0,flag = 0, m = 0, k = 0, EndT = 0;
    unsigned char returnval = 0;
    unsigned int  i = 0,  count = 0, jiucuo = 0;
    unsigned char user_temp[16] = { 0 };
    unsigned char uart_data_temp[USART1_RX_BUFF_MAX] = { 0 };
    //unsigned char a = 0, ediden = 0;
    //unsigned int  j = 0, conut = 0, n = 0, IndexC = 0;
  //  Event_t   bEvent;
    uint8_t cReturnValue = 0;
    //BYTE cSii9533Instance;
    BYTE cInPort = 0, cOutPort = 0;
    //BYTE acMessage1[LCD_MAX_CHAR] = { 0 };
    BYTE acMessage2[LCD_MAX_CHAR] = { 0 };
    BYTE cCount = 0;
    PSYSTEM_SETTING_DATA   psSystemSettingData;
   // POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;
   // PINPUTPORT_MANAGER_DATA       psInputPortMgrData;
    BOOL Re_Message;
    //BYTE acEDID_data[256];
    Re_Message = 1; //psSystemSettingData->bUartReturnMessage_EN;
    //memset(acMessage1, 0, LCD_MAX_CHAR);
    memset(acMessage2, 0, LCD_MAX_CHAR);
    m_bCommdDemo = FALSE; // kyq 20150929

#if ((MACHINETYPE == MUH4K862)||(MACHINETYPE == MHUB4K431))
    if(*USART1_rxtailpoint == 0xa5 && *(USART1_rxtailpoint+1)==0x5b)
    {
        //sprintf(USART1_tx_buff,"strlen(cmdlist)==%d strlen(cmdlist[0])==%d!\r\n",sizeof(cmdlist),sizeof(cmdlist[0]));
        //UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));  
        for(i = 0 ; i< (sizeof(cmdlist)/sizeof(cmdlist[0])); i++)
        {
            if(*(USART1_rxtailpoint+2)==0x02&&*(USART1_rxtailpoint+3)==0x03)
            {
                if(StrCmp(USART1_rxtailpoint, cmdlist[i], USART1_rxprocesspoint) != NULL)
                {
                    BYTE acOutPortList[MAX_OUT];
                    cInPort = *(USART1_rxtailpoint+4);
                    acOutPortList[0] = *(USART1_rxtailpoint+6)-1;

                    #if (MACHINETYPE == MHUB4K431)
                    if((cInPort>MAX_IN)||(*(USART1_rxtailpoint+6)>MAX_OUT))
                        return (CM_ERROR);
                    #endif
                    //ProessVedioSwitch(cInPort, 1, acOutPortList);
                    HexProessVedioIRSwitch(cInPort, 1, acOutPortList);
                    return (CH_CORRECT);
                }
            }
            else if(*(USART1_rxtailpoint+2)==0x02&&*(USART1_rxtailpoint+3)==0x01)
            {
                     cOutPort = *(USART1_rxtailpoint+4)-1;

                    if((cOutPort>MAX_OUT))
                        return (CM_ERROR);

			 ProQueryVedioSwitchHexStatus(cOutPort);
			 
                    return (CH_CORRECT);
            
            }
            else if(*(USART1_rxtailpoint+2)==0x08)
            {
                if(StrCmp(USART1_rxtailpoint, cmdlist[i], USART1_rxprocesspoint) != NULL)
                {
                    if(*(USART1_rxtailpoint+4)==0xf0)
                    {
                        cCount += SiiSprintf((char*)&acMessage2[cCount],"%s", "PWOFF");
                        appUIUartMessageSet(NULL, acMessage2, FALSE);
                        appUIStateChange(uiUART_MESSAGE);
                        appPowerMgrPowerStateSet(pwrSOFTOFF);
                        #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                        KeyLedSetAllClose();
                        #endif
                        return (CH_CORRECT);
                    }
                    else if(*(USART1_rxtailpoint+4)==0x0f)
                    {
                        // power on
                    }
                }
            }
        }
        i = 0;
    }
#endif

    if (RXdata == '.')
    {
        
