windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
//=========================================================================
// [x1]V[x2].  第[x1]路输入到[x2]路输出，音视频。
// [x1]B[x2].  第[x1]路输入到[x2]路输出，音视频。红外同步切
// [x1]R[x2]. 第[x1]路输入到[x2]路输出，红外。
//  这里有多个输出口的情况吗?
        pp = StrCmp(USART1_rxtailpoint, "0V", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = MAX_IN+1 ;
        #ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
                #if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf((char*)&acMessage2[cCount], "%2d Closed.", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulClose);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                appSystemSwitcherSet(cInPort, 1, cOutPort);
                #endif
				ProessVedioSwitch(cInPort, cOutPort, eSWITCH_OFF);
                return (CH_CORRECT);
            }
        #else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    i++;
                }
            }
            if (i > 0)
            {
		        ProessVedioSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);
            }
        #endif
        }

        pp = StrCmp(USART1_rxtailpoint, "1V", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 1;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf((char*)&acMessage2[cCount], "AV: 01->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);	
                appSystemSwitcherSet(cInPort, 1, cOutPort);
#endif
                #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                KeyInput[cOutPort]=cInPort-1;
                #endif
				ProessVedioSwitch(cInPort, cOutPort, eSWITCH_ON);
                return (CH_CORRECT);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                    KeyInput[acOutPortList[i]]=cInPort-1;
                    #endif
                    i++;

                }
            }
            if (i > 0)
            {
                // 1V1,2,3,4.   AV:1->1 2 3 4
//              cCount += SiiSprintf((char*)&acMessage2[cCount], "AV:1->");
//              for (j = 0; j < i; j++)
//              {
//                  cCount += SiiSprintf((char*)&acMessage2[cCount], "%d ", acOutPortList[i] + 1);
//
//              }
                
                //appUIUartMessageSet(NULL, acMessage2, TRUE);
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,TRUE);
                //appUIStateChange(uiUART_SWITCH_VIDEO);
                appSystemSwitcherPortSet(cInPort, i, acOutPortList); //1V
#endif
				ProessVedioSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);

            }
#endif

        }

        pp = StrCmp(USART1_rxtailpoint, "2V", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 2;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf((char*)&acMessage2[cCount], "AV: 02->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                appSystemSwitcherSet(cInPort, 1, cOutPort);
#endif
                #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                KeyInput[cOutPort]=cInPort-1;
                #endif
				ProessVedioSwitch(cInPort, cOutPort, eSWITCH_ON);
                return (CH_CORRECT);
            }

#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                    KeyInput[acOutPortList[i]]=cInPort-1;
                    #endif
                    i++;

                }
            }
            if (i > 0)
            {
                // 1V1,2,3,4.   AV:1->1 2 3 4
//              cCount += SiiSprintf((char*)&acMessage2[cCount], "AV:1->");
//              for (j = 0; j < i; j++)
//              {
//                  cCount += SiiSprintf((char*)&acMessage2[cCount], "%d ", acOutPortList[i] + 1);
//
//              }
                
                //appUIUartMessageSet(NULL, acMessage2, TRUE);
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,TRUE);
                //appUIStateChange(uiUART_SWITCH_VIDEO);
                appSystemSwitcherPortSet(cInPort, i, acOutPortList);//2V
#endif
				ProessVedioSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);

