windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
            }
#endif

        }


		
        pp = StrCmp(USART1_rxtailpoint, "6V", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 6;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf((char*)&acMessage2[cCount], "AV: 06->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                appSystemSwitcherSet(cInPort, 1, cOutPort);
#endif
                #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                KeyInput[cOutPort]=cInPort-1;
                #endif
				ProessVedioSwitch(cInPort, cOutPort, eSWITCH_ON);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                    KeyInput[acOutPortList[i]]=cInPort-1;
                    #endif
                    i++;

                }
            }
            if (i > 0)
            {
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,TRUE);
                appSystemSwitcherPortSet(cInPort, i, acOutPortList); //4
#endif
				ProessVedioSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);

            }
#endif

        }

		
        pp = StrCmp(USART1_rxtailpoint, "7V", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 7;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf((char*)&acMessage2[cCount], "AV: 07->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                appSystemSwitcherSet(cInPort, 1, cOutPort);
#endif
                #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                KeyInput[cOutPort]=cInPort-1;
                #endif
				ProessVedioSwitch(cInPort, cOutPort, eSWITCH_ON);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                    KeyInput[acOutPortList[i]]=cInPort-1;
                    #endif
                    i++;

                }
            }
            if (i > 0)
            {
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,TRUE);
                appSystemSwitcherPortSet(cInPort, i, acOutPortList); //4V
#endif
				ProessVedioSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);

            }
#endif

        }

		
        pp = StrCmp(USART1_rxtailpoint, "8V", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 8;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf((char*)&acMessage2[cCount], "AV: 08->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                appSystemSwitcherSet(cInPort, 1, cOutPort);
#endif
                #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                KeyInput[cOutPort]=cInPort-1;
                #endif
				ProessVedioSwitch(cInPort, cOutPort, eSWITCH_ON);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                    KeyInput[acOutPortList[i]]=cInPort-1;
                    #endif
                    i++;

                }
            }
            if (i > 0)
            {
                // 1V1,2,3,4.   AV:1->1 2 3 4
//              cCount += SiiSprintf((char*)&acMessage2[cCount], "AV:1->");
//              for (j = 0; j < i; j++)
//              {
//                  cCount += SiiSprintf((char*)&acMessage2[cCount], "%d ", acOutPortList[i] + 1);
//
//              }
                
                //appUIUartMessageSet(NULL, acMessage2, TRUE);
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,TRUE);
                //appUIStateChange(uiUART_SWITCH_VIDEO);
                appSystemSwitcherPortSet(cInPort, i, acOutPortList); //4V
#endif
				ProessVedioSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);

