windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
//----------------------------------------------------------------------------------------
        pp = StrCmp(USART1_rxtailpoint, "0R", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = MAX_IN;
#ifndef SWITCH_CMD_COTINUE 
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf(&acMessage2[cCount], "%2d Closed.", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulClose);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                //appSystemSwitcherSet(cInPort, 1, cOutPort);
                appSystemIRSwitcherSet(cInPort, 1, cOutPort);
#endif
				ProessIRSwitch(cInPort, cOutPort, eSWITCH_OFF);
                return (CH_CORRECT);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    i++;
                }
            }
            if (i > 0)
            {
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,FALSE);
                //appSystemSwitcherPortSet(cInPort, i, acOutPortList);
                appSystemIRSwitcherPortSet(cInPort, i, acOutPortList);
#endif
				ProessIRSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);
            }
#endif
        }

        pp = StrCmp(USART1_rxtailpoint, "1R", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 0;
#ifndef SWITCH_CMD_COTINUE 
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf(&acMessage2[cCount], "IR: 01->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                //appSystemSwitcherSet(cInPort, 1, cOutPort);
                appSystemIRSwitcherSet(cInPort, 1, cOutPort);
#endif
				ProessIRSwitch(cInPort, cOutPort, eSWITCH_ON);
                return (CH_CORRECT);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    i++;
                }
            }
            if (i > 0)
            {
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,FALSE);
                //appSystemSwitcherPortSet(cInPort, i, acOutPortList);
                appSystemIRSwitcherPortSet(cInPort, i, acOutPortList);
#endif
				ProessIRSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);
            }
#endif
        }

        pp = StrCmp(USART1_rxtailpoint, "2R", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 1;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf(&acMessage2[cCount], "IR: 02->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                //appSystemSwitcherSet(cInPort, 1, cOutPort);
                appSystemIRSwitcherSet(cInPort, 1, cOutPort);
#endif
				ProessIRSwitch(cInPort, cOutPort, eSWITCH_ON);
                return (CH_CORRECT);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    i++;
                }
            }
            if (i > 0)
            {
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,FALSE);
                //appSystemSwitcherPortSet(cInPort, i, acOutPortList);
                appSystemIRSwitcherPortSet(cInPort, i, acOutPortList);
#endif
				ProessIRSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);
            }
#endif
        }

        pp = StrCmp(USART1_rxtailpoint, "3R", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 2;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf(&acMessage2[cCount], "IR: 03->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                //appSystemSwitcherSet(cInPort, 1, cOutPort);
                appSystemIRSwitcherSet(cInPort, 1, cOutPort);
#endif
				ProessIRSwitch(cInPort, cOutPort, eSWITCH_ON);
                return (CH_CORRECT);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    i++;
                }
            }
            if (i > 0)
            {
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,FALSE);
                //appSystemSwitcherPortSet(cInPort, i, acOutPortList);
                appSystemIRSwitcherPortSet(cInPort, i, acOutPortList);
#endif
				ProessIRSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);
            }
#endif
        }

        pp = StrCmp(USART1_rxtailpoint, "4R", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 3;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf(&acMessage2[cCount], "IR: 04->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                //appSystemSwitcherSet(cInPort, 1, cOutPort);
                appSystemIRSwitcherSet(cInPort, 1, cOutPort);
#endif
				ProessIRSwitch(cInPort, cOutPort, eSWITCH_ON);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    i++;
                }
            }
            if (i > 0)
            {
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,FALSE);
                //appSystemSwitcherPortSet(cInPort, i, acOutPortList);
                appSystemIRSwitcherPortSet(cInPort, i, acOutPortList);
#endif
				ProessIRSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);
            }
#endif
        }
///////////////////////
         pp = StrCmp(USART1_rxtailpoint, "5R", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 4;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf(&acMessage2[cCount], "IR: 05->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                //appSystemSwitcherSet(cInPort, 1, cOutPort);
                appSystemIRSwitcherSet(cInPort, 1, cOutPort);
#endif
				ProessIRSwitch(cInPort, cOutPort, eSWITCH_ON);
                return (CH_CORRECT);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    i++;
                }
            }
            if (i > 0)
            {
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,FALSE);
                //appSystemSwitcherPortSet(cInPort, i, acOutPortList);
                appSystemIRSwitcherPortSet(cInPort, i, acOutPortList);
#endif
				ProessIRSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);
            }
#endif
        }
        ///////////////////////
         pp = StrCmp(USART1_rxtailpoint, "6R", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 5;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf(&acMessage2[cCount], "IR: 06->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                //appSystemSwitcherSet(cInPort, 1, cOutPort);
                appSystemIRSwitcherSet(cInPort, 1, cOutPort);
#endif
				ProessIRSwitch(cInPort, cOutPort, eSWITCH_ON);
                return (CH_CORRECT);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    i++;
                }
            }
            if (i > 0)
            {
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,FALSE);
                //appSystemSwitcherPortSet(cInPort, i, acOutPortList);
                appSystemIRSwitcherPortSet(cInPort, i, acOutPortList);
#endif
				ProessIRSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);
            }
#endif
        }
        ///////////////////////
         pp = StrCmp(USART1_rxtailpoint, "7R", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 6;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf(&acMessage2[cCount], "IR: 07->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                //appSystemSwitcherSet(cInPort, 1, cOutPort);
                appSystemIRSwitcherSet(cInPort, 1, cOutPort);
#endif
				ProessIRSwitch(cInPort, cOutPort, eSWITCH_ON);
                return (CH_CORRECT);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    i++;
                }
            }
            if (i > 0)
            {
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,FALSE);
                //appSystemSwitcherPortSet(cInPort, i, acOutPortList);
                appSystemIRSwitcherPortSet(cInPort, i, acOutPortList);
#endif
				ProessIRSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);
            }
#endif
        }
        ///////////////////////
         pp = StrCmp(USART1_rxtailpoint, "8R", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            cInPort = 7;
#ifndef SWITCH_CMD_COTINUE
            cOutPort = *pp++;
            if ((cOutPort - '0') > 0 &&
                (cOutPort - '0') <= MAX_OUT &&
                *pp == '.')
            {
#if 0
                cOutPort = cOutPort - '0' - 1;
                cCount += SiiSprintf(&acMessage2[cCount], "IR: 08->%2d", cOutPort + 1);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(cInPort + 1, cOutPort + 1, ulChannelSwitch);
                appUIStateChange(uiUART_SWITCH_VIDEO);
                //appSystemSwitcherSet(cInPort, 1, cOutPort);
                appSystemIRSwitcherSet(cInPort, 1, cOutPort);
#endif
				ProessIRSwitch(cInPort, cOutPort, eSWITCH_ON);
                return (CH_CORRECT);
            }
#else
            BYTE acOutPortList[MAX_OUT];
            i = 0;
            while (*pp != '.' && i < MAX_OUT)
            {
                cOutPort = *pp++;
                if ((cOutPort - '0') > 0 &&
                    (cOutPort - '0') <= MAX_OUT)
                {
                    acOutPortList[i] = cOutPort - '0' - 1;
                    i++;
                }
            }
            if (i > 0)
            {
#if 0
                appUartSwitchInfoSet(cInPort, i, acOutPortList,FALSE);
                //appSystemSwitcherPortSet(cInPort, i, acOutPortList);
                appSystemIRSwitcherPortSet(cInPort, i, acOutPortList);
#endif
				ProessIRSwitch(cInPort, i, acOutPortList);
                return (CH_CORRECT);
            }
#endif
        }

#endif
    
