windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
    #if INC_CEC
        #if 1
    //[kyq Begin: 20150729 16:38:03]
    //dddCEC123.
    //CEC12.
    //Command: CEC[PORT][OPCODE][ARGS].
    //CEC: this is CEC command
    //PORT:BIT4: 0 REMOTE, 1: LOCAL
    //         BIT3~0: outputPort number
    //OPCODE: CEC opcode, CEC 操作码
    // ARGS:  CEC 参数 最多16个字节
    // . : end char 结束符
        if (StrCmp(USART1_rxtailpoint, "CEC", USART1_rxprocesspoint) != NULL)
        {
            uint8_t cPort = 0;
            uint8_t opCode = 0;
            uint8_t i = 0;
            uint8_t Arg[16]={0};
            uint8_t ArgCnt = 0;
            //BYTE   cInstance;
            //BYTE   cLocal;
            //BYTE cAdress = 0;       // wf8421 20160111
            temppoint = USART1_rxtailpoint + 3; //     SiiCecSendUserControlCmd();

            while (*(temppoint + i) != '.')
            {

                cmddata = *(temppoint + i);
                if (i == 0)
                {
                    cPort = *(temppoint + i);
                }
            #if 0
                else if(i == 1)
                    cAdress= *(temppoint + i);
                else if(i == 2)
                    opCode = *(temppoint + i);
                else
                {
                    Arg[i - 3] = *(temppoint + i);
                    ArgCnt++;
                }
            #else
                else if (i == 1)
                    opCode = *(temppoint + i);
                else
                {
                    Arg[i - 2] = *(temppoint + i);
                    ArgCnt++;
                }
            #endif
                i++;
                if (temppoint + i >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    break;
            } // end while

            return ProCECCommand(cPort, opCode, i, ArgCnt, Arg);
            //return ProCECCommand2(cPort,cAdress, opCode, i, ArgCnt, Arg);
        }
        #endif
        
        #if 0
        //  CEC X:<AA:XX......>.
        if((StrCmp(USART1_rxtailpoint, "CEC ", USART1_rxprocesspoint) != NULL))
        {
            uint8_t cecop=0,Args[16]={0},Addr=0,ArgCnt=0;
            uint8_t temp[4]={0};
            uint8_t cPort = 0;
            #define UserDataOffset(x)   (x)
            temppoint = USART1_rxtailpoint + 4;
            cPort = *(temppoint + UserDataOffset(0))-0x30;
            // port
            #if (MACHINETYPE == MUH4K862)
            if(cPort<=0||(cPort>MAX_OUT-2)||(*(temppoint + UserDataOffset(1))!=':')||(*(temppoint + UserDataOffset(2))!='<'))
            #else
            if(cPort<=0||cPort>MAX_OUT||(*(temppoint + UserDataOffset(1))!=':')||(*(temppoint + UserDataOffset(2))!='<'))
            #endif
            {
                return (CM_ERROR);
            }
            // addr and opcode
            temp[0]=*(temppoint + UserDataOffset(3));temp[1]=*(temppoint + UserDataOffset(4));temp[2]=*(temppoint + UserDataOffset(6));temp[3]=*(temppoint + UserDataOffset(7));
            if((HexAndAsciiChange(*(temppoint + UserDataOffset(3)),0)==temp[0])
                ||(HexAndAsciiChange(*(temppoint + UserDataOffset(4)),0)==temp[1])
                ||(HexAndAsciiChange(*(temppoint + UserDataOffset(6)),0)==temp[2])
                ||(HexAndAsciiChange(*(temppoint + UserDataOffset(7)),0)==temp[3]))
            {
                return (CM_ERROR);
            }
            
            Addr=(HexAndAsciiChange(*(temppoint + UserDataOffset(3)),0)<<4)|(HexAndAsciiChange(*(temppoint + UserDataOffset(4)),0));
            cecop=(HexAndAsciiChange(*(temppoint + UserDataOffset(6)),0)<<4)|(HexAndAsciiChange(*(temppoint + UserDataOffset(7)),0));
            i=0;
            while((*(temppoint + UserDataOffset(8)+i)!='>')&&ArgCnt<16)
            {            
                if(*(temppoint + UserDataOffset(8)+i)==':')
                {
                    temp[0]=*(temppoint + UserDataOffset(9)+i);temp[1]=*(temppoint + UserDataOffset(10)+i);
                    if((HexAndAsciiChange(*(temppoint + UserDataOffset(9)+i),0)==temp[0])
                        ||(HexAndAsciiChange(*(temppoint + UserDataOffset(10)+i),0)==temp[1]))
                    {
                        return (CM_ERROR);
                    }
                    Args[ArgCnt++]=(HexAndAsciiChange(*(temppoint + UserDataOffset(9)+i),0)<<4)|(HexAndAsciiChange(*(temppoint + UserDataOffset(10)+i),0));
                }
                i++;
            }
            
            //sprintf(USART1_tx_buff, "CEC %d:<%02d:%02d",cPort);
            //UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
            
            #if 1
            cCount += SiiSprintf((char*)&USART1_tx_buff[cCount], "%s%d:<%02x:%02x","CEC ",cPort,Addr,cecop);
            if(ArgCnt>0)
            {
                cCount +=SiiSprintf((char*)&USART1_tx_buff[cCount], ":");
                for(i=0;i<ArgCnt;i++)
                {
                    cCount +=SiiSprintf((char*)&USART1_tx_buff[cCount], "%02x",Args[i]);
                    if((i+1)<ArgCnt)
                        cCount +=SiiSprintf((char*)&USART1_tx_buff[cCount], ":");
                }
            }
            cCount +=SiiSprintf((char*)&USART1_tx_buff[cCount], ">");
            
            UART1_SendData2PC((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
            #endif
            
            ProCECCommand2(cPort, Addr, cecop,3, ArgCnt,Args);

            #undef UserDataOffset(x)
            return CH_CORRECT;
        }
        #endif
    #endif

        /////////////////////////////////////////////////////////
//=========================================================================

        //PC串口单独控制远端某个402
        /* :   /+[Y]/[X]:******.
           PC对远端402控制协议，
           
           [Y]为1，2，3，4,5,6,7,8表示对对应远端发送指定波特率的数据，
                                                     为9的时候，
                                                      表示对8路远端同时发送数据；
                    A,B,C,D时表示设定在PWON时往对应的1、2、3、4,路远端发送的数据
                    I,J,K,L  时表示设定在PWOFF时往对应的1、2、3、4路远端发送的数据?
          [X]为1--2400；2--4800；3--9600；4--19200；5--38400；6--57600；7--115200；
          [X]表示波特率
          ****表示数据（最大支持48字节）；
        */
        pp = StrCmp(USART1_rxtailpoint, "/+", USART1_rxprocesspoint);
       if (pp != NULL)
        {
            BYTE cBraud, cRemote;
            cRemote = *pp; // Y
            if ((cRemote > '0') && (cRemote <=( '0'+MAX_OUT+1))) //if  MAX_OUT+1 send All port 
            {
                cRemote -= 0x30;
                pp++;
                if (*pp != '/')
                    return (CM_ERROR);
                pp++;
                cBraud = *pp - 0x30;  // X
                if ((cBraud > 0) && (cBraud <= 7))  // 1--2400；2--4800；3--9600；4--19200；5--38400；6--57600；7--115200
                {
                    pp++;
                    if (*pp != ':')
                        return (CM_ERROR);
                    pp++;
                    count = 0;
                    //尾指针减1
                    if (USART1_rxprocesspoint > USART1_RX_BUFF)
                        USART1_rxprocesspoint--;
                    else
                        USART1_rxprocesspoint = (USART1_RX_BUFF + USART1_RX_BUFF_MAX - 1);
                    while (pp != USART1_rxprocesspoint)
                    {
                        uart_data_temp[count] = *pp;
                        count++;
                        pp++;
                        if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                            pp = USART1_RX_BUFF;
                    }

#if(MACHINETYPE!=PRD_VHD4)
                    UART1_SendData2PC(uart_data_temp, count);
#endif

