windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
                    dvCpldSendDataToRemote(cRemote,
                                           cBraud,
                                           uart_data_temp,
                                           count);

                    return (CH_CORRECT);
                }
                else
                    return (CM_ERROR);
            }
#ifdef PRD_POWER_ONOFF_MESSAGE
            //#if (MAX_OUT>4)
            else if ((cRemote >= 'a') && (cRemote <= 'a'+MAX_OUT-1) || // a,b,c,d,e,f,g,h时表示设定在PWON时往对应的远端发送的数据；
                     (cRemote >= 'A') && (cRemote <= 'A'+MAX_OUT-1))  //  A,B,C,D,E,F,G,H  时表示设定在PWOFF时往对应的1、2、3、4路远端发送的数据?
            {
                BYTE cbPowrON;
                if((cRemote >= 'a') && (cRemote <= 'a'+MAX_OUT-1))
                {
                    cbPowrON = FALSE;
                    cRemote -= 'a';
                }
                else if((cRemote >= 'A') && (cRemote <= 'A'+MAX_OUT-1))
                {
                    cbPowrON = TRUE;
                    cRemote -= 'A';
                }
                pp++;
                if (*pp != '/')
                    return (CM_ERROR);
                pp++;
                cBraud = *pp - 0x30;
                if ((cBraud > 0) && (cBraud <= 7))// 1--2400；2--4800；3--9600；4--19200；5--38400；6--57600；7--115200
                {
                    pp++;
                    if (*pp != ':')
                        return (CM_ERROR);
                    pp++;
                    count = 0;
                    //尾指针减1
                    if (USART1_rxprocesspoint > USART1_RX_BUFF)
                        USART1_rxprocesspoint--;
                    else
                        USART1_rxprocesspoint = (USART1_RX_BUFF + USART1_RX_BUFF_MAX - 1);
                    while (pp != USART1_rxprocesspoint)
                    {
                        uart_data_temp[count] = *pp;
                        count++;
                        pp++;
                        if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                            pp = USART1_RX_BUFF;
                    }
#if 0
                    psSystemSettingData = utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
                    if (cbPowrON)
                    {
              
                        psSystemSettingData->acPowerOnMsgBaudRate[cRemote] = cBraud;
                        psSystemSettingData->acPowerOnMsgLength[cRemote] = count;
                        for (i = 0; i < count; i++)
                        {
                            psSystemSettingData->acPowerOnMsg[cRemote][i] = uart_data_temp[i];
                        }
                        psSystemSettingData->acPowerOnMsg[cRemote][i] = '\0';

                    }
                    else
                    {
                        psSystemSettingData->acPowerOffMsgBaudRate[cRemote] = cBraud;
                        psSystemSettingData->acPowerOffMsgLength[cRemote] = count;
                        for (i = 0; i < count; i++)
                        {
                            psSystemSettingData->acPowerOffMsg[cRemote][i] = uart_data_temp[i];
                        }
                        psSystemSettingData->acPowerOffMsg[cRemote][i] = '\0';
                    }
                    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
          
                    UART1_SendData2PC(uart_data_temp, count);
#endif
					ProcessSendData2Remote(cRemote, cBraud, uart_data_temp, count, cbPowrON);
                    return (CH_CORRECT);
                }
                else
                    return (CM_ERROR);
            }
#endif
            else
                return (CM_ERROR);
        }
//================================================================================================
//[x]All.	[x]路输入到所有路输出。
//All#.	设置为所有通道一一对应，如：1->1, 2->2, 3->3…
//All$.	关闭所有通道。

        temppoint = USART1_rxtailpoint;
        tempptr = StrCmp(temppoint, "All", USART1_rxprocesspoint);
        if (tempptr != NULL)
        {
            while (*tempptr != '.')
            {
                tempptr++;
                if (tempptr >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    tempptr = USART1_RX_BUFF;
                jiucuo++;
                if (jiucuo > 1)
                    return (CM_ERROR);
            }
            tempptr = StrCmp(temppoint, "All", USART1_rxprocesspoint);
            if (*tempptr == '#') //if (*tempptr == 0x23)
            { //   '#' 全部直通// 设置为所有通道一一对应，如：1->1, 2->2, 3->3…
                /****************/
		
#if 0
		bEvent.Head.opcode=eSwitchAllThrough;
		bEvent.Head.DestAddr=mqSWITCH;
		bEvent.Head.argCount=0;
	       utilExecOlnyMsgSend(mqSWITCH,
                            bEvent);
               /****************/	
/*
		   for (OutPut = 0; OutPut < MAX_OUT; OutPut++)
                {
                    InPut = OutPut;
                    appSystemSwitcherSet(InPut, 1, OutPut); //ALL#.
#ifdef PRD_IR_OUT
                    appSystemIRSwitcherSet(InPut, 1, OutPut); //ALL#.
#endif
                }
 */  //MSG send
               /****************/
		//Event_t   bEvent;
		bEvent.Head.opcode=eLEDAllThrough;
		bEvent.Head.DestAddr=mqLED;
		bEvent.Head.argCount=0;
	       utilExecOlnyMsgSend(mqLED,
                            bEvent);
               /****************/	
                cCount += SiiSprintf(&acMessage2[cCount],"%s", "All Through.");
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(InPut, OutPut, ulAllThrough);
                appUIStateChange(uiUART_SWITCH_VIDEO);
#endif
				ProcessAllThrough();
                return (CH_CORRECT);
            }
            else if (*tempptr == '$')   // else if (*tempptr == 0x24)                          // '$' 全部关闭
            {

#if 0
                appSystemSwitcherOutportCloseAll(); // video and IR
                cCount += SiiSprintf(&acMessage2[cCount], "%s","All Closed.");
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(1, 1, ulAllClose);
                appUIStateChange(uiUART_SWITCH_VIDEO);
#endif
				ProcessAllClose();
                return (CH_CORRECT);
            }
            else if (*tempptr == '@')  // '@' 全部开启 //All@.
            {

