windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
#if 0
                appSystemSwitcherOutportRecoverAll();// Video and IR

                if (Re_Message == ON)
                {
                    appUIUartMessageSet(NULL, "All Open.", TRUE);
                    appUartSwitchLedStateChange(1, 1, ulAllOpen);
                    appUIStateChange(uiUART_SWITCH_VIDEO);
                }
                else
                {
                    appUIUartMessageSet(NULL, "Switch Ok!", TRUE);
                    appUartSwitchLedStateChange(1, 1, ulAllOpen);
                    appUIStateChange(uiUART_SWITCH_VIDEO);
                }
#endif
				ProcessAllOpen(Re_Message);
                return (CH_CORRECT);
            }
            InPut = 0;
            while (*tempptr != '.')
            {
                tempptr++;
                if (tempptr >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    tempptr = USART1_RX_BUFF;
                jiucuo++;
                if (jiucuo >= 1)
                    return (CM_ERROR);
            }
            temppoint = USART1_rxtailpoint;
            while (*temppoint != 'A')                          // xAll.  [x]路输入到所有路输出。
            {
                if ((*temppoint >= '0') && (*temppoint <= '9'))  // 0 - 9
                {
                    InPut = InPut * 10 + *temppoint - 0x30;
                    returnval = 1;
                }
                else
                {
                    returnval = 0;
                    InPut = 0;
                }
                temppoint++;
                if (temppoint >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    temppoint = USART1_RX_BUFF;
            } // end of while(*temppoint != 'A')
            if (returnval == 0)
                return (CH_ERROR);
            if ((InPut > 0) && (InPut <= MAX_IN))  // 一路输入到所有路输出
            {
        
#if 0
                appSystemSwitcherSet(InPut - 1, MAX_OUT, 0, 1, 2, 3,4,5,6,7); // xAll.
#ifdef PRD_IR_OUT
                appSystemIRSwitcherSet(InPut - 1, MAX_OUT, 0, 1, 2, 3,4,5,6,7);
#endif
     
                cCount += SiiSprintf(&acMessage2[cCount], "%2d To All.", InPut);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUartSwitchLedStateChange(InPut, InPut, ulToAll);
                appUIStateChange(uiUART_SWITCH_VIDEO);
#endif
                #if 0//((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                for(i=0;i<MAX_OUT;i++)
                {
                    KeyInput[i]=InPut-1;
                }
                #endif
				ProcessOne2All(InPut);
                return (CH_CORRECT);
            }
            else
                return (CH_ERROR);
        }
        ////////////////////////////////////////////////////////////////////
//================================================================================
////////////////////////////////////////////////////////////////////
//[x1]V[x2].
// [x]路输入对[x]路输出。
        temppoint = USART1_rxtailpoint;
        if (StrCmp(temppoint, "#", USART1_rxprocesspoint) != NULL)      // '#': Through
        {
            OutPut = 0;
            temppoint = USART1_rxtailpoint;
            while (*temppoint != '.')
            {
                cmddata = *temppoint;
                if ((cmddata > '/') && (cmddata < ':'))       // number 0 - 9
                {
                    OutPut = OutPut * 10 + cmddata - 0x30;
                }
                if ((cmddata == ',') || (cmddata == '#'))
                {
                    if ((OutPut > 0) && (OutPut <= MAX_OUT))
                    {
                        InPut = OutPut;
#if 0
                        appSystemSwitcherSet(InPut - 1, 1, OutPut - 1);
                        cCount += SiiSprintf(&acMessage2[cCount], "%2d Through.", InPut);
                        appUIUartMessageSet(NULL, acMessage2, TRUE);
                        appUartSwitchLedStateChange(InPut, InPut, ulThrough);
                        appUIStateChange(uiUART_SWITCH_VIDEO);
#endif
						ProcessOne2One(InPut, OutPut);
                    }
                    else
                        return (CH_ERROR);
                    OutPut = 0;
                }
                temppoint++;
                if (temppoint >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    temppoint = USART1_RX_BUFF;
            } // end of while
            return (CH_CORRECT);
        }
        ///////////////////////////////////////////////////////////////////////
        /////////////////////////////////////////////////////////////////////////
//================================================================================
// [x]$.	    关闭[x]路输出。
        temppoint = USART1_rxtailpoint;
        if (StrCmp(temppoint, "$", USART1_rxprocesspoint) != NULL)      // '$': close
        {
            OutPut = 0;
            temppoint = USART1_rxtailpoint;
            while (*temppoint != '.')
            {
                cmddata = *temppoint;
                if ((cmddata > '/') && (cmddata < ':'))       // number 0 - 9
                {
                    OutPut = OutPut * 10 + cmddata - 0x30;
                }
                if ((cmddata == ',') || (cmddata == '$'))
                {
                    if ((OutPut > 0) && (OutPut <= MAX_OUT))
                    {
#if 0
                        psOutputPortMgrData  = (POUTPUTPORT_MANAGER_DATA)utilDataMgrWriteLockData(nnOUTPUTPORT_MANAGER_DATA);
                        if ((psOutputPortMgrData->acInPortSelect[OutPut - 1]) < MAX_IN)
                            psOutputPortMgrData->acCloseInPortSelect[OutPut - 1] = psOutputPortMgrData->acInPortSelect[OutPut - 1];
#ifdef PRD_IR_OUT
                        if ((psOutputPortMgrData->acIRInPortSelect[OutPut - 1]) < MAX_IN)
                            psOutputPortMgrData->acIRCloseInPortSelect[OutPut - 1] = psOutputPortMgrData->acIRInPortSelect[OutPut - 1];

#endif
                        utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,
                                          TRUE);
                        appSystemSwitcherSet(MAX_IN, 1, OutPut - 1);
#ifdef PRD_IR_OUT
			            appSystemIRSwitcherSet(MAX_IN, 1, OutPut - 1);
#endif

                        cCount += SiiSprintf(&acMessage2[cCount], "%2d Closed.", OutPut);
                        appUIUartMessageSet(NULL, acMessage2, TRUE);
                        appUartSwitchLedStateChange(OutPut, OutPut, ulClose);
                        appUIStateChange(uiUART_SWITCH_VIDEO);
#endif
						ProcessOneClose(OutPut);
                    }
                    else
                        return (CH_ERROR);
                    OutPut = 0;
                }
                temppoint++;
                if (temppoint >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    temppoint = USART1_RX_BUFF;
            } // end of while
            return (CH_CORRECT);
        }
//===================================================================================
//[x]@.	开启[x]路输出。
        temppoint = USART1_rxtailpoint;
        pp = StrCmp(temppoint, "@", USART1_rxprocesspoint);
        if (pp != NULL)      // '@': open
        {
            while (*pp != '.')
            {
                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;
                jiucuo++;
                if (jiucuo >= 1)
                    return (CM_ERROR);
            }
            OutPut = 0;
            temppoint = USART1_rxtailpoint;
            while (*temppoint != '.')
            {
                cmddata = *temppoint;
                if ((cmddata >= '0') && (cmddata <= '9'))       // number 0 - 9
                {
                    OutPut = OutPut * 10 + cmddata - 0x30;
                }
                if ((cmddata == ',') || (cmddata == '@'))
                {
                    if ((OutPut > 0) && (OutPut <= MAX_OUT))
                    {
#if 0
                        psOutputPortMgrData  = (POUTPUTPORT_MANAGER_DATA)utilDataMgrWriteLockData(nnOUTPUTPORT_MANAGER_DATA);

                        if ((psOutputPortMgrData->acInPortSelect[OutPut - 1]) >= MAX_IN)
                        {
                            psOutputPortMgrData->acInPortSelect[OutPut - 1] = psOutputPortMgrData->acCloseInPortSelect[OutPut - 1];
#ifdef PRD_IR_OUT
                            psOutputPortMgrData->acIRInPortSelect[OutPut - 1] = psOutputPortMgrData->acIRCloseInPortSelect[OutPut - 1];
#endif

                            utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,
                                              TRUE);
                            appSystemSwitcherSet(psOutputPortMgrData->acInPortSelect[OutPut - 1], 1, OutPut - 1);
                        }
                        else
                            utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,
                                              TRUE);
                        if (Re_Message == ON)
                        {
                            cCount += SiiSprintf(&acMessage2[cCount], "%02d Open.", OutPut);
                            appUIUartMessageSet(NULL, acMessage2, TRUE);
                            appUartSwitchLedStateChange(OutPut, OutPut, ulOpen);
                            appUIStateChange(uiUART_SWITCH_VIDEO);

