windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
                        }
                        else
                        {

                            cCount += SiiSprintf(&acMessage2[cCount], "Switch Ok!");
                            appUIUartMessageSet(NULL, acMessage2, TRUE);
                            appUartSwitchLedStateChange(OutPut, OutPut, ulOpen);
                            appUIStateChange(uiUART_SWITCH_VIDEO);

                        }
#endif
						ProcessOneOpen(OutPut, Re_Message);
                    }
                    else
                        return (CH_ERROR);
                    OutPut = 0;
                }
                temppoint++;
                if (temppoint >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    temppoint = USART1_RX_BUFF;
            } // end of while
            return (CH_CORRECT);
        }
        temppoint = USART1_rxtailpoint;
//=========================================================================================
//Save[Y].	保存当前状态到第[Y]组，[Y]为0 - 9 数字键。

        tempptr = StrCmp(temppoint, "Save", USART1_rxprocesspoint);    // Save to 24C32
        if (tempptr != NULL)
        {
            while (*tempptr != '.')
            {
                if ((*tempptr > '/') && (*tempptr < ':')) // number 0 - 9
                {
                    InPut = InPut * 10 + *tempptr - 0x30;
                    i = 0x55;
                }

                tempptr++;
                if (tempptr >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    tempptr = USART1_RX_BUFF;

                jiucuo++;
                if (jiucuo > 4)
                    return (CM_ERROR); //最多支持3位数据位
            }

            if ((InPut < 10) && (i == 0x55))
            {
#if 0
                cCount += SiiSprintf(&acMessage2[cCount], "Save To F%d", InPut);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUIStateChange(uiUART_MESSAGE);


                appSystemSwitcherScenceSave(InPut);
#endif
 				ProcessSaveCurrentStatus(InPut);      
            }
            else
                return (CM_ERROR); //最多支持3位数据位
            return (CH_CORRECT);
        }
//==================================================================================
//Recall[Y].	从第[Y]组恢复，[Y]为0–9数字键。

        temppoint = USART1_rxtailpoint;
        tempptr = StrCmp(temppoint, "Recall", USART1_rxprocesspoint);  // Recall from 24C32
        if (tempptr != NULL)
        {
            while (*tempptr != '.')
            {
                if ((*tempptr > '/') && (*tempptr < ':')) // number 0 - 9
                {
                    InPut = InPut * 10 + *tempptr - 0x30;
                    i = 0x55;
                }

                tempptr++;
                if (tempptr >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    tempptr = USART1_RX_BUFF;

                jiucuo++;
                if (jiucuo > 4)
                    return (CM_ERROR); //最多支持3位数据位
            }

            if ((InPut < 10) && (i == 0x55))
            {
         
#if 0
                cCount += SiiSprintf(&acMessage2[cCount], "Recall From F%d", InPut);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUIStateChange(uiUART_MESSAGE);

                appSystemSwitcherScenceCall(InPut);
#endif
				ProcessRecallStatus(InPut);
            }
            else
                return (CM_ERROR); //最多支持3位数据位
            return (CH_CORRECT);
        }
//====================================================================
        temppoint = USART1_rxtailpoint;
        tempptr = StrCmp(temppoint, "Clear", USART1_rxprocesspoint);   // Clear 24C32
        if (tempptr != NULL)
        {
            while (*tempptr != '.')
            {
                if ((*tempptr > '/') && (*tempptr < ':')) // number 0 - 9
                {
                    InPut = InPut * 10 + *tempptr - 0x30;
                    i = 0x55;
                }

                tempptr++;
                if (tempptr >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    tempptr = USART1_RX_BUFF;

                jiucuo++;
                if (jiucuo > 4)
                    return (CM_ERROR); //最多支持3位数据位
            }

            if ((InPut < 10) && (i == 0x55))
            {

#if 0
                cCount += SiiSprintf(&acMessage2[cCount], "Clear F%d", InPut);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUIStateChange(uiUART_MESSAGE);

                appSystemSwitcherScenceDel(InPut);
#endif
				ProcessClearStatus(InPut);
            }
            else
                return (CM_ERROR); //最多支持3位数据位
            return (CH_CORRECT);
        }
//================================================================
//Status.	查询全部输出通道的当前状态。
        temppoint = USART1_rxtailpoint;
        tempptr = StrCmp(temppoint, "Status", USART1_rxprocesspoint);   // Status
        if (tempptr != NULL)
        {
            if (*temppoint != 'S')
            {
                return (CH_ERROR);
            }
            OutPut = *(tempptr);
            if ((OutPut > 0x30) && (OutPut < (MAX_OUT + 0x31)))             // 查看一个通道状态
            {
                OutPut = OutPut - 0x30; // ASCII to Digital //[kyq add: 20150825 13:41:52]
                appUIUartMessageSwitcherPortSet(OutPut - 1);
                return (CH_CORRECT);
            }
            else if (*tempptr == '.')                                 // 查看全部通道状态
            {
                appUIUartMessageSwitcherPortSet(MAX_OUT);
                return (CH_CORRECT);
            }
            else
                return (CH_ERROR);
        }
/*************************************************************************************************************************/
	//I-Lock[x].	指定输入通道锁定功能
		temppoint = USART1_rxtailpoint;
        tempptr = StrCmp(temppoint, "I-Lock", USART1_rxprocesspoint);   // Status
        if (tempptr != NULL)
        {
#if 0
        		POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;
            	psOutputPortMgrData  = (POUTPUTPORT_MANAGER_DATA)utilDataMgrReadLockData(nnOUTPUTPORT_MANAGER_DATA);
        		psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);     		  	
#endif
             	while (*tempptr != '.')
            	{
	                if ((*tempptr > '0') && (*tempptr <= ('0'+MAX_IN))) // number 0 - 9
	                {
	                    InPut =  *tempptr - 0x30;   
	                }

                	tempptr++;
                	if (tempptr >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    	tempptr = USART1_RX_BUFF;

                	jiucuo++;
                	if (jiucuo > 1)
                    	return (CM_ERROR); //最多支持1位数据位
                }
                
