windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
#if 0
                //POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;
            	psOutputPortMgrData  = (POUTPUTPORT_MANAGER_DATA)utilDataMgrReadLockData(nnOUTPUTPORT_MANAGER_DATA);
        		psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA); 
            	if ((InPut >0) && (InPut <= MAX_IN ))             // 查看一个通道状态
	            {
					psSystemSettingData->acIChannellock[InPut - 1]=0x00;//刷新该锁定的通道
					for(i=0;i<MAX_OUT;i++)
	            	{
	            		cInPort = psOutputPortMgrData->acInPortSelect[i];//判断每个输出口当前接入的信号，如果是被锁定的则记录
						if(cInPort!=InPut-1)
						{		
					 		psSystemSettingData->acIChannellock[InPut - 1] = psSystemSettingData->acIChannellock[InPut - 1]|BIT(i);	//0x0 xxxx	
						}
	            	}

					utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,  TRUE);
					utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,  TRUE);             
					sprintf(USART1_tx_buff,"Channel %d Lock!\r\n",InPut);
					UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
	            	return (CH_CORRECT);
	            }
            	else
                	return (CH_ERROR);
#endif
				return (cReturnValue = ProcessLockOneChannel(InPut));
        }
		  //================================================================
//I-Lock[x].	指定输入通道解锁
		temppoint = USART1_rxtailpoint;
        tempptr = StrCmp(temppoint, "I-UnLock", USART1_rxprocesspoint);   // 
        if (tempptr != NULL)
        {
#if 0
        	  POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;        
		  psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
#endif
           while (*tempptr != '.')
            	{
                 if ((*tempptr > '0') && (*tempptr <= ('0'+MAX_IN))) // number 0 - 9
                {
                    InPut =  *tempptr - 0x30;
               
                }

                tempptr++;
                if (tempptr >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    tempptr = USART1_RX_BUFF;

                jiucuo++;
                if (jiucuo > 4)
                    return (CM_ERROR); //最多支持3位数据位
            }
#if 0
            if ((InPut > 0) && (InPut <=MAX_IN ))            
            {           
			psSystemSettingData->acIChannellock[InPut - 1] =0x00; //0x0 xxxx	  
					 //OutPut = OutPut - 0x30; // ASCII to Digital //[kyq add: 20150825 13:41:52]                  
            	utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,TRUE);
			 sprintf(USART1_tx_buff,"Channel %d Unlock!\r\n",InPut);
                       UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
                return (CH_CORRECT);
            }
            else
            {
				utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,TRUE);
				 return (CH_ERROR);
            }
#endif
			return (cReturnValue = ProcessUnlockOneChannel(InPut));
        }
//=============================================================================
//I-Lock All.锁定所有通道

        if (StrCmp(USART1_rxtailpoint, "A-Lock.", USART1_rxprocesspoint) != NULL)             
        {
            if (*USART1_rxtailpoint != 'A')
            {
          //      return (CH_ERROR);
            }
#if 0
		 POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;        
		  psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
		   psOutputPortMgrData  = (POUTPUTPORT_MANAGER_DATA)utilDataMgrReadLockData(nnOUTPUTPORT_MANAGER_DATA);
		 for(i=0;i<MAX_IN;i++)
		 {
		 	psSystemSettingData->acIChannellock[i]=0x00;
			cInPort=i;
			for(j=0;j<MAX_OUT;j++)
            	{             		
            		if(cInPort != psOutputPortMgrData->acInPortSelect[j])//判断每个输出口当前接入的信号，如果是被锁定的则记录	
					psSystemSettingData->acIChannellock[i] = psSystemSettingData->acIChannellock[i]|(BIT(j));
			}
            
		 }
		  sprintf(USART1_tx_buff,"All Channel Lock!\r\n");
            UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
		  utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,  false);   
            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,TRUE);
#endif
			ProcessLockAllChannel();
            return (CH_CORRECT);
        }
//=============================================================================
//I-UnLock All.解锁所有通道
// 
        if (StrCmp(USART1_rxtailpoint, "A-UnLock.", USART1_rxprocesspoint) != NULL)             
        {
            if (*USART1_rxtailpoint != 'A')
            {
     //           return (CH_ERROR);
            }
#if 0
		 POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;        
		  psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
		 for(i=0;i<MAX_IN;i++)
		 {
			psSystemSettingData->acIChannellock[i]=0x00;
		 }
		  sprintf(USART1_tx_buff,"All Channel Unlock!\r\n");
            UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,TRUE);
#endif
			ProcessUnlockAllChannel();
            return (CH_CORRECT);
        }
//=============================================================================
//lock.	查看当前通道锁定状态
// 
        if (StrCmp(USART1_rxtailpoint, "Lock-Sta.", USART1_rxprocesspoint) != NULL)             
        {
            if (*USART1_rxtailpoint != 'S')
            {
           //     return (CH_ERROR);
            }
#if 0
		 POUTPUTPORT_MANAGER_DATA    psOutputPortMgrData;        
		  psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
		 for(j=0;j<MAX_OUT;j++)
		 {
			for(i=0;i<MAX_IN;i++)
			{
				if( (psSystemSettingData->acIChannellock[i]&BIT(j)))	
				{	
					sprintf(USART1_tx_buff,"Channel %d->%d Lock!\r\n",i+1,j+1);
            			UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
				}
				else
				{
					sprintf(USART1_tx_buff,"Channel %d->%d Unlock!\r\n",i+1,j+1);
            			UART1_SendBytes((uint8_t *)USART1_tx_buff,strlen(USART1_tx_buff));	
				}
			}
			
