windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
		 }
            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,false);
#endif
			ProCheckAllLockStatus();
            return (CH_CORRECT);
        }
//=======================================================================
//=======================================================================
//Demo.D
        if (StrCmp(USART1_rxtailpoint, "Demo.", USART1_rxprocesspoint) != NULL) // DEMO
        {
         //   BOOL bDemoEn = appSystemSwitchDemoModeEnableGet();//alone in the module
          
#if 0
            if (bDemoEn)
                cCount += SiiSprintf(&acMessage2[cCount], "Normal Mode");
    
            else
                cCount += SiiSprintf(&acMessage2[cCount], "Demo Mode");
            
            UART1_SendData2PC(acMessage2, cCount);
	     appUIUartMessageSet(NULL, acMessage2, FALSE);//[kyq add: 20150924 15:49:38]
	      appUIStateChange(uiUART_MESSAGE);
/****************/
		//Event_t   bEvent;
		bEvent.Head.opcode=eSwitchDemoMode;
		bEvent.Head.DestAddr=mqSWITCH;
		bEvent.args[0]=!bDemoEn;
		bEvent.Head.argCount=1;
	       utilExecOlnyMsgSend(mqSWITCH,
                            bEvent);
/****************/	
          bDemoEn=!bDemoEn;
        //    appSystemSwitchDemoModeEnableSet(!bDemoEn);  //msg send
          m_bCommdDemo = TRUE; // kyq 20150929
#endif
			ProSettingDemoStatus();
            return (CH_CORRECT);
        }
//=============================================================================
//Undo.	取消当前操作，所回上一次切换的状态。
// UUUUUUndo.
        if (StrCmp(USART1_rxtailpoint, "Undo.", USART1_rxprocesspoint) != NULL)             // Undo
        {
            if (*USART1_rxtailpoint != 'U')
            {
                return (CH_ERROR);
            }
            //SW_Undo();
            cCount += SiiSprintf((char*)&acMessage2[cCount], "%s","Undo Ok!");
            appUIUartMessageSet(NULL, acMessage2, TRUE);
            appUIStateChange(uiUART_MESSAGE);

            appSystemSwitcherUndo();
            return (CH_CORRECT);
        }
//===============================================================================
#if 0
        if (StrCmp(USART1_rxtailpoint, "PWON.", USART1_rxprocesspoint) != NULL)
        {
            if (*USART1_rxtailpoint != 'P')
            {
                return (CH_ERROR);
            }
            PWON_process();


            return (CH_CORRECT);
        }
#endif


//===============================================================================
        if (StrCmp(USART1_rxtailpoint, "STANDBY.", USART1_rxprocesspoint) != NULL)
        {

            cCount += SiiSprintf((char*)&acMessage2[cCount],"%s", "STANDBY...");
            appUIUartMessageSet(NULL, acMessage2, FALSE);
            appUIStateChange(uiUART_MESSAGE);
            appPowerMgrPowerStateSet(pwrSTANDBY);
            #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
            KeyLedSetAllClose();
            #endif
            return (CH_CORRECT);
        }

//===============================================================================

        if (StrCmp(USART1_rxtailpoint, "PWOFF.", USART1_rxprocesspoint) != NULL)
        {
            cCount += SiiSprintf((char*)&acMessage2[cCount],"%s", "PWOFF");
            appUIUartMessageSet(NULL, acMessage2, FALSE);
            appUIStateChange(uiUART_MESSAGE);
            appPowerMgrPowerStateSet(pwrSOFTOFF);
            #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
            KeyLedSetAllClose();
            #endif
            return (CH_CORRECT);
        }
//===============================================================================
//          /%I/1:1.
// /%[Y]/[X]:[Z].
// HDCP管理指令：
// [Y]表示I/O，
// [x]表示端口号（ALL表示所有通道）；
// [Z]表示状态
//                          1对于输出表示带HDCP，对于输入表示兼容HDCP设备；
//                          0对于输出表示输出不带HDCP  对于输入表示不兼容HDCP设备）
        /****************************下面是有关HDCP管理指令**************************************/
        pp = StrCmp(USART1_rxtailpoint, "/%", USART1_rxprocesspoint);
        if (pp != NULL)   // 开启HDCP
        {
            BYTE  cPort = 0;
            BOOL bIsInport = 0;
            BYTE cEnalbe = 0;
            BOOL bAllPort = 0;

            //这里开始真正处理
            pp = StrCmp(USART1_rxtailpoint, "/%", USART1_rxprocesspoint);
            if (*pp == 'I')
                bIsInport = 1;
            else if (*pp == 'O')
                bIsInport = 0;
            else
                return (CH_CORRECT);
 
            pp++;
            if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                pp = USART1_RX_BUFF;
            if (StrCmp(USART1_rxtailpoint, "ALL", USART1_rxprocesspoint) == NULL)
            {
                bAllPort = 0; //表示对单个通道进行操作
                              //得出通道号
                while (*pp != ':')
                {
                    // 得到端口号
                    if ((*pp > '/') && (*pp < ':')) // number 0 - 9
                    {
                        cPort = cPort * 10 + *pp - 0x30;
                    }

                    pp++;
                    if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                        pp = USART1_RX_BUFF;

                    jiucuo++;
                    if (jiucuo > 4)
                        return (CM_ERROR); //最多支持3位数据位
                }

                if ((cPort == 0) || (cPort > MAX_IN))
                    return (CM_ERROR);
            }
            else
            {
                // 针对所有通道
                pp = StrCmp(USART1_rxtailpoint, "ALL", USART1_rxprocesspoint);
                bAllPort = 1;
            }
            //得出HDCP状态
            pp++;
            jiucuo = 0;
            while (*pp != '.')
            {
                if ((*pp > '/') && (*pp < ':')) // number 0 - 9
                {
                    cEnalbe = cEnalbe * 10 + *pp - 0x30;
                }
                else
                    return (CM_ERROR);

                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;

                jiucuo++;
                if (jiucuo > 4)
                    return (CM_ERROR);

                if (cEnalbe > 1)
                    return (CM_ERROR);
            }
#if 0
            ////////////////////////////////////////////////////////
            if (bIsInport == 1) //处理输入HDCP问题
            {
                psInputPortMgrData = (PINPUTPORT_MANAGER_DATA)utilDataMgrWriteLockData(nnINPUTPORT_MAMAGER_DATA);
                //k = 0;
                if (bAllPort == 0)
                {
                    //  对于输入表示不兼容HDCP设备）
                    //  输入不支持带HDCP
                    psInputPortMgrData->abInputHDCP_EN[cPort - 1] = cEnalbe;
                }
                else // 针对所有通道
                {
                    for (i = 0; i < MAX_IN; i++)
                    {
                        psInputPortMgrData->abInputHDCP_EN[i] = cEnalbe;
                    }
                }
                utilDataMgrUnlock(nnINPUTPORT_MAMAGER_DATA, TRUE);
            }
            else if (bIsInport == 0)  //  输出端HDCP 设置
            {
                psOutputPortMgrData = utilDataMgrWriteLockData(nnOUTPUTPORT_MANAGER_DATA);
                if (bAllPort == 0)
                {
                    psOutputPortMgrData->abHDCP_EN[cPort - 1] = cEnalbe;
                    psOutputPortMgrData->abHDCP_AUTO[cPort - 1] = FALSE;

