windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
                }
                else
                {
                    for (i = 0; i < MAX_OUT; i++)
                    {
                        psOutputPortMgrData->abHDCP_EN[i] = cEnalbe;
                        psOutputPortMgrData->abHDCP_AUTO[i] = FALSE;
                    }
                }
                utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA, TRUE);

            }
#endif
			ProChannelHdcp(bIsInport, bAllPort, cPort, cEnalbe);
			
            pp++;
            memcpy(acMessage2, USART1_rxtailpoint, (pp - USART1_rxtailpoint));
            appUIUartMessageSet(NULL, acMessage2, TRUE);
            appUIStateChange(uiUART_MESSAGE);

            return (CH_CORRECT);
        }
//=====================================================================================
//////////////////////////////////////////////////////////////////////////////
// pp = StrCmp(USART1_rxtailpoint, "Audio/", USART1_rxprocesspoint);

        //////////////////////////////////////////////////////////////////////////////////////////////
        ///EDIDMInit.
        ///恢复出厂设置EDID数据到每个输入端口
        if (StrCmp(USART1_rxtailpoint, "EDIDMInit", USART1_rxprocesspoint) != NULL)
        {
#if 0
            cCount += SiiSprintf(&acMessage2[cCount],"%s", "EDIDMInit.");
            appUIUartMessageSet(NULL, acMessage2, TRUE);
            appUIStateChange(uiUART_MESSAGE);


            //memcpy(g_edidFlashEdidTable, init_edidFlashEdidTable, EDID_TABLE_LEN);
            for (i = 0; i < MAX_IN; i++)      //Intialize 9679 EDID
                appSystemInputPortEdidSet(i, edsEDID_Default);
#endif
 			ProFactoryDefaultEDID();
            return (CH_CORRECT);
        }
//========================================================================================
// EDIDG[x].
//获取输出端口的EDID数据并通过串口显示出来[x]输出端口号
        pp = StrCmp(USART1_rxtailpoint, "EDIDG", USART1_rxprocesspoint);
        if (pp != NULL)
        {

            while (*pp != '.')
            {
                if ((*pp > '/') && (*pp < ':')) // number 0 - 9
                {
                    HPnum1 = HPnum1 * 10 + *pp - 0x30;
                }

                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;

                jiucuo++;
                if (jiucuo > 3)
                    return (CM_ERROR); //最多支持3位数据位
            }

#if 0
            if ((HPnum1 > 0) && (HPnum1 <= MAX_OUT))
            {

                cSii9533Instance = utilOutputPortToInstance(HPnum1 - 1);
                if (SiiTxStatusGet(cSii9533Instance).isHotPlugDetected) //[kyq add: 20150728 15:38:23]
                {
                    SiiTxEdidGetEdidData(cSii9533Instance, acEDID_data); //[kyq ADD: 20150728 15:30:37]
                                                          
                    for (j = 0; j < EDID_TABLE_LEN; j++) UART1_SendByte(acEDID_data[j]);
                    UART1_SendByte(0x0D);
                    UART1_SendByte(0x0A);
                }
                else
                {
  
                    cCount += SiiSprintf(&acMessage2[cCount],"%s", "NO device !");
                    appUIUartMessageSet(NULL, acMessage2, TRUE);
                    appUIStateChange(uiUART_MESSAGE);

                }
            }
            else
            {
                return (CH_ERROR);
            }
            return (CH_CORRECT);
#endif
			return (cReturnValue = ProGetOutportEDIDData(HPnum1));
        }
//========================================================================================

        ////////////////////////////////////////////////////////////////////////////
        //获取内置对应编号的EDID数据 【X】1?2?3?4,5,表示存储5种内置EDID,并通过232显示出来
        pp = StrCmp(USART1_rxtailpoint, "GetIntEDID", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            HPnum1 = *pp - 0x30;
            if ((HPnum1 > 0) && (HPnum1 <= (edsEDID_EXTERN1-edsEDID_INTERN1)))
            {

                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;
                if (*pp == '.')
                {
#if 0                
                    for (j = 0; j < EDID_TABLE_LEN; j++)
                    {
                        acEDID_data[j] = 0;
                    }
                    dvNVRAMUserEdidRead(HPnum1, acEDID_data);
                    for (j = 0; j < EDID_TABLE_LEN; j++) UART1_SendByte(acEDID_data[j]);

                    UART1_SendByte(0x0D);
                    UART1_SendByte(0x0A);
#endif
					ProGetEmbeddingEDIDData(HPnum1);
                    return (CH_CORRECT);
                }
                else
                    return (CM_ERROR);
            }
            else
                return (CM_ERROR);
        }

//========================================================================================

        ////////////////////////////////////////////////////////////////////////////
        ///获取当前对应的输入通道的EDID数据 【X】1?2?3?4表示当前对应的输入端口?并通过232显示出来
        pp = StrCmp(USART1_rxtailpoint, "GetInPortEDID", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            //BYTE cEdidSelect;
            HPnum1 = *pp - 0x30;
            if ((HPnum1 > 0) && (HPnum1 < (MAX_IN + 1)))
            {
                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;

                if (*pp == '.')
                {
                #if 0
                    for (j = 0; j < EDID_TABLE_LEN; j++)
                    {
                        acEDID_data[j] = 0;
                    }

                    dvNVRAMUserEdidRead(edsEDID_IN1+HPnum1 - 1, acEDID_data);
                    for (j = 0; j < EDID_TABLE_LEN; j++) UART1_SendByte(acEDID_data[j]);
                #endif
					ProGetInportEDIDData(HPnum1);
                    return (CH_CORRECT);
                }
                else
                    return (CM_ERROR);
            }
            else
                return (CM_ERROR);
        }
//==============================================================================
// EDIDM[X]B[Y].
// 将第[X]路输出口接的显示器的EDID拷贝到第[Y]路输入口?如果读取错误?将按初始化的EDID数据配置
        pp = StrCmp(USART1_rxtailpoint, "EDIDM", USART1_rxprocesspoint);
        if (pp != NULL)             // EdidM 1B1
        {
            while (*pp != '.')
            {
                user_temp[count++] = *pp;

                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;
            }
            pp = StrCmp(USART1_rxtailpoint, "EDIDM", USART1_rxprocesspoint);
            if ((*pp > '/') && (*pp < ':'))
            {
                while (*pp != 'B')
                {
                    if ((*pp > '/') && (*pp < ':')) // number 0 - 9
                    {
                        HPnum1 = HPnum1 * 10 + *pp - 0x30; // 输入端口
                    }

                    pp++;
                    if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                        pp = USART1_RX_BUFF;

                    jiucuo++;
                    if (jiucuo > 3)
                        return (CM_ERROR);

