windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
                }
                if ((HPnum1 > MAX_OUT) || (HPnum1 == 0))
                    return (CM_ERROR);
                jiucuo = 0;
                pp++;
                if (StrCmp(pp, "ALL", USART1_rxprocesspoint) == NULL)
                {
                    while (*pp != '.')
                    {
                        if ((*pp > '/') && (*pp < ':')) // number 0 - 9
                        {
                            HPnum2 = HPnum2 * 10 + *pp - 0x30;
                        }

                        pp++;
                        if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                            pp = USART1_RX_BUFF;

                        jiucuo++;
                        if (jiucuo > 3)
                            return (CM_ERROR);

                    }

                }
                else
                {
                    HPnum2 = MAX_IN+1;  //over MAX_IN is All channel
                }

                if ((HPnum2 > (MAX_IN + 1)) || (HPnum2 == 0))
                    return (CM_ERROR);
                //    HPnum1:  输出口
                //	 HPnum2: 输入口
#if 0
                if (HPnum2 == MAX_IN+1)
                {
                    for (i = 0; i < MAX_IN; i++)
                    {
                        appSystemInputPortEdidSet(i, edsEDID_EXTERN1 + HPnum1 - 1);

                    }

                }
                else
                {
                    appSystemInputPortEdidSet(HPnum2 - 1, edsEDID_EXTERN1 + HPnum1 - 1);
                }


                //处理反馈信息

                if (HPnum2 < (MAX_IN + 1))
                {
                    cCount += SiiSprintf(&acMessage2[cCount], "EDIDM%dB%d", HPnum1, HPnum2);
                    appUIUartMessageSet(NULL, acMessage2, TRUE);
                    appUIStateChange(uiUART_MESSAGE);

                }
                else
                {
                    cCount += SiiSprintf(&acMessage2[cCount], "EDIDM%dBALL", HPnum1);
                    appUIUartMessageSet(NULL, acMessage2, TRUE);
                    appUIStateChange(uiUART_MESSAGE);

                }
#endif
				ProCopyEDIDDataOutport2Inport(HPnum1, HPnum2);
                return (CH_CORRECT);
            }
            else
                return (CM_ERROR);
        }
//==================================================================================
//EDIDH[x]B[y].
//将第[X]路输出口接的显示器的EDID拷贝到第[Y]路输入口,如果读取的
//EDID数据正确并且声音不只是支持PCM的时候，就强制修改为只支持PCM；
//如果读取错误，将按初始化的EDID数据配置;
//
        pp = StrCmp(USART1_rxtailpoint, "EDIDH", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            //BYTE cInstance = 0;
            //BYTE acEdid[256];
            while (*pp != '.')
            {
                user_temp[count++] = *pp;

                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;
            }
            pp = StrCmp(USART1_rxtailpoint, "EDIDH", USART1_rxprocesspoint);
            if ((*pp > '/') && (*pp < ':'))
            {
                while (*pp != 'B')
                {
                    if ((*pp > '/') && (*pp < ':')) // number 0 - 9
                    {
                        HPnum1 = HPnum1 * 10 + *pp - 0x30;
                    }

                    pp++;
                    if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                        pp = USART1_RX_BUFF;

                    jiucuo++;
                    if (jiucuo > 3)
                        return (CM_ERROR);
                }
                if ((HPnum1 > MAX_OUT) || (HPnum1 == 0))
                    return (CM_ERROR);
                jiucuo = 0;
                pp++;
                while (*pp != '.')
                {
                    if ((*pp > '/') && (*pp < ':')) // number 0 - 9
                    {
                        HPnum2 = HPnum2 * 10 + *pp - 0x30;
                    }

                    pp++;
                    if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                        pp = USART1_RX_BUFF;

                    jiucuo++;
                    if (jiucuo > 3)
                        return (CM_ERROR);
                }
                if ((HPnum2 > MAX_IN) || (HPnum2 == 0))
                    return (CM_ERROR);
#if 0
                crc = 0;
                // if (check_HPD(HPnum1)) //如果后端接有设备
                cInstance = utilOutputPortToInstance(HPnum1 - 1);
                if (SiiTxStatusGet(cInstance).isHotPlugDetected) //[kyq add: 20150728 15:38:23]
                {
                    //将对应的输出通道的EDID数据读取出来
                    //EDID_get_slect_en(HPnum1, 0);
                    //get_EDID(HPnum1, g_tempData);
                    SiiTxEdidGetEdidData(cInstance, acEDID_data); //[kyq ADD: 20150728 15:31:00]
                                                                  //EDID_get_slect_en(HPnum1, 1);

                    if (acEDID_data[126] == 1) //HDMI
                    {
                        for (j = 0; j < EDID_TABLE_LEN; j++)  crc += acEDID_data[j];
                    }
                    else
                    {
                        for (j = 0; j < 128; j++)  crc += acEDID_data[j];
                        for (j = 128; j < EDID_TABLE_LEN; j++)  acEDID_data[j] = 0xff;
                    }
                    if (crc == 0)
                    {
                        if ((acEDID_data[0] == 0) && (acEDID_data[1] == 0xff) && (acEDID_data[7] == 0));
                        else
                        {
                            return (CM_ERROR);
                        }
                    }
                    else
                    {
                        return (CM_ERROR);
                    }
                }
                else
                    return (CM_ERROR);
                //处理强制PCM部分
                if ((acEDID_data[0] == 0x00) && (acEDID_data[1] == 0xff) && (acEDID_data[7] == 0x00))
                {
                    if (acEDID_data[126] == 0x01) //HDMI的EDID数据
                    {
                        IndexC = EDID_GetDataBlockAddr(acEDID_data, 0x40, 132);
                        EndT = (acEDID_data[IndexC] & 0x1F);
                        IndexC = EDID_GetDataBlockAddr(acEDID_data, 0x20, IndexC + EndT + 1);
                        if (IndexC > 132) //找到音频设置
                        {
                            EndT = (acEDID_data[IndexC] & 0x1F);
                            if ((acEDID_data[IndexC] == 0x23) && ((acEDID_data[IndexC + 1] & 0x78) == 0x08)); //只支持PCM的时候
                            else
                            {
                                if (EndT > 3)
                                    acEDID_data[130] -= (EndT - 3); //视频描述的偏移地址需要变动
                                acEDID_data[IndexC] =  0x23;
                                acEDID_data[IndexC + 1] =  0x09;
                                acEDID_data[IndexC + 2] =  0x07;
                                acEDID_data[IndexC + 3] =  0x07;

                                m = IndexC + EndT + 1; //起始下标
                                x = 0;
                                for (n = m; n < 255; n++)
                                {
                                    k = acEDID_data[n];
                                    acEDID_data[IndexC + 4 + x] = k;
                                    x++;
                                }

                                for (n = (IndexC + 4 + x); n < 255; n++)
                                {
                                    acEDID_data[n] = 0;
                                }

                                for (conut = 128; conut < 255; conut++)  crc += acEDID_data[conut];
                                acEDID_data[255] = ~(crc - 1);
                            }
                        }
                        else //没有找到音频配置数据
                        {
                            for (conut = 128; conut < 256; conut++)  acEDID_data[conut] = g_Init_EdidFlashEdidTable[conut];  //将默认的EDID数据的后128字节拷贝过去
                        }
                    }
                    else //DVI的EDID频数据
                    {
                        for (conut = 128; conut < 256; conut++)    acEDID_data[conut] = 0xff;
                    }

                    // 跟原来已经设置的EDID 数据比较
                    /*
                    Read_EDID(INPUT_EDID_add + 256 * (HPnum2 - 1), g_edidFlashEdidTable);  //读取目前对应的输入通道的EDID数据
                    for (j = 0; j < EDID_TABLE_LEN - 1; j++) //比较目前的EDID和指定显示器的EDID数据
                    {
                        if (g_tempData[j] == g_edidFlashEdidTable[j])
                        {ediden = 0;}
                        else
                        {
                            ediden = 1;
                            break;
                        }
                    }
                    */

                    if (TRUE) // if (ediden)
                    {

                        //dvSiiDrvAdaptRxHpdSet(HPnum2 - 1, SII_DRV_ADAPT_INP_CTRL__DISABLE);
                        //dvSiiDrvAdaptRxEdidSramWrite(HPnum2 - 1, 0, g_edidFlashEdidTable, EDID_TABLE_LEN);
                        //IWDG_ReloadCounter(); //喂狗
                        //dvSiiDrvAdaptRxHpdSet(HPnum2 - 1, SII_DRV_ADAPT_INP_CTRL__ENABLE);
                        appSystemInputPortEdidDataSet(HPnum2 - 1, edsEDID_IN1 + HPnum1 - 1, acEDID_data);
                        //write_EDID(HPnum2, g_tempData);

