windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
                    }
                }
                //处理反馈信息
                //sprintf(USART1_tx_buff, "EDIDH%02dB%02d      ", HPnum1, HPnum2);
                //strcpy(key_D2, USART1_tx_buff);
                //LCD_LineRefresh(key_D2, LINE2);
                //UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                //UART1_SendBytes("\r\n", 2);
                cCount += SiiSprintf(&acMessage2[cCount], "EDIDH%dB%d", HPnum1, HPnum2);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUIStateChange(uiUART_MESSAGE);


                return (CH_CORRECT);
#endif
				return (cReturnValue = ProCopyEDIDDataOutport2Inport_AudioPCM(HPnum1, HPnum2));
            }
            else
                return (CM_ERROR);
        }
//=====================================================================================
//gxx131023
//EDIDPCM[x].
//将输入端口[x]的EDID信息音频部分改为PCM格式
        pp = StrCmp(USART1_rxtailpoint, "EDIDPCM", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            //BYTE acEdid[256];
            while (*pp != '.')
            {
                user_temp[count++] = *pp;

                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;
            }
            pp = StrCmp(USART1_rxtailpoint, "EDIDPCM", USART1_rxprocesspoint);
            if ((*pp > '/') && (*pp < ':'))
            {
                jiucuo = 0;
                while (*pp != '.')
                {
                    if ((*pp > '/') && (*pp < ':')) // number 0 - 9
                    {
                        HPnum2 = HPnum2 * 10 + *pp - 0x30;
                    }

                    pp++;
                    if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                        pp = USART1_RX_BUFF;

                    jiucuo++;
                    if (jiucuo > 3)
                        return (CM_ERROR);
                }
                if ((HPnum2 > MAX_IN) || (HPnum2 == 0))
                    return (CM_ERROR);
#if 0
                //读出当前的EDID信息
                dvNVRAMUserEdidRead(edsEDID_IN1 + HPnum2 - 1, acEdid); // Read_EDID(INPUT_EDID_add + 256 * (HPnum2 - 1), g_tempData);
                                                                       //处理PCM部分
                if ((acEdid[0] == 0x00) && (acEdid[1] == 0xff) && (acEdid[7] == 0x00))
                {
                    if (acEdid[126] == 0x01) //HDMI的EDID数据
                    {
                        IndexC = EDID_GetDataBlockAddr(acEdid, 0x40, 132);
                        EndT = (acEdid[IndexC] & 0x1F);
                        IndexC = EDID_GetDataBlockAddr(acEdid, 0x20, IndexC + EndT + 1);
                        if (IndexC > 132) //找到音频设置
                        {
                            EndT = (acEdid[IndexC] & 0x1F); //源EDID中音频描述总字节数
                            if ((acEdid[IndexC] == 0x23) && ((acEdid[IndexC + 1] & 0x78) == 0x08))
                            {
                                ediden = 0;
                            }
                            else
                            {
                                if (EndT > 3)
                                    acEdid[130] -= (EndT - 3); //视频描述的偏移地址需要变动
                                acEdid[IndexC] =  0x23;
                                acEdid[IndexC + 1] =  0x09;
                                acEdid[IndexC + 2] =  0x07;
                                acEdid[IndexC + 3] =  0x07;

                                m = IndexC + EndT + 1; //起始下标
                                x = 0;
                                for (n = m; n < 255; n++)
                                {
                                    k = acEdid[n];
                                    acEdid[IndexC + 4 + x] = k;
                                    x++;
                                }

                                for (n = (IndexC + 4 + x); n < 255; n++)
                                {
                                    acEdid[n] = 0;
                                }

                                for (conut = 128; conut < 255; conut++)  crc += acEdid[conut];
                                acEdid[255] = ~(crc - 1);

                                ediden = 1;
                            }
                        }
                        else //没有找到音频配置数据
                        {
                            ediden = 0;
                        }
                    }
                    else //DVI的EDID频数据
                    {
                        for (conut = 128; conut < 256; conut++)    acEdid[conut] = 0xff;
                    }

                    if (ediden)
                    {

                        appSystemInputPortEdidDataSet(HPnum2 - 1, edsEDID_IN1 + HPnum2 - 1, acEdid);
                        //dvSiiDrvAdaptRxHpdSet(HPnum2 - 1, SII_DRV_ADAPT_INP_CTRL__DISABLE);
                        //dvSiiDrvAdaptRxEdidSramWrite(HPnum2 - 1, 0, g_edidFlashEdidTable, EDID_TABLE_LEN);
                        //IWDG_ReloadCounter(); //喂狗
                        //dvSiiDrvAdaptRxHpdSet(HPnum2 - 1, SII_DRV_ADAPT_INP_CTRL__ENABLE);
#if 0
                        //device_slect_9187(HPnum2);
                        SiiRegWrite(Build_cInstance, 0x0010, 0x00); //将热插拔拉低
                        delay_nms(10);
                        SiiDrvNvramSramWrite(Build_cInstance, SRAM_P2, g_tempData, 0, EDID_TABLE_LEN); //更新EDID数据
                        IWDG_ReloadCounter(); //喂狗
                        SiiRegWrite(Build_cInstance, 0x0010, 0x55); //将热插拔拉高，这样的话再次拉高那么信号源就会重新读取EDID数据
                                                                    //disconnect_9187()
#endif
                        //write_EDID(HPnum2, g_tempData);
                    }
                }
                //处理反馈信息

                //sprintf(USART1_tx_buff, "EDIDPCM%02d     ", HPnum2);
                //strcpy(key_D2, USART1_tx_buff);
                // LCD_LineRefresh(key_D2, LINE2);
                //UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                //UART1_SendBytes("\r\n", 2);
                cCount += SiiSprintf(&acMessage2[cCount], "EDIDPCM%d", HPnum2);
                appUIUartMessageSet(NULL, acMessage2, TRUE);
                appUIStateChange(uiUART_MESSAGE);
#endif
				ProModifyEDIDDataInport_AudioPCM(HPnum2);
                return (CH_CORRECT);
            }
            else
                return (CM_ERROR);
        }
        ///////////////////////////////////////////////////////////////////////////
//======================================================================================
/*
EDIDUpgrade[x].	"串口升级EDID数据，[x]表示输入端口,为5表示对所有输入端口操作，
收到指令后，机器会提示请发送EDID文件10S钟超时时间，文件格式为.bin
（为了保证数据正常接收，在发送指令前要断开所有HDBaseT）"

*/
        pp = StrCmp(USART1_rxtailpoint, "EDIDUpgrade", USART1_rxprocesspoint);
        if (pp != NULL)             // EdidM 1B1
        {

            EDID_updata_port = *pp - 0x30;
            if ((EDID_updata_port > 0) && (EDID_updata_port <=(edsEDID_INTERN1-edsEDID_IN1)))
            {
                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;
                if (*pp == '.')
                {
                    USART_data_flag = 1; //标志后续要升级EDID
                    USART_EDIDdata_count = 0;
                    //sys_delay = 550;
                    EdidUpataStart = SiiPlatformTimerSysTicksGet();
                    UART1_SendBytes("Please send the EDID file\r\n", strlen("Please send the EDID file\r\n"));
                    return (CH_CORRECT);
                }
                else
                    return (CM_ERROR); //gxx 140310
            }
            else
                return (CM_ERROR); //gxx 140310
        }
        ///////////////////////////////////////////////////////////////////////////
//======================================================================================
//UpgradeIntEDID[x].	"更新内置EDID数据，[x]表示输入端口,收到指令后，
//机器会提示请发送EDID文件10S钟超时时间，文件格式为.bin"
        pp = StrCmp(USART1_rxtailpoint, "UpgradeIntEDID", USART1_rxprocesspoint);
        if (pp != NULL)             // EdidM 1B1
        {
            EDID_updata_port = *pp - 0x30;
            if ((EDID_updata_port > 0) && (EDID_updata_port <= (edsEDID_EXTERN1-edsEDID_INTERN1)))
            {
                USART_data_flag = 2; //标志后续要升级EDID
                USART_EDIDdata_count = 0;
                //sys_delay = 550;
                EdidUpataStart = SiiPlatformTimerSysTicksGet();
                UART1_SendBytes("Please send the EDID file\r\n", strlen("Please send the EDID file\r\n"));
                return (CH_CORRECT);
            }
            else
                return (CM_ERROR); //gxx 140310
        }
        /////////////////////////////////////////////////////////////////////////////
//============================================================================
// EDID/[x]/[y].	输入端口x使用内置的编号为y的EDID
//
//
        pp = StrCmp(USART1_rxtailpoint, "EDID/", USART1_rxprocesspoint);
        if (pp != NULL)
        {
            while (*pp != '.')
            {
                user_temp[count++] = *pp;

                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;
            }
            pp = StrCmp(USART1_rxtailpoint, "EDID/", USART1_rxprocesspoint);
            while (*pp != '/')
            {
                if ((*pp > '/') && (*pp < ':')) // number 0 - 9
                {
                    HPnum1 = HPnum1 * 10 + *pp - 0x30;
                }

                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;

                jiucuo++;
                if (jiucuo > 3)
                    return (CM_ERROR);
            }
            if ((HPnum1 > MAX_IN) || (HPnum1 == 0))
                return (CM_ERROR);
            jiucuo = 0;
            pp++;
            while (*pp != '.')
            {
                if ((*pp > '/') && (*pp < ':')) // number 0 - 9
                {
                    HPnum2 = HPnum2 * 10 + *pp - 0x30;
                }

                pp++;
                if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;

                jiucuo++;
                if (jiucuo > 3)
                    return (CM_ERROR);
            }
            if ((HPnum2 > (edsEDID_EXTERN1-edsEDID_INTERN1)) || (HPnum2 == 0))
                return (CM_ERROR);

            if (TRUE) 
            {

