windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
                appSystemInputPortEdidSet(HPnum1 - 1, (eEDIDSELECT)(edsEDID_INTERN1 + HPnum2 - 1));

            }

            cCount += SiiSprintf((char*)&acMessage2[cCount], "EDID/%d/%d", HPnum1, HPnum2);
            appUIUartMessageSet(NULL, acMessage2, TRUE);
            appUIStateChange(uiUART_MESSAGE);


            return (CH_CORRECT);
        }
        /////////////////////////////////////////////////////////////////////////////
//===================================================================================================
//%080
// HDCP自动管理(跟随模式)
        pp = StrCmp(USART1_rxtailpoint, "%080", USART1_rxprocesspoint);
        {
            if (pp != NULL)
            {
                if ((*pp >= '0') && (*pp < '2'))
                    HPnum1 = *pp;
                else
                    return (CM_ERROR);
                pp++;
                if (*pp != '.')
                    return (CM_ERROR);
#if 0
                //psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
                psOutputPortMgrData = utilDataMgrWriteLockData(nnOUTPUTPORT_MANAGER_DATA);
                if (HPnum1 == '0') //手动
                {
                    //HDCP_AUTO_FLAG = 0;
                    //AUTO_change_FLAG = 0;
                    for (i = 0; i < MAX_OUT; i++)
                    {
                        psOutputPortMgrData->abHDCP_AUTO[i] = false;
                    }

                    //UART1_SendBytes("%0800\r\n", 7);
                    cCount += SiiSprintf((char*)&acMessage2[cCount], "%s","%0800");
                    appUIUartMessageSet(NULL, acMessage2, TRUE);
                    appUIStateChange(uiUART_MESSAGE);
                    //while (!(USART1->SR & USART_FLAG_TC));
                    //strcpy(D2, "%0800");
                }
                else  if (HPnum1 == '1') //自动
                {
                    //if (psOutputPortMgrData->bHDCP_AUTO == false)
                    {
                        //HDCP_AUTO_FLAG = 1;
                        //NewCommandInFlag = NewCommandInFlag | 0x01;
                        //AUTO_change_FLAG = 1;
                        for (i = 0; i < MAX_OUT; i++)
                        {
                            psOutputPortMgrData->abHDCP_AUTO[i] = true;
                        }

                        //UART1_SendBytes("%0801\r\n", 7);
                        
                        cCount += SiiSprintf(&acMessage2[cCount], "%s","%0801");
                        appUIUartMessageSet(NULL, acMessage2, TRUE);
                        appUIStateChange(uiUART_MESSAGE);
                        //for (i = 0; i < MAX_OUT; i++) OutSwitch_Flag[i] = 1;
                        //OutSwitch_TimeDelay = 200;
                    }
                    //while (!(USART1->SR & USART_FLAG_TC));
                    //strcpy(D2, "%0801");
                }
                utilDataMgrUnlock(nnOUTPUTPORT_MANAGER_DATA,
                                  TRUE);
#endif
				ProConfigHDCPMode(HPnum1);
                //LCD_LineRefresh(D2, LINE2);
                //i2c_EE_write_one_byte(auto_hdcp_manage_add, HDCP_AUTO_FLAG);
                return (CH_CORRECT);
            }
        }
        // IR_IN 1~4 只能输入带载波, 没有加载波功能，只能发给远端
        // IR_ALL_IN 只能控制远端,可以加载波，不能控制本机
        // IR_CTRL  只能控制本机，载波和不载波输入都可以控制本机，MCU 不需要控制。
        // %0900.     红外载波跟随模式
        // %0901.     红外载波强制模式
        pp = StrCmp(USART1_rxtailpoint, "%090", USART1_rxprocesspoint);
        {
            if (pp != NULL)
            {
                if ((*pp >= '0') && (*pp < '2'))
                    HPnum1 = *pp;
                else
                    return (CM_ERROR);
                pp++;
                if (*pp != '.')
                    return (CM_ERROR);
#if 0
                psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

                if (HPnum1 == '0')      //红外载波跟随
                {
                    // IR_carrier_mode = 0;
                    psSystemSettingData->cIR_Carrier_Mode = 0;
                    //send_data_to_FPGA(0xDE);
                    //if (check_ack())
                    //    send_data_to_FPGA(0xDE);
                    dvCPLDIRCarrierSet(FALSE);
                    //UART1_SendBytes("Carrier native\r\n", 16);
                    //sprintf(USART1_tx_buff, "Carrier native\r\n");
                    // strcpy(D2, "Carrier native");
                    cCount += SiiSprintf(&acMessage2[cCount], "%s","Carrier native");
                    appUIUartMessageSet(NULL, acMessage2, TRUE);
                    appUIStateChange(uiUART_MESSAGE);

                }
                else  if (HPnum1 == '1')        //红外载波强制
                {
                    //IR_carrier_mode = 1;
                    psSystemSettingData->cIR_Carrier_Mode = 1;
                    dvCPLDIRCarrierSet(TRUE);
                    //send_data_to_FPGA(0xDF);
                    //if (check_ack())
                    //    send_data_to_FPGA(0xDF);
                    //sprintf(USART1_tx_buff, "Force carrier\r\n");
                    //UART1_SendBytes("Force carrier\r\n", 15);
                    //  strcpy(D2, "Force carrier");
                    cCount += SiiSprintf(&acMessage2[cCount],"%s", "Force carrier");
                    appUIUartMessageSet(NULL, acMessage2, TRUE);
                    appUIStateChange(uiUART_MESSAGE);

                }
                //UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
                                  TRUE);
#endif
				ProConfigIRCarrierMode(HPnum1);
                // LCD_LineRefresh(D2, LINE2);
                // i2c_EE_write_one_byte(IR_carrier_mode_add, IR_carrier_mode);
                return (CH_CORRECT);
            }
        }
//====================================================================================
//开启HDMI的数字声音;[x]1,2,3,4表示单独开一组的数字声音，
//为5表示开启所有输出的数字声音
        pp = StrCmp(USART1_rxtailpoint, "DigitAudioON", USART1_rxprocesspoint);
        {
            //BYTE cInstance = 0;
            if (pp != NULL)
            {
                HPnum1 = *pp - 0x30;
                pp++;
                if (*pp != '.')
                    return (CM_ERROR);
#if 0
                if ((HPnum1 < (MAX_OUT + 1)) && (HPnum1 > 0))        //开启声音
                {
                    cSii9533Instance = utilOutputPortToInstance(HPnum1 - 1);
                    if ((HPnum1 == 1) || (HPnum1 == 2))
                    {
                        //device_slect_9187(HPnum1+5);

                        //SiiDrvRxAudioMixPassThroughConfig(cSii9533Instance, true, true);
                        dvSii9533TXAudioMixPassThroughConfig(cSii9533Instance, true, true);
                        //device_slect_9187(HPnum1+6);
                        dvSii9533TXAudioMixPassThroughConfig(cSii9533Instance + 1, true, true);
                    }
                    else
                    {
                        //device_slect_9187(HPnum1+6);
                        dvSii9533TXAudioMixPassThroughConfig(cSii9533Instance, true, true);
                    }
                    //digit_audio[HPnum1 - 1] = 1;
                    sprintf(USART1_tx_buff, "DigitAudio ON with Output %d\r\n", HPnum1);
                    UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                    //i2c_EE_write_one_byte(Digit_audio_addr + (HPnum1 - 1), digit_audio[HPnum1 - 1]);
                }
                else if (HPnum1 == (MAX_OUT + 1))
                {
                    for (j = 0; j < MAX_OUT; j++)
                    {
                        //digit_audio[j] = 1;
                        HPnum1 = j + 1;
                        if ((HPnum1 == 1) || (HPnum1 == 2))
                        {
                            //device_slect_9187(HPnum1+5);
                            dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), true, true);
                            //device_slect_9187(HPnum1+6);
                            dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1) + 1, true, true);
                        }
                        else
                        {
                            //device_slect_9187(HPnum1+6);
                            dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), true, true);
                        }
                        //i2c_EE_write_one_byte(Digit_audio_addr + j, digit_audio[j]);
                    }
                    sprintf(USART1_tx_buff, "DigitAudio ON with ALL Outputs\r\n");
                    UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                }
                else
                    return (CM_ERROR);
                return (CH_CORRECT);
#endif 
				return (cReturnValue = ProDigitAudioON(HPnum1));
            }
        }
        pp = StrCmp(USART1_rxtailpoint, "DigitAudioOFF", USART1_rxprocesspoint);
        {
            if (pp != NULL)
            {
                HPnum1 = *pp - 0x30;
                pp++;
                if (*pp != '.')
                    return (CM_ERROR);
#if 0
                if ((HPnum1 < (MAX_OUT + 1)) && (HPnum1 > 0))      //关闭声音
                {
                    if ((HPnum1 == 1) || (HPnum1 == 2))
                    {
                        //device_slect_9187(HPnum1+5);
                        dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), false, true);
                        //device_slect_9187(HPnum1+6);
                        dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1) + 1, false, true);
                    }
                    /*
                    else if (HPnum1 == 2)
                    {
                        //device_slect_9187(HPnum1+3);
                        SiiDrvRxAudioMixPassThroughConfig(Build_cInstance, false, true);
                        //device_slect_9187(HPnum1+6);
                        SiiDrvRxAudioMixPassThroughConfig(Build_cInstance, false, true);
                    }
                    else 
                    */
                    {
                        //device_slect_9187(HPnum1+6);
                        dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), false, true);
                    }
                    //digit_audio[HPnum1 - 1] = 0;

