windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
                    sprintf(USART1_tx_buff, "DigitAudio OFF with Output %d\r\n", HPnum1);
                    UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                    //i2c_EE_write_one_byte(Digit_audio_addr + (HPnum1 - 1), digit_audio[HPnum1 - 1]);
                }
                else if (HPnum1 == (MAX_OUT + 1))
                {
                    for (j = 0; j < MAX_OUT; j++)
                    {
                        //digit_audio[j] = 0;
                        HPnum1 = 1 + j;
                        if ((HPnum1 == 1) || (HPnum1 == 2))
                        {
                            //device_slect_9187(HPnum1+5);
                            dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), false, true);
                            //device_slect_9187(HPnum1+6);
                            dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1) + 1, false, true);
                        }
                        /*
                        else if (HPnum1 == 2)
                        {
                            //device_slect_9187(HPnum1+3);
                            SiiDrvRxAudioMixPassThroughConfig(Build_cInstance, false, true);
                            //device_slect_9187(HPnum1+6);
                            SiiDrvRxAudioMixPassThroughConfig(Build_cInstance, false, true);
                        } 
                        */
                        else
                        {
                            //device_slect_9187(HPnum1+6);
                            dvSii9533TXAudioMixPassThroughConfig(utilOutputPortToInstance(HPnum1 - 1), false, true);
                        }
                        // i2c_EE_write_one_byte(Digit_audio_addr + j, digit_audio[j]);
                    }
                    sprintf(USART1_tx_buff, "DigitAudio OFF with ALL Outputs\r\n");
                    UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                }
                else
                    return (CM_ERROR);
                return (CH_CORRECT);
#endif
				return (cReturnValue = ProDigitAudioOFF(HPnum1));
            }
        }
///////////////////////查询指令///////////////////////////////////////////////
//============================================================================================
        pp = StrCmp(USART1_rxtailpoint, "%997", USART1_rxprocesspoint);
        {
            if (pp != NULL)
            {
                while (*pp != '.')
                {
                    pp++;
                    if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                        pp = USART1_RX_BUFF;
                    jiucuo++;
                    if (jiucuo > 1)
                        return (CM_ERROR);
                }
                pp = StrCmp(USART1_rxtailpoint, "%997", USART1_rxprocesspoint);
                #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
                if ((*pp > '0') && (*pp <= '9'))
                #else
                if ((*pp > '0') && (*pp < '9'))
                #endif
                {
#if 0
                    switch (*pp)
                    {
                    case '1' :          // %9971
                        appUIStateChange(uiUART_INCONNECT_INFO);
                        break;
                    case '2' :
                        appUIStateChange(uiUART_OUTCONNECT_INFO); // uiSYSTEM_OUTCONNECT_INFO
                        break;
                    case '3' :
                        appUIStateChange(uiUART_IN_HDCP_INFO);
                        break;
                    case '4' :
                        appUIStateChange(uiUART_OUT_HDCP_INFO);
                        break;
                    case '5' :
                        appUIStateChange(uiUART_SWITCH_INFO);
                        break;
                    case '6' :
                        appUIStateChange(uiUART_OUT_RESOLUTION_INFO);
                        break;
                    case '7' : //查询输出通道的数字声音状态
                        appUIStateChange(uiUART_OUT_HDMIAUDIO_INFO);
                        break;
                    case '8' : //查询输入端的HDCP兼容状态
                        appUIStateChange(uiUART_IN_HDCPENABLE_INFO);
                        break;
                    default :
                        break;
                    }
#endif
					ProQueryAudioVedioStatus(*pp);
                }
                else
                    return (CM_ERROR);
                return (CH_CORRECT);
            }
        }
        //////////////////////////////////////////////////////////////////////////////
//==========================================================================
        pp = StrCmp(USART1_rxtailpoint, "%996", USART1_rxprocesspoint);
        {
            if (pp != NULL)
            {
                if ((*pp > '0') && (*pp < '5'))
                    HPnum1 = *pp;
                else
                    return (CM_ERROR);
                pp++;
                if (*pp != '.')
                    return (CM_ERROR);
/*               while (*pp != '.')
                {
                    pp++;
                    if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                        pp = USART1_RX_BUFF;
                    jiucuo++;
                    if (jiucuo > 1)
                        return (CM_ERROR);
                }*/
#if 0
                switch (HPnum1)
                {
                case '1' :
                    appUIStateChange(uiSYSTEM_LOCK_INFO);
                    break;
                case '2' :
                    sprintf(USART1_tx_buff, "PWON \r\n");
                    UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));

                    break;
                case '3' :
                    // NO LCD Disaplay
                    psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrReadLockData(nnSYSTEM_SETTING_DATA);
                    if (psSystemSettingData->cIR_Carrier_Mode == 0)
                    {
                        sprintf(USART1_tx_buff, "Carrier native\r\n");
                        UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                    }
                    else if (psSystemSettingData->cIR_Carrier_Mode == 1)
                    {
                        sprintf(USART1_tx_buff, "Force carrier\r\n");
                        UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                    }
                    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
                                      FALSE);
                    break;

                case '4' :
                    appUIStateChange(uiUART_IP_INFO);
                    break;
                default :
                    break;

