windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
                }
#endif
				ProQuerySystermStatus(HPnum1);
                return (CH_CORRECT);
            }
        }
        //////////////////////////////////////////////////////////////////////////////
#ifdef PRD_POWER_ONOFF_MESSAGE
        pp = StrCmp(USART1_rxtailpoint, "%994", USART1_rxprocesspoint);
        {
            if (pp != NULL)
            {
                if ((*pp > '0') && (*pp <=( '0'+MAX_OUT)))
                    HPnum1 = *pp - 0x30;
		  else
		  	  return (CM_ERROR);

                pp++;
                if (*pp != '.')
                    return (CM_ERROR);
#if 0
                psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrReadLockData(nnSYSTEM_SETTING_DATA);
      
                    if (psSystemSettingData->acPowerOffMsgLength[HPnum1 -1] == 0)
                        sprintf(USART1_tx_buff, "Port %d: NO Data\r\n", HPnum1);
                    else
                        sprintf(USART1_tx_buff, "Port %d: %s when PWOFF\r\n", HPnum1 , psSystemSettingData->acPowerOffMsg[HPnum1 - 1]);
  
                utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
                                  FALSE);
                UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                return (CH_CORRECT);
#endif
               return (cReturnValue = ProQueryPortPWOFFSendData(HPnum1));
            }
        }

        pp = StrCmp(USART1_rxtailpoint, "%995", USART1_rxprocesspoint);
        {
            if (pp != NULL)
            {
                if((*pp > '0') && (*pp <=( '0'+MAX_OUT)))
                    HPnum1 = *pp - 0x30;
                else
                    return (CM_ERROR);

                pp++;
                if (*pp != '.')
                    return (CM_ERROR);
                /*              while (*pp != '.')
                               {
                                   pp++;
                                   if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                                       pp = USART1_RX_BUFF;
                                   jiucuo++;
                                   if (jiucuo > 1)
                                       return (CM_ERROR);
                               }*/
#if 0
                psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrReadLockData(nnSYSTEM_SETTING_DATA);
                if ((HPnum1 > 0) && (HPnum1 < 5))
                {
                    // if (PWON_datalen[HPnum1-1] == 0)
                    if (psSystemSettingData->acPowerOnMsgLength[HPnum1 - 1] == 0)
                        sprintf(USART1_tx_buff, "Port %d: NO Data\r\n", HPnum1);
                    else
                        sprintf(USART1_tx_buff, "Port %d: %s when PWON\r\n", HPnum1, psSystemSettingData->acPowerOnMsg[HPnum1 - 1]);
                }
                else if ((HPnum1 > 4) && (HPnum1 < 9))
                {
                    if (psSystemSettingData->acPowerOffMsgLength[HPnum1 - 5] == 0)
                        sprintf(USART1_tx_buff, "Port %d: NO Data\r\n", HPnum1);
                    else
                        sprintf(USART1_tx_buff, "Port %d: %s when PWOFF\r\n", HPnum1 - 4, psSystemSettingData->acPowerOffMsg[HPnum1 - 5]);
                }
                else
                {
                    utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
                                      FALSE);
                    return (CM_ERROR);

                }
                utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
                                  FALSE);
                UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                return (CH_CORRECT);
#endif
				return (cReturnValue = ProQueryPortPWONSendData(HPnum1));
            }
        }
#endif
        //////////////////////////////////////////////////////////////////////////////
        pp = StrCmp(USART1_rxtailpoint, "%0911", USART1_rxprocesspoint);
        {
            if (pp != NULL)
            {
                while (*pp != '.')
                {
                    pp++;
                    if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                        pp = USART1_RX_BUFF;
                    jiucuo++;
                    if (jiucuo >= 1)
                        return (CM_ERROR);
                }
                //_ Factory_initialization();
                sprintf(USART1_tx_buff, "Factory Default\r\n");
                UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                //sprintf(USART1_tx_buff, "Plesse Reboot System\r\n");
                //UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
#if 0
                utilDataMgrReset(nveRESETALL);
		   		appUIIRKeyEnableSet(TRUE);
                for (i = 0; i < MAX_IN; i++)
                {
                    appSystemInputPortEdidSet(i, edsEDID_IN1 + i);
                }
                for (j = 0; j < MAX_OUT; j++)
                {
                    //digit_audio[j] = 1;
                    dvCpldRemoteBraundSet(j + 1);

                    if ((j == 0) || (j == 1))
                    {
                        //device_slect_9187(HPnum1+5);
                        dvSii9533TXAudioMixPassThroughConfigStart(utilOutputPortToInstance(j));
                        //device_slect_9187(HPnum1+6);
                        dvSii9533TXAudioMixPassThroughConfigStart(utilOutputPortToInstance(j) + 1);
                    }
                    else
                    {
                        //device_slect_9187(HPnum1+6);
                        dvSii9533TXAudioMixPassThroughConfigStart(utilOutputPortToInstance(j));
                    }
                    //i2c_EE_write_one_byte(Digit_audio_addr + j, digit_audio[j]);
                }
                dvCPLDIRCarrierSet(FALSE); //[kyq ADD: 20151010 11:42:15]
                appSystemSwitcherSetStart();
#ifdef PRD_IR_OUT
                appSystemIRSwitcherSetStart();
#endif
#endif
				ProRecallFactoryDefault();
                // any other need to process?
                return (CH_CORRECT);
            }
        }
//===========================================================
        /////////////////////DEBUG///////////////////////////////

        if (StrCmp(USART1_rxtailpoint, "SIIMON", USART1_rxprocesspoint) != NULL)
        {
            BYTE cNumber = 0;
            temppoint = USART1_rxtailpoint + 6; //

