windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
            while (*(temppoint + i) != '.')
            {

                cNumber = *(temppoint + i) - '0';
                i++;
                if (temppoint + i >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    break;

            } // end while

            SkSiMonUartNumberSet(cNumber);
            return CH_CORRECT;
        }

        if (StrCmp(USART1_rxtailpoint, "DEBUGEN.", USART1_rxprocesspoint) != NULL)
        {
            SiiPlatformLoggerPrintEnable(TRUE);
            return CH_CORRECT;
        }
        if (StrCmp(USART1_rxtailpoint, "DEBUGCOLORON.", USART1_rxprocesspoint) != NULL)
        {
            SiiPlatformLoggerColorEnable(TRUE);
            return CH_CORRECT;
        }
        if (StrCmp(USART1_rxtailpoint, "DEBUGCOLOROFF.", USART1_rxprocesspoint) != NULL)
        {
            SiiPlatformLoggerColorEnable(FALSE);
            return CH_CORRECT;
        }
        if (StrCmp(USART1_rxtailpoint, "GITVERSION.", USART1_rxprocesspoint) != NULL)
        {
            
            UART1_SendData2PC(m_acGitHash,strlen(m_acGitHash));
            return CH_CORRECT;
        }

        //DEBUGLEVEL255.
        if (StrCmp(USART1_rxtailpoint, "DEBUGLEVEL", USART1_rxprocesspoint) != NULL)
        {
            BYTE cNumber = 0;
            temppoint = USART1_rxtailpoint + 10; //strlen("DEBUGLEVEL"); //     SiiCecSendUserControlCmd();
            i = 0;
            while (*(temppoint + i) != '.')
            {

                cNumber = cNumber * 10 + (*(temppoint + i) - '0');
                i++;
                if (temppoint + i >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    break;

            } // end while
            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
            psSystemSettingData->cDebugLevel = 	cNumber;
            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
            SiiPlatformLoggerMessageLevelSet(cNumber);
            return CH_CORRECT;
        }
    	        //DEBUGLEVEL255.
        if (StrCmp(USART1_rxtailpoint, "DEBUGPOST", USART1_rxprocesspoint) != NULL)
        {
            BYTE cNumber = 0;
            temppoint = USART1_rxtailpoint + 10; //strlen("DEBUGLEVEL"); //     SiiCecSendUserControlCmd();
            i = 0;
            while (*(temppoint + i) != '.')
            {

                cNumber = cNumber * 10 + (*(temppoint + i) - '0');
                i++;
                if (temppoint + i >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    break;

            } // end while
            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
            psSystemSettingData->cPOSTEnable = 	cNumber;
            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
            return CH_CORRECT;
        }
        /////////////////////工厂调试指令///////////////////////////////
        //////////////////////////////////////////////////////////////////////////////
#if 0
        pp = StrCmp(USART1_rxtailpoint, "%9980", USART1_rxprocesspoint);
        {
            if (pp != NULL)
            {
                while (*pp != '.')
                {
                    pp++;
                    if (pp >= (USART1_RX_BUFF + USART1_RX_BUFF_MAX))
                    pp = USART1_RX_BUFF;
                    jiucuo++;
                    if (jiucuo >= 1)
                    return (CM_ERROR);
                }
                sys_check();
                return (CH_CORRECT);
            }
        }
        pp = StrCmp(USART1_rxtailpoint, "%999", USART1_rxprocesspoint);
        {
            if ((*pp > '0') && (*pp < '5'))
            {
                UART1_SendByte(dvADN4604Read(0, ch_out[*pp - 0x31]));
                UART1_SendByte(dvADN4604Read(0, ch_out[*pp - 0x31] + 1));

                UART1_SendByte(dvADN4604Read(0, ch_out_en[*pp - 0x31]));
                UART1_SendByte(dvADN4604Read(0, ch_out_en[*pp - 0x31] + 1));
                UART1_SendByte(dvADN4604Read(0, ch_out_en[*pp - 0x31] + 2));
                UART1_SendByte(dvADN4604Read(0, ch_out_en[*pp - 0x31] + 3));
                return (CH_CORRECT);
            }
            else if (*pp == '9')
            {
                i2c_EE_write_one_byte(first_use_add, 0x51);
                UART1_SendBytes("EEPROM_init\r\n", strlen("EEPROM_init\r\n"));
                return (CH_CORRECT);
            }
        }
#endif
        /*  	 
        pp = StrCmp(USART1_rxtailpoint, "%988",USART1_rxprocesspoint) ;  
        {
            if((*pp > '0')&&(*pp < '7'))
            {   
                 UART1_SendByte(bUpHDMIMode[*pp-0x31]);
                
                 UART1_SendByte(VState[*pp-0x31]);
                 UART1_SendByte(TxDev[*pp-0x31].TxVState);
                 
                 UART1_SendByte(TxDev[*pp-0x31].bTxInputVideoMode);
                 UART1_SendByte(TxDev[*pp-0x31].bTxOutputVideoMode);
                 
               UART1_SendByte(MuteByPKG[*pp-0x31]);
               
               UART1_SendByte(TxDev[*pp-0x31].AudSrcHBR);
               UART1_SendByte(TxDev[*pp-0x31].bTxAudSel);
               UART1_SendByte(TxDev[*pp-0x31].AucSrcLPCM);
                 return(CH_CORRECT); 	
            }    		 
        }  
        */
        //gxx 140310

        // wf8421 20160823
        #ifdef ENABLE_DB9_BAUDRATE_SWITCH
        if(StrCmp(USART1_rxtailpoint, "Baudrate 2400.",USART1_rxprocesspoint) != NULL)
        {
            Function_SetPcUartBaudrate(1); // set baudrate 2400
            return(CH_CORRECT);    
        }
        if(StrCmp(USART1_rxtailpoint, "Baudrate 4800.",USART1_rxprocesspoint) != NULL)
        {
            Function_SetPcUartBaudrate(2); // set baudrate 4800
            return(CH_CORRECT);    
        }
        if(StrCmp(USART1_rxtailpoint, "Baudrate 9600.",USART1_rxprocesspoint) != NULL)
        {
            Function_SetPcUartBaudrate(3); // set baudrate 9600
            return(CH_CORRECT);    
        }
        if(StrCmp(USART1_rxtailpoint, "Baudrate 19200.",USART1_rxprocesspoint) != NULL)
        {
            Function_SetPcUartBaudrate(4); // set baudrate 19200
            return(CH_CORRECT);    
        }
        if(StrCmp(USART1_rxtailpoint, "Baudrate 38400.",USART1_rxprocesspoint) != NULL)
        {
            Function_SetPcUartBaudrate(5); // set baudrate 38400
            return(CH_CORRECT);    
        }
        if(StrCmp(USART1_rxtailpoint, "Baudrate 57600.",USART1_rxprocesspoint) != NULL)
        {
            Function_SetPcUartBaudrate(6); // set baudrate 57600
            return(CH_CORRECT);    
        }
        if(StrCmp(USART1_rxtailpoint, "Baudrate 115200.",USART1_rxprocesspoint) != NULL)
        {
            Function_SetPcUartBaudrate(7); // set baudrate 115200
            return(CH_CORRECT);    
        }
        if(StrCmp(USART1_rxtailpoint, "Get Baudrate.",USART1_rxprocesspoint) != NULL)
        {
            Function_QueryBaudrate(); // set baudrate 115200
            return(CH_CORRECT);    
        }
        #endif
        if(StrCmp(USART1_rxtailpoint, "RemoteCtrl Open.",USART1_rxprocesspoint) != NULL)
        {
            Function_SetRemoteCtrlMcu(TRUE);
            return(CH_CORRECT);    
        }
        if(StrCmp(USART1_rxtailpoint, "RemoteCtrl Close.",USART1_rxprocesspoint) != NULL)
        {
            Function_SetRemoteCtrlMcu(FALSE);
            return(CH_CORRECT);    
        }
        if(StrCmp(USART1_rxtailpoint, "Get RemoteCtrl.",USART1_rxprocesspoint) != NULL)
        {
            Function_QueryRemoteCtrlMcuStatus();
            return(CH_CORRECT);    
        }
        #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE == MHUB4K431))
        if(StrCmp(USART1_rxtailpoint, "Get RemoteBaudrate.",USART1_rxprocesspoint) != NULL)
        {
            Function_QueryRemoteBaudrateStatus(0);
            return(CH_CORRECT);    
        }
        #else
        if(StrCmp(USART1_rxtailpoint, "Get RemoteBaudrate",USART1_rxprocesspoint) != NULL)
        {
            pp = USART1_rxtailpoint+strlen("Get RemoteBaudrate");
            #if (MACHINETYPE == MUH4K862)
            if((*pp>'0')&&(*pp<=MAX_OUT-2+'0'))
            #elif (MACHINETYPE == MHUB4K431)
            if((*pp>'0')&&(*pp<=MAX_OUT-1+'0'))
            #else
            if((*pp>'0')&&(*pp<=MAX_OUT+'0'))
            #endif
            {
                cOutPort = *pp-'0';
                if(*(pp+1)!='.')
                    return (CM_ERROR);
                Function_QueryRemoteBaudrateStatus(cOutPort);
                return(CH_CORRECT);    
            }
            return (CM_ERROR);
        }
        #endif
        return (CM_ERROR);
    }
    
