windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
    if (RXdata == ';')
    {
        /*
            if (powerflag == 1)
                return (OTHERS);
            if (sDEMOFlag == 1)
                sDEMOFlag = 0;
            if (standby == 1)
            {
                standby = 0; //取消待机模式
                i2c_EE_write_one_byte(Standby_addr, standby);
            }
        */
//=========================================================================
///     %Lock;	键盘的锁定

        if (StrCmp(USART1_rxtailpoint, "/%Lock;", USART1_rxprocesspoint) != NULL) // System Lock
        {
#if 0
            System = OFF;
            sprintf(USART1_tx_buff, "System Locked!\r\n");
            UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
            strcpy(D2, "System Locked!");
            LCD_LineRefresh(D2, LINE2);
            i2c_EE_write_one_byte(sys_lock_flag_add, System);
            //gxx 131217
            EXTI->IMR &= ~EXTI_Line11;
#endif
            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
            psSystemSettingData->bSystemLock = true;
            System_UnLock_flag = psSystemSettingData->bSystemLock;
            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
                              TRUE);
            appUIIRKeyEnableSet(FALSE);
            appUIStateChange(uiSYSTEM_LOCK_INFO);
            //sprintf(USART1_tx_buff, "System Locked!\r\n");
            //UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
            //m_eNextState = uiSYSTEM_LOCK;
            //SiiPlatformTimerSet(etUI_CLEAR, mS_TO_TICKS(3000L));
            //EXTI->IMR &= ~EXTI_Line11;
            return (OTHERS);
        }
        if (StrCmp(USART1_rxtailpoint, "/%Unlock;", USART1_rxprocesspoint) != NULL) // System Unlock
        {
#if 0
            System = ON;
            sprintf(USART1_tx_buff, "System Unlock!\r\n");
            UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
            strcpy(D2, "System Unlock!");
            LCD_LineRefresh(D2, LINE2);
            i2c_EE_write_one_byte(sys_lock_flag_add, System);
            //gxx 131217
            EXTI->IMR |= EXTI_Line11;
#endif
            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
            psSystemSettingData->bSystemLock = FALSE;
            System_UnLock_flag = psSystemSettingData->bSystemLock;
            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
                              TRUE);
            appUIIRKeyEnableSet(TRUE);
            appUIStateChange(uiSYSTEM_LOCK_INFO);

            //sprintf(USART1_tx_buff, "System Unlock!\r\n");
            //UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
            //m_eNextState = uiSYSTEM_Unlock;
            //SiiPlatformTimerSet(etUI_CLEAR, mS_TO_TICKS(3000L));
            return (OTHERS);
        }
//===========================================================================
// 查询
        if (StrCmp(USART1_rxtailpoint, "/*Type;", USART1_rxprocesspoint) != NULL) // System Type
        {
            //psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrReadLockData(nnSYSTEM_SETTING_DATA);

            appUIStateChange(uiUART_SYSTEM_TYPE);
            return (OTHERS);
        }
        if (StrCmp(USART1_rxtailpoint, "/^Version;", USART1_rxprocesspoint) != NULL) // Software Version
        {
            appUIStateChange(uiSYSTEM_VERSION);
            return (OTHERS);
        }
	if (StrCmp(USART1_rxtailpoint, "/^TestVersion;", USART1_rxprocesspoint) != NULL) // Software Version
        {
                 UART1_SendData2PC(TEST_FW_Version, strlen(TEST_FW_Version));
               return (OTHERS);
         }
#if 0
        if (StrCmp(USART1_rxtailpoint, "/:MessageOff;", USART1_rxprocesspoint) != NULL)              // "/:MessageOff;"
        {
            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
            psSystemSettingData->bUartReturnMessage_EN = OFF;
            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
                              TRUE);
            appUIStateChange(uiSYSTEM_MESSAGE_ONOFF_INFO);
            return (OTHERS);
        }
        if (StrCmp(USART1_rxtailpoint, "/:MessageOn;", USART1_rxprocesspoint) != NULL)              // "/:MessageOn;"
        {
            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);
            psSystemSettingData->bUartReturnMessage_EN = ON;
            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA,
                              TRUE);
            appUIStateChange(uiSYSTEM_MESSAGE_ONOFF_INFO);
            return (OTHERS);
        }
#endif
    }
    //gxx 140310
    return (CM_ERROR);
    //return(CH_CORRECT);
}
#endif

//单条指令的头指针 USART1_rxtailpoint
//单条指令的尾指针 USART1_rxprocesspoint
//串口数据的尾指令 USART1_rxpoint
void Uart1_process(void)
{
    unsigned char rxdata = 0, temp = 0/*,  crc = 0*/;
  
    unsigned char *USART1_rxtailpoint;         // buffer 头指针
    unsigned char *USART1_rxprocesspoint; // 当前指针
    unsigned char *pp = NULL;
    //uint16_t sys_ID = 0x07ff;
    uint16_t	i = 0/*, j = 0*/;

    USART1_rxtailpoint = USART1_RX_BUFF;
    USART1_rxprocesspoint = USART1_RX_BUFF;
    if (SkTimeDiffMs(EdidUpataStart, SiiPlatformTimerSysTicksGet()) > mS_TO_TICKS(10000))
    {
        USART_data_flag = 0;
    }
    
#if ((MACHINETYPE == MUH4K862)||(MACHINETYPE==MHUB4K431))
    if(!GetUartReceiveStar())
    {
        if(g_bUSART1_DataComplete == 1)
        {
            memset(USART1_RX_BUFF, 0, USART1_RX_BUFF_MAX); //清掉整个buff
            g_bUSART1_DataComplete = 0;
        }
        return;
    }
#endif
  // 垃圾代码
    if (g_bUSART1_DataComplete == 1)
    {
        //串口超出100ms 没有收到数据，认为数据已完成
        if (USART_data_flag == 0)
        {
            #if 0 // wf8421 for test
            for(i=0;i<USART1_rxpoint-USART1_RX_BUFF;i++)
            {
                APP_Printf("%c",USART1_RX_BUFF[i]);
            }
            APP_Printf("\n");
            i=0;
            #endif
            ////0  正常指令
            IWDG_ReloadCounter(); //喂狗
                                  // 从头开始一个一个数据比较
           // while (USART1_rxprocesspoint != USART1_rxpoint) //USART1_rxpoint是尾指针
            while (USART1_rxprocesspoint < USART1_rxpoint) //USART1_rxpoint是尾指针
            {
                //USART1_rxtailpoint
                //   |       rxdata
                //   |         |USART1_rxprocesspoint
                //   |         |              |
                //  []   []   []             []          []     [][][][][][][][][][][][][][][][]
                //
                //
                //
                //


                rxdata = *USART1_rxprocesspoint;
                USART1_rxprocesspoint++;

		 //[kyq Begin: 20151118 17:33:18]
#if 0//def  PRD_VHD4
                 if(USART1_rxprocesspoint>=USART1_rxpoint)
			 break;
#endif
	       //[kyq End: 20151118 17:33:24]

		   //UART1_SendByte(rxdata);	
                i++; //统计这串指令的长度
                if (i > USART1_RX_BUFF_MAX)
                {
                    g_bUSART1_DataComplete = FALSE; //uart_data_in_end = 0;
                    USART1_rxpoint = USART1_RX_BUFF;
                    memset(USART1_RX_BUFF, 0, USART1_RX_BUFF_MAX); //清掉整个buff
                    return;
                }
//Huang 2016-Jun-28, 17:35:10
                if (((rxdata == '.') || (rxdata == ';')) // 指令逻辑问题还是比较多，经不起推敲
                #ifdef  PRD_VHD4_CMD_END
    			&&(*USART1_rxprocesspoint=='~')
                #endif
                #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE == MHUB4K431))
                ||((*USART1_rxtailpoint == 0xa5) && (*(USART1_rxtailpoint + 1) == 0x5b))
                #endif
			    )
                {
                  if((USART1_rxprocesspoint < USART1_rxpoint))
                  	{
                        if (rxdata == ';')
                        {
                            //如果是/+指令，说明；是属于用户数据，不能做为结束符
                            if ((*USART1_rxtailpoint == '/') && (*(USART1_rxtailpoint + 1) == '+')) // /+ 开头
                                continue;
    
                            /********************************************gxx 131023  *************************************/
                            // 如果是设定系统指令，说明;不是结束符
                            if ((*USART1_rxtailpoint == 0xfa) || (*USART1_rxtailpoint == 0xfb) || (*USART1_rxtailpoint == 0xfc) || (*USART1_rxtailpoint == 0xf1) || (*USART1_rxtailpoint == 0xf2) || (*USART1_rxtailpoint == 0xf3))
                                continue;
                            #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE == MHUB4K431))
                            if((*USART1_rxtailpoint == 0xa5) && (*(USART1_rxtailpoint + 1) == 0x5b))
                                continue;
                            #endif
                        }
                        else
                        {
                            //如果.后面还是一个.说明这个.属于用户数据，不能做为结束符
                            if ((*USART1_rxprocesspoint == '.')&&(USART1_rxprocesspoint < USART1_rxpoint))
                                continue;
                            /********************************************gxx 131023  *************************************/
                            // 如果是IP指令，说明.不是结束符
                            if ((*USART1_rxtailpoint == 'I') && (*(USART1_rxtailpoint + 1) == 'P'))
                                continue;
                            // 如果是设定系统指令，说明.不是结束符
                            if ((*USART1_rxtailpoint == 0xfa) || (*USART1_rxtailpoint == 0xfb) || (*USART1_rxtailpoint == 0xfc) || (*USART1_rxtailpoint == 0xf1) || (*USART1_rxtailpoint == 0xf2) || (*USART1_rxtailpoint == 0xf3))
                                continue;
                            #if ((MACHINETYPE == MUH4K862)||(MACHINETYPE == MHUB4K431))
                            if((*USART1_rxtailpoint == 0xa5) && (*(USART1_rxtailpoint + 1) == 0x5b))
                                continue;
                            #endif
                        }
                  	}
                    //碰到.  ; 结束符
                    temp = do_with_type(rxdata, USART1_rxtailpoint, USART1_rxprocesspoint); //传递头指针,尾指令
                    // add by kyq 20150929                                                                        //USART_LCD(temp);
                    if ((CH_CORRECT == temp)&& (!m_bCommdDemo)
                        &&appSystemSwitchDemoModeEnableGet())
                    {
                        appSystemSwitchDemoModeEnableSet(FALSE);
                    }
                    // kyq 20151012
                     if((temp==CH_ERROR)||(temp==CM_ERROR))//
                    {
                        UART1_SendBytes("CMD Error!\r\n", strlen("CMD Error!\r\n"));
                    }
                     // end
                    USART1_rxtailpoint = USART1_rxprocesspoint; //将尾指令赋给头指令


