windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
                }
//==============================================================
                else if (rxdata == 0xfe)
                {
                    pp = USART1_rxtailpoint;
                    if ((*pp != 0xfa) && (*pp != 0xfb) && (*pp != 0xfc) && (*pp != 0xf1) && (*pp != 0xf2) && (*pp != 0xf3))
                    {  
                        continue; // kyq 20151126
                    }
                    else
                        //sys_delay = 150; //设定为10S
                        if (*pp == 0xfa)
                        {
#if 0
                            PSYSTEM_SETTING_DATA   psSystemSettingData;
                            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);


                            pp++;
                            for (i = 0; i < 16; i++)
                            {
                                if (*(pp + i) != 0xfe)
                                    psSystemSettingData->acProduct_Name[i] = *(pp + i);
                                else
                                    break;
                            }
							psSystemSettingData->acProduct_Name[16] = 0;// kyq 20151201
                            if (i == 16)
                            {
                                psSystemSettingData->acProduct_Name[i] = 0;

                                UART1_SendBytes("sys_name is ", strlen("sys_name is "));
                                sprintf(USART1_tx_buff, "%s \r\n", psSystemSettingData->acProduct_Name);
                                UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                            }
                            else
                                UART1_SendBytes("sys_name setting fail!", strlen("sys_name setting fail!"));
                            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
#endif
							ProModifyProductName(pp);
                        }
//=============================================================================
                        else if (*pp == 0xfb)
                        {
#if 0
                            PSYSTEM_SETTING_DATA   psSystemSettingData;
                            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

                            pp++;
                            for (i = 0; i < 16; i++)
                            {
                                if (*(pp + i) != 0xfe)
                                    psSystemSettingData->acProduct_Type[i] = *(pp + i);
                                else
                                    break;
                            }
							psSystemSettingData->acProduct_Type[16] = 0; // kyq 20151201
                            if (i == 16)
                            {
                                psSystemSettingData->acProduct_Type[i] = 0;
                                // for(j=0;j<i;j++)  i2c_EE_write_one_byte(sys_type_add+j,sys_type[j]);

                                UART1_SendBytes("sys_type is ", strlen("sys_type is "));
                                sprintf(USART1_tx_buff, "%s \r\n", psSystemSettingData->acProduct_Type);
                                UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                            }
                            else
                                UART1_SendBytes("sys_type setting fail!", strlen("sys_type setting fail!"));

                            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
#endif
							ProModifyProductType(pp);
                        }
//=========================================================================
                        else if (*pp == 0xfc)   // 改默认EDID 的厂家名字
                        {
#if 0
                            PSYSTEM_SETTING_DATA   psSystemSettingData;
                            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

                            pp++;
                            for (i = 0; i < 3; i++)
                            {
                                if (*(pp + i) != 0xfe)
                                    psSystemSettingData->acDefaultEdidProductName[i] = *(pp + i); //   [i] = *(pp+i) ;
                                else
                                    break;
                            }
                            if (i == 3)
                            {
                                psSystemSettingData->acDefaultEdidProductName[i] = 0; // EDID_name[i] = 0;

                                if (psSystemSettingData->acDefaultEdidProductName[2] >= 'A')
                                {
                                    sys_ID &= 0xffe0; //清掉低5位
                                    sys_ID |= psSystemSettingData->acDefaultEdidProductName[2] - 0x40;
                                }
                                if (psSystemSettingData->acDefaultEdidProductName[1] >= 'A')
                                {
                                    sys_ID &= 0xfc1f; //清掉中5位
                                    sys_ID |= ((psSystemSettingData->acDefaultEdidProductName[1] - 0x40) << 5);
                                }
                                if (psSystemSettingData->acDefaultEdidProductName[0] >= 'A')
                                {
                                    sys_ID &= 0x03ff; //清掉高5位
                                    sys_ID |= ((psSystemSettingData->acDefaultEdidProductName[0] - 0x40) << 10);
                                }

                                g_Init_EdidFlashEdidTable[8] = sys_ID >> 8;
                                g_Init_EdidFlashEdidTable[9] = sys_ID;
                                for (i = 0; i < 127; i++)  crc += g_Init_EdidFlashEdidTable[i];
                                g_Init_EdidFlashEdidTable[127] = ~(crc - 1);

                                UART1_SendBytes("EDID_name is ", strlen("EDID_name is "));
                                sprintf(USART1_tx_buff, "%s \r\n", psSystemSettingData->acDefaultEdidProductName);
                                UART1_SendBytes((uint8_t *)USART1_tx_buff, strlen(USART1_tx_buff));
                                //[kyq Begin: 20150820 20:03:17]

                                dvNVRAMUserEdidWrite(edsEDID_Default, g_Init_EdidFlashEdidTable);
                                //[kyq End: 20150820 20:03:20]




