windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
                            }
                            else
                                UART1_SendBytes("EDID_name setting fail!", strlen("EDID_name setting fail!"));


                            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
#endif
							ProModifyDefaultEDIDName(pp);
                        }                        
                        else if (*pp == 0xf1)
                        {
#if 0
                            PSYSTEM_SETTING_DATA   psSystemSettingData;
                            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

                            pp++;
                            for (i = 0; i < 16; i++)
                            {
                                if (*(pp + i) != 0xfe)
                                    LCD1_IDLE_TEXT[i] = *(pp + i);
                                else
                                    break;
                            }
							LCD1_IDLE_TEXT[16] = 0;
                            if (i == 16)
                            {

                                memcpy(psSystemSettingData->acLCDLine1DefaultTXT, LCD1_IDLE_TEXT, 16);
                                appUIStateChange(uiSPLASH);

                                {
                                    UART1_SendBytes("LCD 1: ", strlen("LCD 1: "));
                                    for (j = 0; j < 16; j++)
                                    {
                                        UART1_SendByte(LCD1_IDLE_TEXT[j]);
                                    }
                                    UART1_SendBytes("\r\n", 2);
                                }
                            }
                            else
                            {
                                UART1_SendBytes("Error!\r\n", strlen("Error!\r\n"));
                            }
                            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
#endif
							ProModifyLCD1Display(pp);
                        }
                        else if (*pp == 0xf2)
                        {
                        #if 0
                            PSYSTEM_SETTING_DATA   psSystemSettingData;
                            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

                            pp++;
                            for (i = 0; i < 16; i++)
                            {
                                if (*(pp + i) != 0xfe)
                                    LCD2_IDLE_TEXT[i] = *(pp + i);
                                else
                                    break;
                            }
                            LCD2_IDLE_TEXT[16] = 0;
                            if (i == 16)
                            {

                                memcpy(psSystemSettingData->acLCDLine2DefaultTXT, LCD2_IDLE_TEXT, 16);
                                appUIStateChange(uiSPLASH);

                                {

                                    UART1_SendBytes("LCD 2: ", strlen("LCD 2: "));
                                    for (j = 0; j < 16; j++)
                                    {
                                        UART1_SendByte(LCD2_IDLE_TEXT[j]);
                                    }
                                    UART1_SendBytes("\r\n", 2);
                                }
                            }
                            else
                            {
                                UART1_SendBytes("Error!\r\n", strlen("Error!\r\n"));
                            }
                            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
                        #endif
							ProModifyLCD2Display(pp);
                        }
//===========================================================================
                        else if (*pp == 0xf3)
                        {
                        #if 0
                            BYTE IP_add[4];
      
                            PSYSTEM_SETTING_DATA   psSystemSettingData;
                            psSystemSettingData = (PSYSTEM_SETTING_DATA)utilDataMgrWriteLockData(nnSYSTEM_SETTING_DATA);

                            if (get_ip_add(pp, IP_add))
                            {
                                //ip_set_ok = 1;
                                for (i = 0; i < 4; i++) //i2c_EE_write_one_byte(sys_IP_add + i, IP_add[i]);
                                {
                                    psSystemSettingData->acIP_Address[i] = IP_add[i];
                                }
                                appUIStateChange(uiUART_IP_INFO);

                            }
                            utilDataMgrUnlock(nnSYSTEM_SETTING_DATA, TRUE);
                        #endif
							ProModifyIPAddress(pp);
                        }
//==============================================================================

                    USART1_rxtailpoint = USART1_rxprocesspoint; //将尾指令赋给头指令

                }
                IWDG_ReloadCounter(); //喂狗
            }
            USART1_rxpoint = USART1_RX_BUFF;
            memset(USART1_RX_BUFF, 0, i); //清掉这串指令
        }
        else if (USART_data_flag == 1)
        {
            IWDG_ReloadCounter(); //喂狗
            EdidUpataStart = SiiPlatformTimerSysTicksGet();
            do_with_EDID_UP();
            USART_data_flag = 0;
            USART_EDIDdata_count = 0;

        }
        else if (USART_data_flag == 2)
        {
            IWDG_ReloadCounter(); //喂狗
            EdidUpataStart = SiiPlatformTimerSysTicksGet();
            do_with_int_EDID_UP();
            USART_data_flag = 0;
            USART_EDIDdata_count = 0;
        }

        g_bUSART1_DataComplete = 0;
    }
}

void UART1_Init(void)
{
    USART1_rxpoint = USART1_RX_BUFF;
}

int APP_Printf(char *fmt, ...)
{
    int i, iret;
    char szPrint[256];
    va_list ap;

