windycore/CompanyMaterial-/stm32_software/HMX_441_4K_Kit/rti-vhd-4-stm32/STM32/Project/Virtual_COM_Port/UserRs232Module/uart.c
    va_start(ap, fmt);
    iret = vsnprintf(szPrint, 256, fmt, ap);
    va_end(ap);

    for (i = 0; i < iret; i++)
    {
        if(szPrint[i]=='\n')
            UART1_SendByte('\r');
        UART1_SendByte(szPrint[i]);
    }

    return iret;
}

//串口数据发给DB9(PC)
void UART1_SendData2PC(PBYTE pcBuf, BYTE cLength)
{
    dvCpldMcuUartConnectToRemote(FALSE); // 不发这个数据，所有远端都能收到数据
    UART1_SendBytes(pcBuf, cLength);
    UART1_SendByte(0x0D);
    UART1_SendByte(0x0A);
    dvCpldMcuUartConnectToRemote(TRUE);
}

//串口HEX 数据发给DB9(PC)
void UART1_SendHexData2PC(PBYTE pcBuf, BYTE cLength)
{
   unsigned char Checksum=0;
   unsigned char i;
    dvCpldMcuUartConnectToRemote(FALSE); // 不发这个数据，所有远端都能收到数据
    UART1_SendBytes(pcBuf, cLength);
   for(i=0;i<cLength;i++)
   Checksum+=pcBuf[i];
   Checksum=0x100-Checksum;
    UART1_SendByte(Checksum);
    dvCpldMcuUartConnectToRemote(TRUE);
}

//串口数据发给Remote(402)
// 这个函数还不能用
void UART1_SendData2Remote(BYTE cRemote, PBYTE pcBuf, BYTE cLength)
{
    dvCpldUartRemote2McuSet(cRemote);
    UART1_SendBytes(pcBuf, cLength);
    dvCpldUartRemote2McuSet(0xf);
}

#if 1
#define _PRINTF_C_

#include <stdio.h>
#include <stdarg.h>
#include <limits.h>
//#include "USART.h"
//#include "Printf.h"

#ifndef ASSERT
#define ASSERT(expr)    do {} while (0)
#endif

#define COMPATIBILITY_8051      1

#define to_digit(c)     ((c) - '0')
#define is_digit(c)     ((unsigned) to_digit(c) <= 9)

static const char hex16[] = { '0', '1', '2', '3', '4', '5', '6', '7',
                              '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };

/*
 * %[-^][digits][.digits][scd]
 */

#define ZEROPAD     (1 << 0)
#define LADJUST     (1 << 1)
#define CADJUST     (1 << 2)

/*
 * Length
 */
#define LEN_DEFAULT     0
#define LEN_CHAR        1
#define LEN_SHORT       2
#define LEN_LONG        3
#define LEN_LONGLONG    4

#define PRINTF_CHAR_MAX     256

#define NUM(str, n, base)                   \
    do {                                    \
        if (n < base)                       \
            *--str = hex16[n];              \
        else                                \
            do {                            \
                *--s = hex16[n % base];     \
            } while ( (n /= base) );        \
    } while (0)

int Uart_vsnprintf(char *str, size_t size, const char *fmt, va_list ap)
{
    signed int          sInt;
    unsigned int        uInt;
    signed long long    sLongLong;
    unsigned long long  uLongLong;

    int flags, width, prec, length;
    char *s, *p, *dst, *strMax;
    char digit[24];

    ASSERT(str != NULL && fmt != NULL);

    dst = str;
    strMax = str + size;

    while ( (uInt = *fmt++) )
    {

        if (uInt != '%')
        {
            if (dst < strMax)
                *dst++ = uInt;
            continue;
        }

        /* % */

        width = 0;
        length = LEN_DEFAULT;
        flags = 0;
        prec = -1;

    rflag:                /* read flag */
        uInt = *fmt++;

    reswitch:

        switch (uInt)
        {

        case 's':
            s = va_arg(ap, char *);
            if (width != 0 || prec >= 0)
            {
                p = s;
                if (prec < 0)
                    while (*p)
                        p++;
                else
                    while (*p && prec-- > 0)
                        p++;
                prec = p - s;
                break;
            }

            while ( (dst < strMax) && (*dst = *s) )
            {
                s++;
                dst++;
            }
            continue;

        case 'd':
        case 'u':
            p = s = digit + sizeof(digit);
            if (length == LEN_LONGLONG)
            {
                uLongLong = va_arg(ap, unsigned long long);
                if (uInt == 'd')
                {
                    sLongLong = uLongLong;
                    if (sLongLong < 0)
                        uLongLong = -sLongLong;
                    NUM(s, uLongLong, 10);
                    if (sLongLong < 0)
                        *--s = '-';
                }
                else
                {
                    NUM(s, uLongLong, 10);
                }
            }
            else
            {
                if (uInt == 'd')
                {
                    sInt = uInt = va_arg(ap, int);
                    if (sInt < 0)
                        uInt = -sInt;
                    NUM(s, uInt, 10);
                    if (sInt < 0)
                        *--s = '-';
                }
                else
                {
                    uInt = va_arg(ap, int);
                    NUM(s, uInt, 10);
                }
            }

            ASSERT( (p - s) <= (int) sizeof(digit));

            uInt = p - s;
            if (prec < 0 || prec > (int) uInt)
                prec = uInt;
            break;

        case 'p':
        case 'x': case 'X':
            p = s = digit + sizeof(digit);
            if (length == LEN_LONGLONG)
            {
                uLongLong = va_arg(ap, unsigned long long);
                NUM(s, uLongLong, 16);
            }
            else
            {
                uInt = va_arg(ap, int);
                NUM(s, uInt, 16);
            }

            ASSERT( (p - s) <= (int) sizeof(digit));

            uInt = p - s;
            if (prec < 0 || prec > (int) uInt)
                prec = uInt;
            break;

        case 'c':
            *(s = digit) = va_arg(ap, int);
            prec = 1;
            break;

        case '*':  /* must be postive value */
            width = va_arg(ap, int);
            goto rflag;

        case '0':
            flags |= ZEROPAD;
            goto rflag;

        case '1': case '2': case '3': case '4': case '5':
        case '6': case '7': case '8': case '9':
            width = to_digit(uInt);

            while (is_digit( (uInt = *fmt++) ) )
            {
                /* width = 10 * width + to_digit(uInt); */
                width <<= 1;
                width += (width << 2) + to_digit(uInt);
            }
            goto reswitch;

        case '.':
            uInt = *fmt++;
            if (uInt == '*')
            {
                prec = va_arg(ap, int);
                goto rflag;
            }

            ASSERT(is_digit(uInt));

            if (is_digit(uInt))
            {
                prec = to_digit(uInt);

